---
title: "Mouais."
---

<h1>Mouais.</h1><p>Le <strong>technicien sup&eacute;rieur</strong>, c&rsquo;est le mec qui vient me demander toutes les 3 minutes ce que je voudrais qu&rsquo;on fasse sur tel ou tel probl&egrave;me. Pas d&rsquo;initiative, surtout pas. Mais comment lui en vouloir, il est compl&egrave;tement conditionn&eacute;. Alors je lui r&eacute;p&egrave;te et r&eacute;p&egrave;te encore tout ce dont je me fous compl&egrave;tement.</p>
<p>L&rsquo;*ing&eacute;nieur*, c&rsquo;est l&rsquo;autre mec qui va regarder ce qu&rsquo;a fait le technicien sup&eacute;rieur, qui va remarquer que toutes les adresses mails comportent des majuscules, et qui va tout lui faire refaire. Note au lecteur non informaticien : les adresses mails NE <span class="caps">SONT</span> <span class="caps">PAS</span> sensibles &agrave; la casse. Ca signifie que Pada@chanmasters.com, PADA@chanmasters.com et pada@chanmasters.com arriveront au m&ecirc;me endroit. Ca signifie qu&rsquo;on s&rsquo;en fout qu&rsquo;il y ait 3 majuscules qui trainent dans des fichiers de conf. Ca signifie que l&rsquo;ing&eacute;nieur est au mieux un tatillon, au pire un maniaque et un obs&eacute;d&eacute;, en tout cas un type contre-productif.</p>
<p>La <strong>chef</strong>, c&rsquo;est celle qui est partie en week-end le jeudi &agrave; 16h en me disant de recopier des tableaux Excel. Elle les a ins&eacute;r&eacute;s dans un .doc en image, donc ils ne sont pas &eacute;ditables, donc il faut les refaire de 0 parce qu&rsquo;elle n&rsquo;a plus l&rsquo;original. Un vrai boulot intelligent et tout. Qu&rsquo;elle aille se faire mettre, je ne sais pas pourquoi je lui ai dit oui, je me demande si ce n&rsquo;est m&ecirc;me pas moi qui lui ai propos&eacute;&hellip; C&rsquo;est aussi celle qui a encore &eacute;t&eacute; raconter des b&ecirc;tises &agrave; un fournisseur. Celle qui impose du fait de son ignorance qu&rsquo;on appelle un chat un chien. Qui va donc finir par me rendre fou et semer l&rsquo;incompr&eacute;hension chez les autres qui sont incapables de comprendre le double discours technique. Je songe &agrave; lui proposer d&rsquo;appeler <em><span class="caps">BEGGLE</span></em> notre infrastructure <a href="http://fr.wikipedia.org/wiki/Storage_area_network"><span class="caps">SAN</span></a>. C&rsquo;est <a href="http://en.wikipedia.org/wiki/Josh_Lyman">Josh</a> qui va &ecirc;tre content.</p>
<p><strong>Mais qu&rsquo;est ce que je fous l&agrave; ?!? Ventresaintgris. Zut. Bordel.</strong></p>
<p>J&rsquo;ai ferm&eacute; la porte de mon bureau (pourquoi &ldquo;<em>cellule</em>&rdquo; r&eacute;sonne dans ma t&ecirc;te ?). Je m&rsquo;accorde un <del>d&eacute;but d&rsquo;</del> apr&egrave;s-midi tranquille.</p>
<p>Je d&eacute;vore <a href="http://www.amazon.fr/Mes-hommes-Malika-Mokeddem/dp/2246686415">un bouquin au hasard</a>.</p>
<p>Pas que j&rsquo;esp&egrave;re mieux La comprendre<sup class="footnote"><a href="#fn1">1</a></sup>. Pas que j&rsquo;aie &eacute;t&eacute; retourn&eacute; par les discussions avec Elle ou ma soeur ou leurs amies<sup class="footnote"><a href="#fn2">2</a></sup>. Le style est envo&ucirc;tant, rythm&eacute;, po&eacute;tique. Juste ce qu&rsquo;il faut. On saute du coq <del>&agrave; l&rsquo;&acirc;ne</del> au chameau sans arr&ecirc;t. J&rsquo;adore, &agrave; quelques phrases pr&egrave;s, empoisonn&eacute;es d&rsquo;associations trop tarabiscott&eacute;es o&ugrave; mon cerveau cart&eacute;sien d&eacute;croche. Les histoires me touchent, me font un peu mal, m&rsquo;emm&egrave;nent subrepticement ailleurs, me renvoient &agrave; mon exp&eacute;rience propre ou celle des autres, me font r&eacute;fl&eacute;chir par intermittence, juste une fraction de seconde entre deux paragraphes.</p>
<p>Si tu voyais <em>&ldquo;ces putins d&rsquo;mega-nuages qu&rsquo;ya pas&rdquo;</em>, Tu viendrais danser sous la pluie avec moi je crois :-)</p>
<p>Cheers !</p>
<p>&mdash;</p>
<p><strong><acronym title="15h52"><span class="caps">EDIT</span></acronym></strong> : il faut se rendre &agrave; l&rsquo;&eacute;vidence, j&rsquo;ai relu mes deux derniers billets.. J&rsquo;&eacute;cris comme une fille.</p>
<p>&mdash;</p>
<p class="footnote"><sup>1</sup> Je ne veux pas la comprendre, ou plut&ocirc;t je ne veux pas rentrer par effraction dans le processus de compr&eacute;hension. On a bien le temps&hellip;</p>
<p class="footnote"><sup>2</sup> Il n&rsquo;y avait vraiment pas besoin&hellip; Peut-&ecirc;tre le r&eacute;sultat de 17 ans uniquement au milieu de filles.</p>