---
title: "Journalisme à la con (1)"
---

<h1>Journalisme à la con (1)</h1><p>Un <a href="http://embruns.net/logbook/2008/05/29.html#006522">symathique article d&eacute;nich&eacute; via Embruns</a> sur des pirates de haut vol, dont certains &eacute;taient encore au coll&egrave;ge, et dont la fili&egrave;re a &eacute;t&eacute; d&eacute;mantel&eacute;e il y a peu par les fins limiers fran&ccedil;ais ! La conclusion me parait particuli&egrave;rement juste : youpi, vous pouvez dormir sur vos deux oreilles.</p>


	<p>Ll&rsquo;Etat Fran&ccedil;ais et ses Forces de l&rsquo;Ordre traquent donc de dangereux criminels. Pour r&eacute;sumer, cette bande a brill&eacute; par le deface de plusieurs sites, ce qui veut dire qu&rsquo;ils ont exploit&eacute; une faille du site (dans un formulaire probablement, injection sql ou xss) pour modifier la page d&rsquo;accueil et y mettre un message de leur cru, g&eacute;n&eacute;ralement &agrave; haute teneur philosophique. Le <strong>cerveau de la bande</strong> &eacute;tait un chomeur de 25 ans : il faut bien admettre que quand on est ch&ocirc;meur, on a tout le temps d&rsquo;apprendre de <strong>dangereuses techniques de pointe</strong> en informatique, comme le defacement&hellip; D&rsquo;ailleurs, il semble que certains membres de la troupe soient <strong>toujours en cavale</strong>, puisque <a href="http://www.lefigaro.fr/actualite-france/2008/05/29/01016-20080529ARTFIG00011-une-filiere-de-pirates-informatiques-demantelee.php">le lien sit&eacute; par Embruns sur lefigaro.fr</a> renvoie sur un article qui n&rsquo;a rien &agrave; voir. Peut-&ecirc;tre pour effacer leurs traces ? Planquez-vous, ils sont peut-&ecirc;tre en train de pirater votre PC !</p>


Plus s&eacute;rieusement : qu&rsquo;est-ce qui fait le plus froid dans le dos :
	<ul>
	<li>A: que de l&rsquo;argent public soit gaspill&eacute; &agrave; courser ces noobs (qui ne font &agrave; coup s&ucirc;r qu&rsquo;exploiter l&rsquo;extr&ecirc;me incomp&eacute;tence ou le boulot bacl&eacute; des webmasters des dits-sites) ?</li>
		<li>B: que les m&ecirc;mes noobs soient trop cons pour se faire pincer ?</li>
		<li>C: que le journaliste fasse une affaire d&rsquo;&eacute;tat d&rsquo;un acte qui a autant de cons&eacute;quences r&eacute;elles que le vol d&rsquo;une trotinette ?</li>
		<li>D: Obiwan Kenobi</li>
	</ul>


	<p>Je vous laisse sur ces petites pens&eacute;es, je file remettre en place les sites que j&rsquo;ai defac&eacute; dans la nuit ! <strong>Brrr</strong>...</p>
