---
title: "Give me the step"
---

<h1>Give me the step</h1><p>J&rsquo;&eacute;tais perdu dans mes r&ecirc;vasseries dans le metro, &agrave; l&rsquo;instant, et j&rsquo;ai eu une sorte de r&eacute;v&eacute;lation. Frapp&eacute; par la gr&acirc;ce divine<sup class="footnote"><a href="#fn1">1</a></sup>, l&rsquo;&eacute;vidence me rattrappe, j&rsquo;ai tourn&eacute; en rond. J&rsquo;ai mis pour ainsi dire 20 ans &agrave; revenir &agrave; ma position initiale. Je voulais &ecirc;tre un grand professeur, principalement pour des consid&eacute;rations g&eacute;ographiques, pour annihiler le manque, et ensuite de prestige. J&rsquo;ai ensuite h&eacute;sit&eacute; entre prof d&rsquo;EPS, trialiste pro, et pilote de ligne. Ah, les mioches.</p>
<p><img src="/assets/2008/8/18/card.JPG" alt="" /></p>
<p>Aujourd&rsquo;hui, j&rsquo;op&egrave;re chaque jour des malades chroniques<sup class="footnote"><a href="#fn2">2</a></sup>, finalement. Je fais mon tour r&eacute;guli&egrave;rement, parfois suivi par une partie de mon &eacute;quipe. Je supervise le suivi en temps r&eacute;el de la sant&eacute; de mes patients, je n&rsquo;esp&egrave;re aucune sortie mais je veille &agrave; sans cesse am&eacute;liorer leur &eacute;tat de sant&eacute;. Je corrige un probl&egrave;me, et dans l&rsquo;instant je fais face aux complications qui en d&eacute;coulent. J&rsquo;essaie d&rsquo;avoir une vue globale, de r&eacute;partir mon temps efficacement pour ceux qui sont le plus en danger, les plus critiques. Parfois je m&rsquo;autorise une perte de temps sur un cas int&eacute;ressant, m&ecirc;me sans espoir. Les techniques &eacute;voluent, je me tiens &agrave; jour, par la presse sp&eacute;cialis&eacute;e, via des s&eacute;minaires, voire par le truchement de mes exp&eacute;riences personnelles. Et tout &ccedil;a me ravit, je vais &ecirc;tre plus efficace, je vais changer de point de vue, augmenter mon taux de r&eacute;ussite, bref faire le bien&hellip; informatiquement. De ce c&ocirc;t&eacute; l&agrave; je crois que je lui ressemble, et je doute que vous arriviez &agrave; me sortir de ce parall&egrave;le douteux. Il n&rsquo;en soup&ccedil;onne rien et ne lira jamais tout &ccedil;a, bien s&ucirc;r, mais j&rsquo;ai quand m&ecirc;me mis 20 ans &agrave; revenir &agrave; mon point de d&eacute;part&hellip; Comme dirait Jed, et sans r&eacute;ponse pour le moment, <em>what&rsquo;s next ?</em></p>
<p>&mdash;</p>
<p>PS: il y a un peu moins de deux mois je me demandais pourquoi je n&rsquo;avais pas envie de l&acirc;cher une certaine main, et ce soir, en 5 minutes, je crois que j&rsquo;ai su. Glurps.<br />
<span class="caps">PPS</span>: c&rsquo;est pas tout &ccedil;a mais j&rsquo;ai une liste &agrave; faire moi, c&rsquo;est s&eacute;rieux ces trucs-l&agrave;, &ccedil;a ne se traite pas par dessous la jambe.<br />
<span class="caps">PPPS</span>: cherche bonne volont&eacute; pour transformer mon appart&rsquo; en palace d&rsquo;ici demain matin, il faut que ce petit d&eacute;jeuner reste <em>dans les annales de l&rsquo;Empire</em>.</p>
<p>&mdash;</p>
<p class="footnote"><sup>1</sup> Ou pas.</p>
<p class="footnote"><sup>2</sup> D&rsquo;un genre particulier, certes.</p>
<p><em>Cr&eacute;dit photo : <a href="http://brujo.deviantart.com/">click</a></em></p>