---
title: "Opération Sarkozy : comment la CIA a placé un de ses agents à la présidence de la République française"
---

<h1>Opération Sarkozy : comment la CIA a placé un de ses agents à la présidence de la République française</h1><p>Un <a href="http://www.voltairenet.org/article157210.html">article int&eacute;ressant</a>, enfin, qui le serait s&rsquo;il n&rsquo;&eacute;tait pas bourr&eacute; de b&ecirc;tises et de sous-entendus vicieux&hellip;</p>
<p>Je ne suis pas fan de ce genre d&rsquo;article compl&egrave;tement &agrave; charge. J&rsquo;ai lu en diagonale, sauf la premi&egrave;re partie historique qui m&rsquo;a un peu gonfl&eacute;.<br />
Au niveau factuel &ccedil;a a l&rsquo;air &agrave; peu pr&egrave;s juste, mais c&rsquo;est tr&egrave;s orient&eacute;, et r&eacute;dig&eacute; de fa&ccedil;on tr&egrave;s partiale. Suivez le guide (commentaires non syst&eacute;matiques, en vrac et au hasard)&hellip;</p>
<blockquote>
<p>Comme des enfants qui viennent de faire une grosse b&ecirc;tise, les Fran&ccedil;ais sont trop occup&eacute;s &agrave; se trouver des excuses pour admettre l&rsquo;ampleur des d&eacute;g&acirc;ts et leur na&iuml;vet&eacute;.</p>
</blockquote>
<p>Ah bon ? Les Fran&ccedil;ais ressentent &ccedil;a, vraiment ? Vive le d&eacute;lire gauchiste-n&eacute;vros&eacute; quoi&hellip;</p>
<blockquote>
<p>Pour comprendre comment un homme en qui tous s&rsquo;accordent aujourd&rsquo;hui &agrave; voir l&rsquo;agent des &Eacute;tats-Unis et d&rsquo;Isra&euml;l a pu devenir le chef du parti gaulliste [&hellip;]</p>
</blockquote>
<p>Tous ? Encore ? Ah&hellip; Ok.</p>
<blockquote>
<p>Cependant, Nicolas ne tarde pas &agrave; trahir sa femme [&hellip;]</p>
</blockquote>
<p>Qu&rsquo;est ce que c&rsquo;est que ce sous-entendu minable ? Cette tournure de phrase d&eacute;plac&eacute;e ? La trahison fait partie de tr&egrave;s nombreux couples  qui se disloquent. Elle est encore &eacute;voqu&eacute;e &agrave; plusieurs reprises dans la suite. Vous avez dit &ldquo;&agrave; charge&rdquo; ?</p>
<blockquote>
<p>En 1993, la gauche perd les &eacute;lections l&eacute;gislatives. Le pr&eacute;sident Fran&ccedil;ois Mitterrand refuse de d&eacute;missionner et entre en cohabitation avec un Premier ministre de droite.</p>
</blockquote>
<p>Hein ? Qu&rsquo;ou&iuml;s-je ? Le pr&eacute;sident devrait d&eacute;missionner suite &agrave; des l&eacute;gislatives ?!? Et puis, c&rsquo;est la seconde cohabitation de Mitterrand, ce n&rsquo;est pas la premi&egrave;re fois que le PS se prend une tarte et je ne vois pas pourquoi une d&eacute;mission aurait &eacute;t&eacute; de mise.</p>
<blockquote>
<p>Jacques Chirac [&hellip;] refuse d&rsquo;&ecirc;tre &agrave; nouveau Premier ministre et laisse la place &agrave; son &laquo; ami de trente ans &raquo;, Edouard Balladur.</p>
</blockquote>
<p>Chouette, refaisons l&rsquo;histoire, c&rsquo;est Jacques Chirac qui a install&eacute; Balladur &agrave; Matignon en 1993. Et puis quoi encore ? Les propositions refus&eacute;es de nomination au gouvernement sont traditionnellement confidentielles. D&rsquo;une part l&rsquo;hypoth&egrave;se d&rsquo;un Balladur comme second choix est quasi-inv&eacute;rifiable, d&rsquo;autre part je vois mal Mitterrand s&rsquo;&ecirc;tre fait souffler un nom par Chirac avec qui il a v&eacute;cu une premi&egrave;re cohabitation difficile.</p>
<blockquote>
<p>Rien ne va plus dans le parti gaulliste o&ugrave; les amis d&rsquo;hier sont pr&egrave;s de s&rsquo;entre-tuer.</p>
</blockquote>
<p>A ceci pr&egrave;s que depuis 1995 ils ont gagn&eacute; la plupart des scrutins nationaux d&rsquo;envergure, ce qui est tout de m&ecirc;me l&rsquo;objectif principal d&rsquo;un parti important, non ? Oublions &ccedil;a.</p>
<blockquote>
<p>Nous r&eacute;v&eacute;lons ici que le pr&eacute;fet &Eacute;rignac n&rsquo;a pas &eacute;t&eacute; tu&eacute; par des nationalistes, mais abattu par un tueur &agrave; gage, imm&eacute;diatement exfiltr&eacute; vers l&rsquo;Angola o&ugrave; il a &eacute;t&eacute; engag&eacute; &agrave; la s&eacute;curit&eacute; du groupe Elf. Le mobile du crime &eacute;tait pr&eacute;cis&eacute;ment li&eacute; aux fonctions ant&eacute;rieures d&rsquo;&Eacute;rignac, responsable des r&eacute;seaux africains de Charles Pasqua au minist&egrave;re de la Coop&eacute;ration. Quand &agrave; Yvan Colonna, c&rsquo;est un ami personnel de Nicolas Sarkozy depuis des d&eacute;cennies et leurs enfants se sont fr&eacute;quent&eacute;s.</p>
</blockquote>
<p>Chouette, <span class="caps">SAS</span> a sorti un nouveau bouquin ? Rendez-vous au Relay H de la gare la plus proche&hellip;</p>
<blockquote>
<p>Villepin se d&eacute;fend de ce dont on l&rsquo;accuse, mais il est mis en examen, assign&eacute; &agrave; r&eacute;sidence et, de facto, &eacute;cart&eacute; provisoirement de la vie politique. La voie est libre &agrave; droite pour Nicolas Sarkozy.</p>
</blockquote>
<p>Voir <a href="http://www.marianne2.fr/Sarko,-french-gaffeur-saison-2-Obama-a-l-Elysee_a89544.html?voir_commentaire=oui">ici</a> pour un d&eacute;montage en r&egrave;gle&hellip; Non mais s&eacute;rieusement, le Premier Ministre aurait &eacute;t&eacute; assign&eacute; &agrave; r&eacute;sidence sans que personne ne le sache ? C&rsquo;est &agrave; mourir de rire&hellip;</p>
<blockquote>
<p><em>[&agrave; propos de Christine Lagarde]</em> Au sein du Center for International &amp; Strategic Studies de Dick Cheney, elle a co-pr&eacute;sid&eacute; avec Zbigniew Brzezinski un groupe de travail qui a supervis&eacute; les privatisations en Pologne.</p>
</blockquote>
<p>C&rsquo;est s&ucirc;r que quand on a la fibre gauchiste ou alter-mondialiste, ce genre de phrase naus&eacute;abonde assimile imm&eacute;diatement Mme Lagarde &agrave; un supp&ocirc;t de Satan. Bouh, des privatisations, Cheytane est partout !</p>
<blockquote>
<p>Quand les Fran&ccedil;ais auront-ils des yeux pour voir &agrave; qui ils ont affaire ?</p>
</blockquote>
<p>Quand il y aura des journalistes dignes de ce nom, qui fuient le sensationnel et les d&eacute;lires parano&iuml;aques pour faire leur m&eacute;tier&hellip;</p>
<p>&mdash;</p>
<p>S&eacute;rieusement, Gwendonline&hellip; Si je commence &agrave; d&eacute;tester mon pays, si je commence &agrave; en avoir v&eacute;ritablement honte<sup class="footnote"><a href="#fn1">1</a></sup>, c&rsquo;est &agrave; cause de sa politique d&rsquo;immigration aveugle et sans justification rationnelle. Je hais mes responsables politiques parce qu&rsquo;ils sont infoutus d&rsquo;opposer des visions du monde de grande envergure, parce que la gauche est incapable de sortir de son opposition syst&eacute;matique absurde, parce que la droite devient de plus en plus populiste et d&eacute;mago. Fort heureusement, je fais encore travailler mon cerveau, et quand je vois ce genre d&rsquo;article, je d&eacute;teste encore plus certains journalistes de mon pays :-)</p>
<p>&mdash;</p>
<p>PS: <em>Womack ! Pourquoi est-ce que je n&rsquo;suis pas surpris, esp&egrave;ce de balai &agrave; chiottes !</em></p>
<p><span class="caps">PPS</span>: Pfiou&hellip; Merci.</p>
<p>&mdash;</p>
<p class="footnote"><sup>1</sup> <em>La France, tu l&rsquo;aimes o&ugrave; tu la quittes.</em> Bient&ocirc;t, je la quitterai, toi-m&ecirc;me tu sais pourquoi.</p>
