---
title: "Pushing the limits"
---

<h1>Pushing the limits</h1><ul>
	<li>Il y a de nombreux probl&egrave;mes qui n&rsquo;en sont que parce qu&rsquo;on le d&eacute;cide, ou qu&rsquo;on les laisse nous pourrir joyeusement le moral. Aujourd&rsquo;hui, j&rsquo;ai d&eacute;cid&eacute; qu&rsquo;un de ces probl&egrave;mes n&rsquo;en &eacute;tait plus un, j&rsquo;ai essay&eacute; de le crier<sup class="footnote"><a href="#fn1">1</a></sup>, et je me suis senti lib&eacute;r&eacute;, d&rsquo;un coup. Aucune pr&eacute;m&eacute;ditation, m&ecirc;me si j&rsquo;ai &eacute;t&eacute; un peu aid&eacute;, j&rsquo;ai pris ma d&eacute;cision sur un coup de t&ecirc;te, et j&rsquo;en suis ravi. Je m&rsquo;y tiendrai au mieux. En plus j&rsquo;ai l&rsquo;impression qu&rsquo;Elle &eacute;tait contente, alors adieu C&ocirc;t&eacute; Obscur, rions-nous des lames de fond en profitant !</li>
	<li>J&rsquo;ai mis une sonnerie Wall-E sur mes <span class="caps">SMS</span>. Je vous laisse le lien <a href="http://www.moviesoundclips.net/movies1/wall-e/wall-e.wav">ici</a>, parce que je suis super sympa (et aussi super bizarre)</li>
	<li>Comme je suis un peu grognon parfois, je vais raler contre ces cr&eacute;tins de chez Apache qui obligent &agrave; avoir une fully-qualified <span class="caps">URL</span> pour la directive <code>RedirectMatch</code>. C&rsquo;est absolument d&eacute;bile. Si on a pas de mod_rewrite et qu&rsquo;on utilise du <code>ServerAlias</code> pour des domaines inter et intranet, on fait comment ? Pff.</li>
	<li>Comme je suis un peu geek sur les bords, je conseille aux lecteurs un peu geeks d&rsquo;installer <a href="https://people.mozilla.com/~avarma/ubiquity-0.1.xpi">Ubiquity</a>, une extension Firefox qui transforme votre renard pr&eacute;f&eacute;r&eacute; en v&eacute;ritable <del>poste de commandement</del> Central Dogma de vos activit&eacute;s web :-)</li>
	<li>Comme je suis attentif et pr&eacute;venant, je vous pr&eacute;viens : ne t&eacute;l&eacute;chargez pas IE8, c&rsquo;est bel et bien de la merde</li>
	<li>Enfin, comme je suis fatigu&eacute;, je vais faire une ptite sieste ;-) Sayonara.<br />
 &mdash;</li>
</ul>
<p class="footnote"><sup>1</sup> En vrai je l&rsquo;ai juste dit normalement, mais &ccedil;a fait plus styl&eacute; !</p>