---
title: "Billet du matin chagrin"
---

<h1>Billet du matin chagrin</h1><ul>
	<li>Bon finalement, Duba&iuml;&hellip; Peut-&ecirc;tre pas, via <a href="http://www.glazman.org/weblog/">Daniel</a> :</li>
	</ul>


	<blockquote>
		<p>Si, si, Daniel, on t&rsquo;assure, Duba&iuml; c&rsquo;est bien, c&rsquo;est bien plus lib&eacute;ral et moderne que l&rsquo;Arabie Saoudite&hellip; Bon, de temps en temps, <a href="http://tf1.lci.fr/infos/insolite/0,,4125206,00-trois-mois-de-prison-pour-avoir-fait-l-amour-sur-la-plage-.html">ils font une rech&ucirc;te</a>, suffit de pas &ecirc;tre l&agrave; ce jour-l&agrave;.</p>
	</blockquote>


	<ul>
	<li>Notre pr&eacute;sid&eacute;lirant et sa cohorte de suiveurs sans envergure s&rsquo;attaque &agrave; un probl&egrave;me vraiment important, la marseillaise siffl&eacute;e aux matches de football. <a href="http://maitre-eolas.fr/2008/10/16/1111-allons-sifflets-de-la-patri-i-euh">Eolas r&eacute;sume parfaitement la situation</a>.</li>
	</ul>


	<ul>
	<li><a href="http://www.authueil.org/?2008/10/15/1047-mechants-lobbies-gentilles-ong">M&eacute;chants lobbies, gentilles <span class="caps">ONG</span></a> chez <a href="http://www.authueil.org/">Authueil</a></li>
		<li>La loi &ldquo;Cr&eacute;ation et Internet&rdquo;, instaurant notamment en France la riposte gradu&eacute;e, et <a href="/2008/6/8/le-gouvernement-veut-un-filtrage-de-masse-des-r-seaux">dont je parlais en partie ici</a>, a <a href="http://www.lemonde.fr/technologies/article/2008/10/07/telechargement-illegal-bruxelles-oppose-une-fin-de-non-recevoir-a-nicolas-sarkozy_1104193_651865.html">du plomb dans l&rsquo;aile</a> (via <a href="http://www.standblog.org/">Tristan</a>)</li>
		<li>Rachida Dati est pass&eacute;e &agrave; la t&eacute;l&eacute; hier soir. Ah, il est beau le journalisme fran&ccedil;ais, qui s&rsquo;attarde autant sur la grossesse de la ministre du pot de chambre que sur sa vision de la justice, qui la laisse s&rsquo;attarder sur des conneries dont personne n&rsquo;a rien &agrave; foutre quand il faudrait lui faire exposer des actions, des projets, des chiffres. Je crois que &ccedil;a a <a href="http://maitre-eolas.fr/2008/10/16/1112-vu-a-la-tele">fatigu&eacute; Dadouche</a> (sur le blog de Maitre-Eolas) :</li>
	</ul>


	<blockquote>
		<p>Mais quand la Garde des Sceaux d&eacute;crit sa fonction, elle donne la fiche de poste d&rsquo;une <span class="caps">VRP</span> de la compassion, de la championne des victimes, de la terreur des malfaisants, de la reine du terrain : prot&eacute;ger les Fran&ccedil;ais, sanctionner les multir&eacute;cidivistes, rapprocher les Fran&ccedil;ais de leur justice. C&rsquo;est Rachida d&rsquo;Arc, qui a entendu les voix de Nicolas Sarkozy.</p>
	</blockquote>


	<ul>
	<li>Heureusement, il y a de bonnes nouvelles, je continue d&rsquo;apprendre Ruby & Rails, et Firefox 3.1 <a href="http://standblog.org/blog/post/2008/10/15/Sortie-de-Firefox-31-Beta-1">va apporter quelques ptits trucs qui envoient du steak</a>, comme une nouvelle optimisation javascript, et l&rsquo;&eacute;l&eacute;ment &ldquo;video&rdquo;.</li>
	</ul>
