---
title: "Journalisme à la con (2)"
---

<h1>Journalisme à la con (2)</h1><p>Cet article fait suite &agrave; un &eacute;change de mail hier avec deux amis :-) J&rsquo;aurais &eacute;galement p&ucirc; l&rsquo;appeler <b>Sex and the TV</b>, mais j&rsquo;avais commenc&eacute; une s&eacute;rie, donc me voil&agrave; pieds et poings li&eacute;s.</p>


	<p>Partons de ce lien : <a href="http://madame.lefigaro.fr/societe/en-kiosque/1371-sex-in-the-series">Madame Figaro : Sex in the series</a><br />
Et essayons de creuser les motifs de l&rsquo;auteur, le contexte ambiant de critique des media (qui sont responsables de tout, rappelons-le), et tout et tout.</p>
<p>Comme disait Jack, &agrave; la limite, &ccedil;a m&rsquo;en touche une sans faire bouger l&rsquo;autre&hellip; Bon non. J&rsquo;avais envie de la sortir, mais j&rsquo;ai tout de m&ecirc;me quelques remarques. D&eacute;j&agrave; je trouve l&rsquo;article un peu lapidaire en ce qui concerne Californication, dont j&rsquo;ai vu 7 ou 8 &eacute;pisodes, et o&ugrave; le visuel a tr&egrave;s peu de place finalement. Les paroles sont (tr&egrave;s) crues, et c&rsquo;est plus &ccedil;a qui pourrait paraitre choquant, mais que faire ? On s&rsquo;en tient souvent au constat, mais en admettant que ce ne soit pas ce qu&rsquo;on souhaite pour notre civilisation avec un grand F, on fait quoi ?

	<p><strong>Choix n&deg;1</strong> : on devient une copie conforme de l&rsquo;Am&eacute;rique puritaine d&rsquo;il y a 40 ans. On donne plus de moyens au <span class="caps">CSA</span>, et on &eacute;tend la censure ? Bof&hellip; D&eacute;j&agrave; qu&rsquo;ils sont incapables de voir plus loin que le bout de leur nez, &ccedil;a me ferait un peu mal d&rsquo;&eacute;tendre leurs moyens. Sans compter que d&rsquo;ici 10 ou 15 ans on ne se limitera plus au porno, on fera une chasse aux sorci&egrave;res sur des champs d&rsquo;investigation plus int&eacute;ressants :-)</p>


	<p><strong>Choix n&deg;2</strong> : on laisse S&eacute;gol&egrave;ne et son essaim de connards bien pensants partir en croisade contre cette d&eacute;cadence d&rsquo;outre Atlantique, comme elle l&rsquo;avait fait d&eacute;but 90&rsquo;s contre les mangas, retardant leur arriv&eacute;e en France de quelques ann&eacute;es, en traitant au passage de simili-p&eacute;dophiles les amateurs de mangas. Youpi vive la libert&eacute; camarade&hellip; Cela &eacute;tant, j&rsquo;admets volontiers que ce genre de promptitude &agrave; la censure est naturellement plus l&rsquo;apanage des connards de droite. Mais les int&eacute;r&ecirc;ts &eacute;conomiques aidant, ils sont nettement moins virulents j&rsquo;ai l&rsquo;impression (j&rsquo;en reste au stade du ressenti).</p>


	<p><strong>Choix n&deg;3</strong> : je pencherais plut&ocirc;t pour celui-l&agrave; : on se borne &agrave; constater que le porno n&rsquo;est qu&rsquo;un sous-produit in&eacute;vitable de la libert&eacute; d&rsquo;expression et de ses vecteurs dans la soci&eacute;t&eacute; moderne. D&rsquo;ailleurs je dis sous-produit mais je n&rsquo;en suis pas si s&ucirc;r, comme le dit Tita certaines barri&egrave;res peuvent tomber par cette interm&eacute;diaire, et personnellement, il m&rsquo;arrive d&rsquo;appr&eacute;cier regarder des jeunes filles d&eacute;nud&eacute;es ou un porno. La solitude aidant aussi, sur le plan sentimental (pas forc&eacute;ment sexuel ou g&eacute;ographique). Quoiqu&rsquo;il en soi, 4 weddings A funeral me remue plus le ventre, donc on est sauv&eacute;s :) Anyway&hellip;</p>


	<p>Il y a autre chose qui me d&eacute;range dans cet article et ce genre de doxa. J&rsquo;ai l&rsquo;impression que du stade de <strong>facteur d&rsquo;influence</strong> dans le cadre d&rsquo;une <strong>analyse syst&eacute;mique</strong>, on en vient de plus en plus &agrave; rendre le pauvre citoyen <strong>victime de la soci&eacute;t&eacute; et des media</strong>. Je repense au reportage dont me parlait un ami, sur cette jeune fille <span class="caps">BCBG</span> qui aimait &ldquo;se faire embrocher&rdquo; selon ses propres termes. Pauvre petite fille riche d&eacute;traqu&eacute;e par l&rsquo;image du sexe dans la soci&eacute;t&eacute;. Ou pas. Je n&rsquo;ai pas vu ce reportage, mais mon analyse s&rsquo;appliquera certainement &agrave; des cas similaires : l&rsquo;autorit&eacute; est une valeur galvaud&eacute;e, on ne la retrouve plus &agrave; l&rsquo;&eacute;cole, les parents d&eacute;laissent leurs enfants (surtout dans ces milieux), les abandonnent &agrave; eux-m&ecirc;mes, et ceux-ci se construisent dos &agrave; leurs instincts au lieu de limites soci&eacute;tales. L&rsquo;effet de groupe aidant, le manque de volont&eacute; aussi (en plus de l&rsquo;argent qui m&egrave;ne &agrave; la drogue/alcool et au C&ocirc;t&eacute; Obscur), la plus grande libert&eacute; des media &eacute;galement j&rsquo;en conviens, ils s&rsquo;abandonnent joyeusement &agrave; ce rapport au sexe. Mais &ccedil;a vient en grande partie d&rsquo;<strong>eux</strong>. Ca vient en grande partie de leur <strong>noyau familial</strong>. Ca vient en grande partie du fait qu&rsquo;ils n&rsquo;ont pas de but ni r&eacute;f&eacute;rence sociale/spirituelle/morale, ni limites v&eacute;ritables.</p><br />
</p>


	<p>Accuser les media me parait un peu rapide, et pour en revenir au sexe dans les s&eacute;ries, je pense que c&rsquo;est epsilon dans tous les probl&egrave;mes que connait notre soci&eacute;t&eacute;, au 1er rang desquels une jeunesse qui ne sait pas o&ugrave; elle va.</p>


	<p>Sur ce, je pars <a href="http://www.belambra-vvf.fr/belambra/club/Cote_atlantique_Seignosse.aspx?idClub=bfc7c599-172c-4d03-89b9-460f59bb7418">dans les Landes</a>. Au passage, j&rsquo;ai vu sur le site de l&rsquo;h&ocirc;tel qu&rsquo;il y avait un &ldquo;espace wifi (payant)&rdquo;. Quels bande d&rsquo;enfoir&eacute;s r&eacute;trogrades. Je d&eacute;connecte pour quelques jours pour la peine.<br />
A bient&ocirc;t :-)</p>