---
title: "Abre los ojos"
---

<h1>Abre los ojos</h1><p>Encore une nuit de cauchemars. Depuis plus d&rsquo;un an je ne r&ecirc;vais plus, je ne cauchemardais plus, je laissais simplement les &eacute;v&egrave;nements glisser sur moi, je m&rsquo;&eacute;tais r&eacute;solu &agrave; la m&eacute;diocrit&eacute; de ma vie en dehors du travail, et je m&rsquo;&eacute;tais enfonc&eacute; jusqu&rsquo;au cou dans ma vie professionnelle.</p>
<p>Mais depuis deux mois tout &ccedil;a change doucement, je sais que je ne suis pas l&agrave; o&ugrave; je devrais, je n&rsquo;ai aucune influence sur le cours des &eacute;v&egrave;nements, je bosse dans un de ces trop nombreux services de l&rsquo;Etat qui a connu une certaine heure de gloire et qui agonise doucement sans que personne n&rsquo;ose tailler dans le vif. De g&acirc;chis d&rsquo;argent en d&eacute;cisions absurdes je regarde la branche pourrir sans r&eacute;ellement redouter le jour o&ugrave; elle cassera, qui s&rsquo;en soucie ? Je finis par laisser de la latitude &agrave; ma chef ador&eacute;e, je la laisse faire toutes les b&ecirc;tises qu&rsquo;elle veut, je me tais, je code un peu dans mon coin, <em>hallelujah</em>. Je commence &agrave; comprendre la r&eacute;putation qui colle &agrave; la peau des fonctionnaires, &agrave; l&rsquo;observer, &agrave; sentir cette lassitude et &agrave; leur pardonner, quelque part je me d&eacute;go&ucirc;te, je me r&eacute;signe, c&rsquo;est bien qu&rsquo;il faut que je change d&rsquo;air.</p>
<p>Quand la nuit me tombe dessus sans crier gare, je ne r&ecirc;ve toujours pas, je pr&eacute;f&egrave;re &ecirc;tre poursuivi par ma fille qui me vouvoie et veut me planter un couteau dans le ventre. Voir Eric laisser tomber un immense planning de kh&ocirc;lles dans une flaque au milieu du terrain de foot du lyc&eacute;e. Etre enr&ocirc;l&eacute; de force dans une milice s&eacute;n&eacute;galaise et participer horrifi&eacute; &agrave; des combats sanglants. Me torturer avec une comparaison irrationnelle entre mes relations actuelles et la dualit&eacute; l&eacute;gislatif-judiciaire, comme si j&rsquo;avais 41 de fi&egrave;vre. Certains jours je garde juste les yeux ouverts des heures, je sens la fatigue monter, mais elle ne sera assez forte que le lendemain en pleine journ&eacute;e dans mon bureau, bad timing. Parfois je dors d&rsquo;une traite pendant 15h, et je fous en l&rsquo;air toutes mes chances de trouver un rythme les 3 ou 5 jours suivants.</p>
<p>Mais heureusement il y a des nuits magiques, douces, calmes, o&ugrave; ma main est faite prisonni&egrave;re, o&ugrave; je ne peux pas bouger, o&ugrave; mon ventre reste nou&eacute; de bonheur, o&ugrave; je reste l&agrave; p&eacute;trifi&eacute;, o&ugrave; le moindre cauchemar est imm&eacute;diatement terrass&eacute; par un peu de chaleur, un coup d&rsquo;oeil, rien du tout au fond. C&rsquo;est terriblement niais d&rsquo;&eacute;crire ce genre de trucs, mieux vaut en profiter ! H&eacute;las, 3 fois h&eacute;las (merci G&eacute;rard), <em>sans vinaigre le miel n&rsquo;est pas le miel</em>, la solitude revient beaucoup trop fort &agrave; mon go&ucirc;t, le r&ecirc;ve permanent s&rsquo;&eacute;chappe, d&eacute;serte, et il ne tient plus qu&rsquo;&agrave; un fil, &agrave; une fen&ecirc;tre idiote qu&rsquo;on rate parfois, je nous en veux de la rater, &ccedil;a m&rsquo;emp&ecirc;che de respirer. Ces changements de rythmes sont &eacute;prouvants mais ils vont bient&ocirc;t se calmer, heureusement pfiou.</p>
<p>Cela dit bizarrement je me sens fort et serein dans l&rsquo;ensemble. La derni&egrave;re fois que je me suis senti fort et serein je suis parti droit dans le mur, <em>toi-m&ecirc;me tu sais quand c&rsquo;&eacute;tait</em>, mais pire que tout, les quelques pas qui m&rsquo;en s&eacute;paraient (du mur) ont &eacute;t&eacute; sans saveur. Aujourd&rsquo;hui je ne sais toujours pas &eacute;valuer les distances, mais j&rsquo;ai le ventre vri&eacute;, le sourire aux l&egrave;vres, et je prie pour que le mur recule et recule. <em>Tu t&rsquo;es pris un peu trop de baffes toi</em> disait l&rsquo;autre. Je me suis surtout pris des briques dans la t&ecirc;te. Et pourtant je suis pr&egrave;s pour la prochaine, m&ecirc;me pas peur, en esp&eacute;rant qu&rsquo;elle n&rsquo;arrive pas trop vite.</p>
<p>Sur ce, je vais faire la sieste et penser tr&egrave;s fort &agrave; la th&eacute;orie des cordes, &agrave; la relativit&eacute; restreinte, et &agrave; ce que je vais bouffer ce soir. Hasta la vista !</p>
