---
title: "Ma thèse à moi"
---

<h1>Ma thèse à moi</h1><p>Ce qui frappe d&rsquo;embl&eacute;e avec le roman de Mark Twain &ldquo;Les aventures d&rsquo;Huckleberry Finn&rdquo;, ce n&rsquo;est pas l&rsquo;esclavagisme, ce n&rsquo;est pas le Mississipi, c&rsquo;est le r&eacute;cit enchass&eacute;<sup class="footnote"><a href="#fn1">1</a></sup>.</p>
<p>Bien s&ucirc;r, Huck est en proie &agrave; des relations tortur&eacute;es avec <em>son alcoolique de p&egrave;re</em>, mais d&egrave;s qu&rsquo;il r&eacute;ussit &agrave; lui faire croire qu&rsquo;il est mort, il rencontre Jim, un esclave en fuite, qui a subi tous les affres de l&rsquo;esclavagisme. Il le porte sur sa t&ecirc;te en plus, Jim, qu&rsquo;il est esclave, parce qu&rsquo;il est noir, et &agrave; cette &eacute;poque mieux valait ne pas &ecirc;tre noir dans le sud des Etats Unis d&rsquo;Am&eacute;rique, comme le d&eacute;crit tr&egrave;s bien Mark Twain dans &ldquo;Les aventures d&rsquo;Huckleberry Finn&rdquo;.</p>
<p>H&eacute;las, Huck et Jim ont la mauvaise id&eacute;e<sup class="footnote"><a href="#fn2">2</a></sup> de vouloir rejoindre la partie nord du pays, qui est abolitionniste<sup class="footnote"><a href="#fn3">3</a></sup>. Pendant ce long voyage qui dure 217 pages, les deux comp&egrave;res vont se perdre &agrave; cause d&rsquo;une temp&ecirc;te, signe que les dieux (noir blancs ou violets) sont contre eux. Ils finiront par s&rsquo;encanailler avec deux escrocs de la pire esp&egrave;ce qui s&rsquo;empresseront de vendre Jim &agrave; l&rsquo;oncle de &hellip; Tom Sawyer (le monde est petit m&ecirc;me en Am&eacute;rique), le symbole de la Libert&eacute;.</p>
<p>C&rsquo;est l&rsquo;heure des retrouvailles pour Huck et Tom ! Ils vont alors imaginer mille et un stratag&egrave;mes pour rendre &agrave; Jim sa libert&eacute;. Mais, ironie du sort, Jim finira par s&rsquo;enfuir en guise de happy end, ce qui nous ram&egrave;ne &agrave; ses qualit&eacute;s athl&eacute;tiques et donc, quelque part, &agrave; sa couleur de peau cacao. Ne peut-on pas voir l&agrave; un trait d&rsquo;humour de Mark Twain ?</p>
<p>Pour conclure, je n&rsquo;ai pas trouv&eacute; de meilleur passage que le g&eacute;n&eacute;rique du dessin anim&eacute; tir&eacute; du roman de Mark Twain, que je vous livre ici dans sa version dailymotion :</p>
<div>&lt;object height="357" width="420">&lt;param>&lt;/param>&lt;param>&lt;/param>&lt;param>&lt;/param>&lt;embed src="http://www.dailymotion.com/swf/k6deoe9tD06iPzvWl&amp;related=1" height="357" width="420">&lt;/embed><p>&lt;/object><br /><b><a href="http://www.dailymotion.com/video/x2mql_tom-sawyer">Tom Sawyer</a></b><br /><i>envoy&eacute; par <a href="http://www.dailymotion.com/yoyoww">yoyoww</a></i></p>
</div>
<p>&mdash;</p>
<p class="footnote"><sup>1</sup> Librement inspir&eacute; de Desproges.</p>
<p class="footnote"><sup>2</sup> S&ucirc;rement d&ucirc;e &agrave; l&rsquo;alcoolisation foetale de Huck, il est pas fini l&rsquo;gamin</p>
<p class="footnote"><sup>3</sup> En bon fran&ccedil;ais, &ccedil;a veut dire qu&rsquo;ils ne veulent plus traiter les blacks comme des esclaves (vous remarquerez au passage le double sens de &ldquo;traiter&rdquo;, hihihi)</p>