---
title: "Bleh"
---

<h1>Bleh</h1><p>Oui, c&rsquo;est un titre obscur, &eacute;trange, mais cr&eacute;atif, ce qui n&rsquo;est pas sans rappeler, ou plut&ocirc;t appeler la suite de l&rsquo;article. Bien s&ucirc;r sorti tout droit de mon cerveau <del>g&eacute;nial</del> normal (on va encore dire que je suis pr&eacute;tentieux).</p>
<ul>
	<li>Enzo&hellip; Ah Enzo. Esp&egrave;ce de petite enflure. Comme il doit &ecirc;tre difficile d&rsquo;&ecirc;tre vieux, frustr&eacute;, et d&rsquo;avoir le nez si pr&egrave;s de la bouche. Une fois que les <em>services d&rsquo;Hygi&egrave;ne de la mairie de Montrouge</em> seront venus faire un tour, je risque d&rsquo;appeler l&rsquo;hopital psychiatrique. Abruti va.</li>
	<li>Toi aussi &hellip; <em>finalement</em>. Sisi, je t&rsquo;assure.</li>
	<li>Des jambes en coton, des <del>couteaux</del> haches dans les hanches, mais j&rsquo;arrive &agrave; faire semblant que &ccedil;a va, donc c&rsquo;est que &ccedil;a va pas si mal que &ccedil;a. Avec des raisonnements comme &ccedil;a, poussez-vous quoi&hellip; Et toujours pas malade, h&eacute;h&eacute;h&eacute; !</li>
	<li>Personne ne s&rsquo;est d&eacute;j&agrave; coup&eacute; avec du papier ? S&eacute;rieux, putin de tickets de caisse&hellip; Le premier qui se moque gagne mon m&eacute;pris &eacute;ternel.</li>
	<li>J&rsquo;ai presque fini la <a href="http://fr.wikipedia.org/wiki/%C3%80_la_Maison_Blanche">saison 6</a>, et il m&rsquo;est interdit de commencer la 7. La vraie torture, c&rsquo;est que ce sont les 5 premi&egrave;res minutes de la 7 qui m&rsquo;int&eacute;ressent&hellip; Monde de merde.</li>
	<li>Je suis devenu un as pour arriver 1 minute avant le d&eacute;lai l&eacute;gal &agrave; mon taff. Seulement, &agrave; travailler 4h30 par jour, je risque de bient&ocirc;t me faire remonter les bretelles. Pour &eacute;viter ce d&eacute;sagr&eacute;ment, je me suis offert une nouvelle <span class="caps">RTT</span> demain. Et j&rsquo;envisage une op&eacute;ration majeure sur les firewalls de mon infrastructure samedi &agrave; 10h, en distant, sans assistance, ni filet. Ma chef n&rsquo;est pas au courant, bien s&ucirc;r. J&rsquo;en ai les fesses qui font bravo par avance.</li>
	<li>Plus s&eacute;rieusement, j&rsquo;ai un programme de fou la semaine prochaine. D&eacute;finitivement, C. n&rsquo;est pas ma seule ennemie, tout le monde veut me fourrer dans tout un tas de projets &agrave; la con. Mais telle la dinde (subtil&hellip;), j&rsquo;esquive, virevolte, et m&rsquo;&eacute;clipse par la fen&ecirc;tre.</li>
	<li>La plus belle et la plus touchante des premi&egrave;res fois je crois&hellip; Et pour l&rsquo;autre truc, il faut absolument que &ccedil;a devienne une habitude, oui.</li>
	<li>La <a href="http://fr.wikipedia.org/wiki/Truffade">truffade</a> c&rsquo;est bon, mangez-en. Le serveur avait pr&eacute;venu, <em>tout en l&eacute;g&egrave;ret&eacute;</em>, mais &ccedil;a calle bien jusqu&rsquo;au lendemain soir, ou presque. Merci, merci, merci et merci encore.</li>
	<li>Du soleil, pas de mer, dans les limites du <del>raisonnable</del> territoire. Ouais <a href="http://www.lachainemeteo.com/">bah</a>&hellip; Strasbourg ou Epinal. Ou pas, as usual&hellip;</li>
	<li>45cm de subway, j&rsquo;avais jamais vraiment fait je crois. Bah &ccedil;a c&rsquo;est fait&hellip; Vite une bassine, je vais vomir :-(</li>
	<li>Mes chats deviennent des gros lards. C&rsquo;est Enzo qui va &ecirc;tre content. D&rsquo;autant que je risque de lui demander de les nourrir bient&ocirc;t hihihi.</li>
	<li>Il y a ce qu&rsquo;on dit, ce qu&rsquo;on ne devrait pas dire mais qui &eacute;chappe, ce qu&rsquo;on n&rsquo;a pas envie de dire mais qui br&ucirc;le les l&egrave;vres, ce qu&rsquo;on a envie de dire pour lequel ce n&rsquo;est pas le moment, pour lequel l&rsquo;autre n&rsquo;est pas pr&ecirc;t, ce qu&rsquo;on dit en trop quand ce n&rsquo;est pas n&eacute;cessaire, ce qu&rsquo;on n&rsquo;ose pas dire aux pipelettes qui nous emmerdent, etc, etc. Quel bordel ces humano&iuml;des. Vivement qu&rsquo;on acquiert tous un niveau de conscience sup&eacute;rieur qui nous permette de communiquer par la pens&eacute;e de mani&egrave;re efficace.</li>
</ul>
<p>Si je trouve d&rsquo;autres choses <del>intelligentes</del> &agrave; dire, croyez-bien que je vous en aviserai.</p>
<p><acronym title="21h26"><span class="caps">EDIT</span></acronym> : Ah oui, il y a aussi ce qu&rsquo;on a dit et qu&rsquo;on regrette, ce qu&rsquo;on a dit, qui change, et qu&rsquo;on n&rsquo;ose pas remettre &agrave; jour, il y a ce qu&rsquo;on dit trop, ou pas assez, ce qui malgr&eacute; l&rsquo;absurdit&eacute; tambourine dans ta t&ecirc;te, qui ne deviendra irr&eacute;el qu&rsquo;apr&egrave;s &ecirc;tre sorti et avoir tendu l&rsquo;atmosph&egrave;re, il y a ce qu&rsquo;on dit et on ne sait pas pourquoi, il y a ce qui ne se dit pas, ce qui ne peut pas se dire, ce qu&rsquo;on ne dit pas par fatigue, par aggacement, par fiert&eacute;, et bla et bla et bla. ET <span class="caps">BLA</span> <span class="caps">BLA</span> <span class="caps">BLA</span>. Parler avec les yeux, c&rsquo;est parfois bien suffisant, non ? Surtout depuis ce soir je crois :-) OH IL <span class="caps">FAIT</span> <span class="caps">JOUR</span> <strong>\o/</strong></p>
