---
title: "En vrac"
---

<h1>En vrac</h1><p><em>Personal part</em></p>
<p>La <a href="http://fr.wikipedia.org/wiki/Sociologie_des_organisations">socio des orgas</a>, <em>qui a essay&eacute; en &eacute;cole d&rsquo;ing&eacute; ou autre pourra me comprendre</em>, c&rsquo;est chiant. C&rsquo;est surtout chiant parce que c&rsquo;est trop simple ou trop tarabiscott&eacute;. Dans une situation moyenne<sup class="footnote"><a href="#fn1">1</a></sup>, comme celle que je vis quotidiennement au boulot, le jeu des acteurs est assez simple &agrave; cerner pour peu qu&rsquo;on soit observateur. On &eacute;value les ressources, objectifs, int&eacute;r&ecirc;ts, leviers, moyens de chacun, on qualifie (dans sa t&ecirc;te, faut pas d&eacute;conner) les interactions entre les acteurs, et on obtient mentalement une grille de lecture simpliste de la situation. Merci l&rsquo;analyse syst&eacute;mique, vive l&rsquo;induction. Moyennant un peu de lucidit&eacute; sur son propre positionnement dans la machinerie, sur sa propre influence sur le syst&egrave;me, et modulo un QI sup&eacute;rieur &agrave; 80, cette grille va suffire dans la majorit&eacute; des cas. Bref, &ccedil;a sert vraiment &agrave; rien&copy; tout &ccedil;a&hellip;</p>
<p>C&rsquo;est dans les relations personnelles que tout para&icirc;t plus compliqu&eacute;. Et pourtant, l&rsquo;empirisme est ton ami<sup class="footnote"><a href="#fn2">2</a></sup>. Je commence &agrave; avoir une vision globale claire de la situation dans laquelle je me trouve. Ca me rend confiant de comprendre, de toucher du doigt ce qui se joue dans la t&ecirc;te de certains et dans la mienne. Certaines r&eacute;actions obscures<sup class="footnote"><a href="#fn3">3</a></sup> me rassurent aussi. Le temps des annonces, de l&rsquo;accoutumance me semble pass&eacute;. J&rsquo;ai le temps. Petit &agrave; petit je gomme certaines r&eacute;actions de merde. Je sais, &ccedil;a se voit pas, mais si. La situation n&rsquo;aide pas, ma manie de r&eacute;fl&eacute;chir non plus, mais &ccedil;a ira. Je vois des portes de sortie, certaines moins marrantes que d&rsquo;autres. Prochaine &eacute;tape, essayer de trouver des poches d&rsquo;air pour te faire respirer toi qui me fait respirer (dis comme &ccedil;a c&rsquo;est moi l&rsquo;_&eacute;go&iuml;ste_, ahah). Great, everything&rsquo;s OK. I&rsquo;m so, deeply, happy because of you. Go ahead !</p>
<p>T&rsquo;es partie. J&rsquo;me sens un peu seul parfois, du coup j&rsquo;&eacute;cris ici <em>(youpi)</em>. T&rsquo;as rat&eacute; des trucs de fou-fu-rieux dans la saison 3 de Battlestar. Et tu rates aussi la saison 6 de l&rsquo;autre c&ocirc;t&eacute;, je l&rsquo;ai recommenc&eacute;e tout seul&hellip; Oh, <span class="caps">BICHETTE</span> ! Josh est toujours mon h&eacute;ros. Toby me fascine. J&rsquo;aurais tellement de trucs &agrave; te raconter de vive voix&hellip; Un Schokobon ? Essaie de revenir un d&rsquo;ces 4, ce serait cool. Tu penseras &agrave; m&rsquo;ramener ma perceuse ;-)</p>
<hr />
<p><em>Tech part</em></p>
<p><strong>Ubiquity</strong>, dont je parlais r&eacute;cemment, est vraiment un truc super sympa. Difficile de s&rsquo;y habituer cependant, mais c&rsquo;est d&rsquo;une efficacit&eacute; &agrave; toute &eacute;preuve, je commence &agrave; prendre l&rsquo;habitude de faire mes recherches Wikipedia comme &ccedil;a, que du bonheur.</p>
<p>Je commence &agrave; vraiment avoir envie de me d&eacute;velopper ma propre appli de blogging. Simpliste, bien s&ucirc;r. Je vais peut-&ecirc;tre faire &ccedil;a cet apr&egrave;sm vu que j&rsquo;ai mal au dos et un d&eacute;but d&rsquo;angine&hellip;</p>
<p>Je n&rsquo;arrive pas &agrave; faire marcher <strong>mod_rails</strong> sur <strong>Etch</strong>. J&rsquo;obtiens un listing comparable au Indexes d&rsquo;Apache du r&eacute;pertoire courant, et bien que l&rsquo;install soit hyper bien foutue, rien sur le site ne m&rsquo;aide vraiment. Ah si, ils mentionnent une incompatibilit&eacute; avec certains modules, par exemple mod_rewrite. Rien que &ccedil;a ?? Fuck&hellip;</p>
<hr />
<p class="footnote"><sup>1</sup> J&rsquo;exclus donc le campus Google en Californie, o&ugrave; les gens d&eacute;bordent de bonheur (il para&icirc;t), et certains <span class="caps">CEI</span> de province, o&ugrave; les gens sont pour moiti&eacute; suicidaires ou en d&eacute;pression grave&hellip;</p>
<p class="footnote"><sup>2</sup> Comme tes dents.</p>
<p class="footnote"><sup>3</sup> Au sens de Dark Vador (je sais, normalement on cite un vrai philosophe).</p>