---
title: "Maidley"
---

<h1>Maidley</h1><p>Walking in the street, listenning to <em>Brothers in Arms</em>&hellip;</p>
<p>Tout autour tourne au ralenti, les visages prennent des poses irr&eacute;elles sous les derniers rayons de soleil, je profite des sc&egrave;nes qui d&rsquo;ordinaire m&rsquo;agressent et m&rsquo;aigrissent. La station de m&eacute;tro ne fait qu&rsquo;une bouch&eacute;e de moi, et aussit&ocirc;t un nouveau morceau se joue. <em>Paris me sert une rengaine, rageuse froide souterraine, Paris m&rsquo;ignore</em>.. Sonn&eacute;, happ&eacute;, &eacute;trangl&eacute;, j&rsquo;engage une nouvelle piste, je change de ligne, <em>and I&rsquo;m losing my favourite game</em>.. Next.</p>
<p>Les passagers de la 10 tranchent avec ceux de la 13, la plupart se balladent en arborant fi&egrave;rement leur mine sereine, et les Who r&eacute;sonnent, <em>I don&rsquo;t need to fight, to prove I&rsquo;m right</em>. J&rsquo;imagine surtout qu&rsquo;ils payent pas leurs fringues ! Pas un p&eacute;core en vue, je dois &ecirc;tre le leur, qui sait ? <em>Viens faire un tour dans ce que l&rsquo;on appelle le ghetto..</em> Non ! Stop ! Qu&rsquo;est ce que j&rsquo;y connais apr&egrave;s tout ? Suivant.</p>
<p><em>Jamais ma coccinelle je n&rsquo;t&rsquo;abandonnerai, ma f&eacute;&eacute; toute caboss&eacute;e au t&eacute;l&eacute;cran du ciel..</em>  Je reste pensif quelques secondes, je rejoue le m&ecirc;me passage. Les gens sortent avec la r&eacute;gularit&eacute; d&rsquo;un m&eacute;tronome, et enfin c&rsquo;est mon tour ! J&rsquo;&eacute;merge entre chiens et loups. <em>Here&rsquo;s my comeback on the road again !</em> M&ecirc;me la nuit, les gens ont l&rsquo;air plus riches de ce c&ocirc;t&eacute; du tunnel.</p>
<p>J&rsquo;arr&ecirc;te d&rsquo;&eacute;crire sur mon t&eacute;l&eacute;phone, et j&rsquo;arr&ecirc;te mon iPod<sup class="footnote"><a href="#fn1">1</a></sup>. Une bonne soir&eacute;e suivra, je sens qu&rsquo;il rajeunit de nouveau, &ccedil;a fait plaisir &agrave; voir.</p>
<p>Et ce vide, l&rsquo;impression d&rsquo;&ecirc;tre un puit sans fond, cette chaleur au ventre, entre un bonheur qui veut transpirer et un manque terrible. Pouah.</p>
<p>&mdash;</p>
<p class="footnote"><sup>1</sup> <a href="http://www.youtube.com/watch?v=8M9U1OU0MzU">Dire Straits, Brothers in Arms</a> ; <a href="http://www.youtube.com/watch?v=G2kPrCqQXpk">Subway, Paris</a> ; <a href="http://www.youtube.com/watch?v=styYbRWQYP8">The Cardigans, My Favourite Game</a> ; <a href="http://www.youtube.com/watch?v=HcyuJTgKjZc">The Who, Baba O&rsquo; Riley</a> ; <a href="http://www.youtube.com/watch?v=nnBGdmKw_Gc">MC Solaar, D&eacute;g&acirc;ts collat&eacute;raux</a> ; <a href="http://www.youtube.com/watch?v=Kiy9seAzMEY">Dyonisos, Coccinelle</a> ; <a href="http://www.youtube.com/watch?v=CFojdQ8d7DY">Guano Apes, Big in Japan</a></p>