---
title: "En vrac"
---

<h1>En vrac</h1><ul>
	<li><em>Ah Tentation&hellip; J&rsquo;ai prononc&eacute; ton nom, et tu t&rsquo;appelles Femme.</em> (Tentation, via <a href="http://en.wikipedia.org/wiki/Sam_Seaborn">Sam Seaborn</a>) : quelle connerie.</li>
	<li><em>J&rsquo;ai ouvert les yeux et j&rsquo;ai vu un cheval blanc; il avait la mort comme cavalier et derri&egrave;re lui on apercevait l&rsquo;enfer&hellip;</em> (R&eacute;v&eacute;lation, via <a href="http://en.wikipedia.org/wiki/Lord_John_Marbury">Lord John Marbury</a>) : Brrr&hellip;</li>
	<li>Bonne soir&eacute;e samedi, resto excellent, petite ballade, gros cocktail, une fin un peu moins marrante mais je tiens ma r&eacute;action pour la prochaine fois (ou pas)</li>
	<li>Ai &eacute;t&eacute; poursuivi par un requin noir et blanc toute la nuit de samedi &agrave; dimanche, marre.</li>
	<li>Ai revu tante Berthe, ai (encore) d&eacute;couvert des choses r&eacute;jouissantes sur ma famille. Vivement qu&rsquo;ils se noient tous dans leur vomi ces cons-l&agrave;&hellip;</li>
	<li>Ai (enfin) compris hier soir pourquoi la distance faisait ressortir les pires peurs en moi. Ahahaha. Fuck.</li>
	<li>Mal dormi la nuit derni&egrave;re aussi, le manque, un coup de fil rat&eacute;, les angoisses irrationnelles sus-cit&eacute;es&hellip;</li>
	<li>Fr&ocirc;le par moments un niveau de bonheur in&eacute;gal&eacute; malgr&eacute; un taff assez chiant et cette foutue distance. If you only knew <del>the Power of the Dark Side</del>&hellip;. Merci :-)</li>
	<li><em>Je ferme les yeux, et je crois que je r&ecirc;ve&hellip; Et c&rsquo;est pourtant sur toi, que je les rel&egrave;ve&hellip;</em> (la suite est &agrave; r&eacute;inventer, hejsan Vialatte si tu passes par l&agrave;)</li>
	<li>Ai piqu&eacute; 20 pages imprim&eacute;es dans les affaires de ma soeur, je vais pouvoir les revendre au march&eacute; noir h&eacute;h&eacute;</li>
	<li>Apr&egrave;s moi, l&rsquo;apocalypse.</li>
	<li>J-7 :-)</li>
	<li>J-8 :-(</li>
	<li>Rideau.</li>
</ul>
