---
title: "Ubuntu Intrepid Ibex"
---

<h1>Ubuntu Intrepid Ibex</h1><p>J&rsquo;ai pass&eacute; mon PC principal ce week-end sous <a href="http://www.ubuntu.com/">Ubuntu 8.10</a>, nom de code &ldquo;Intrepid ibex&rdquo; (bouquetin intr&eacute;pide). Apr&egrave;s une tr&egrave;s d&eacute;sagr&eacute;able exp&eacute;rience au premier boot, o&ugrave; le bip machine sonnait sans discontinuer, j&rsquo;ai updat&eacute; et plus aucun probl&egrave;me au boot suivant. Pour les possesseurs de cartes nvidia je conseille aussi d&rsquo;installer les paquets non libres si vous voulez que l&rsquo;&eacute;cran cesse de trembler !</p>


	<p>Bon, j&rsquo;ai surtout <del>mis</del> activ&eacute; et configur&eacute; un peu <a href="http://doc.ubuntu-fr.org/compiz_fusion#captures_d_ecran">Compiz</a> et il faut avouer que&hellip; &ccedil;a rox. Compiz permet d&rsquo;avoir des effets graphiques du tonnerre sur son Linux, un peu &agrave; la mani&egrave;re d&rsquo;Aero sous Vista, mais en bien mieux &eacute;videmment. C&rsquo;est tr&egrave;s sympa m&ecirc;me si on peut s&rsquo;en lasser assez vite je pense. D&eacute;mo sur demande quand vous serez de passage chez moi ;-)</p>


	<p>J&rsquo;ai aussi install&eacute; <a href="http://getsongbird.com/">Songbird 0.7</a> (fantastique), <a href="http://www.kvirc.net/">Kvirc 3.4.0</a> (qui remplace fi&egrave;rement mon mIRC), <a href="http://www.netbeans.org/">Netbeans 6.5</a> (toujours aussi sympa), <a href="http://scribes.sourceforge.net/">Scribes</a> (pour tester, il manque une vue &ldquo;dossiers&rdquo; &agrave; mon sens), et toutes mes extensions Firefox, dont je reparlerai un autre jour, ou pas. Ah, j&rsquo;ai aussi cod&eacute; un tout petit peu sur un plugin <a href="http://www.redmine.org/">Redmine</a>, une killer app sous Rails, et regard&eacute; un peu ce que donnent le trunk de <a href="http://www.typosphere.org/">Typo</a> (un gestionnaire de blog en rails) et <a href="http://jimneath.org/2008/09/09/bort-base-rails-application/">Bort</a> (une coquille vide pour d&eacute;marrer un projet Rails).</p>


Et au milieu de tout &ccedil;a, j&rsquo;ai cuisin&eacute;, ri, dormi, vibr&eacute; &agrave; l&rsquo;heure de ma bien aim&eacute;e, h&eacute;h&eacute; ! Week-end rempli ;-)