---
title: "N Sarkozy diminuerait les subventions des facs littéraires ?"
---

<h1>N Sarkozy diminuerait les subventions des facs littéraires ?</h1><p>Alors que j&rsquo;&eacute;tais ce soir en compagnie de ma soeur et de Flo (son ami ou mon meilleur ami, je ne saurai jamais par quel sens le prendre), elle me raconte qu&rsquo;un de ses profs l&rsquo;a inform&eacute; d&rsquo;une r&eacute;flexion de Nicolas Sarkozy, et que d&eacute;finitivement, elle ne voterait pas pour lui. Grosso modo, l&rsquo;id&eacute;e &eacute;tant que les fili&egrave;res sup&eacute;rieures non-scientifiques sont improductives et remplissent trop d&rsquo;&eacute;tudiants pour peu de d&eacute;bouch&eacute;s, il voudrait diminuer leurs subventions.</p>
<p>Alors que j&rsquo;&eacute;tais ce soir en compagnie de ma soeur et de Flo (son ami ou mon meilleur ami, je ne saurai jamais par quel sens le prendre), elle me raconte qu&rsquo;un de ses profs l&rsquo;a inform&eacute; d&rsquo;une r&eacute;flexion de Nicolas Sarkozy, et que d&eacute;finitivement, elle ne voterait pas pour lui. Grosso modo, l&rsquo;id&eacute;e &eacute;tant que les fili&egrave;res sup&eacute;rieures non-scientifiques sont improductives et remplissent trop d&rsquo;&eacute;tudiants pour peu de d&eacute;bouch&eacute;s, il voudrait diminuer leurs subventions.</p>


	<p>L&rsquo;objectif de ce post n&rsquo;est pas de d&eacute;battre vraiment de cette proposition, mais je m&rsquo;interroge fortement sur ce qui est relay&eacute; par les media, syndicats, blogs, institutions, ou autres corps, quant aux propositions de N. Sarkozy et &agrave; leur diabolisation (de m&ecirc;me que ceux de S. Royal ont souvent &eacute;t&eacute; accentu&eacute;s et d&eacute;form&eacute;s pour la faire passer pour une cruche).</p>


	<p><h2>R&eacute;flexions diverses lors de la discussion :</h2></p>

	<p><ul><li>Le monde &eacute;ducatif et le monde professionnel sont en inad&eacute;quation, il y a bien un d&eacute;calage quelque part</li><li>Avec une telle mesure, on &ldquo;tue&rdquo; la culture : l&rsquo;appareil productif est insuffisant pour un pays, il faut bien des gens qui r&eacute;fl&eacute;chissent, des artistes, etc&hellip;</li><li>Les fili&egrave;res litt&eacute;raires offrent une vari&eacute;t&eacute; de d&eacute;bouch&eacute;s plus importante qu&rsquo;on veut bien le croire, ou qu&rsquo;institutionnellement on nous laisse entendre<br />
</li><li>Ce ne serait que rationaliser les formations dispens&eacute;es par l&rsquo;&eacute;ducation nationale que de faire correspondre les besoins du monde professionnel aux offres de formation</li><li>La campagne pr&eacute;sidentielle actuelle d&eacute;vie : le Pr&eacute;sident de la R&eacute;publique n&rsquo;est pas chef de l&rsquo;ex&eacute;cutif, la politique &eacute;trang&egrave;re est de son ressort, les orientations de politique int&eacute;rieure &eacute;galement, pas les mesures concr&egrave;tes ou la mise en oeuvre des r&eacute;formes.<br />
</li><li>O&ugrave; s&rsquo;arr&ecirc;te l&rsquo;information et o&ugrave; commence la propagande ? Est-ce l&eacute;gitime que de v&eacute;hiculer ce genre d&rsquo;information en fac ? Question ouverte, r&eacute;ponse sans int&eacute;r&ecirc;t :D</li></ul></p>

	<p><h2>Opinion personnelle</h2></p>

	<p>Anyway, chacun aura son opinion sur ces r&eacute;flexions. Personnellement, je crois que le syst&egrave;me &eacute;ducatif est tr&egrave;s mal adapt&eacute; au monde professionnel actuel.<br />
Passons les fadeurs concernant les crit&egrave;res de s&eacute;lection ou les modes d&rsquo;apprentissage qui emp&ecirc;chent un infime pourcentage de g&eacute;nies de d&eacute;velopper leur potentiel. Passons &eacute;galement les discours hypocrites qui visent &agrave; culpabiliser l&rsquo;&eacute;l&egrave;ve (ou r&eacute;volter le contribuable) &agrave; propos des co&ucirc;ts exorbitants que repr&eacute;sente chaque ann&eacute;e de formation dans telle ou telle fili&egrave;re <sup><a href="#ref1">[1]</a></sup>.<br />
Je tends plut&ocirc;t &agrave; penser que le syst&egrave;me est inadapt&eacute; puisqu&rsquo;il est incapable de se r&eacute;guler pour fournir les comp&eacute;tences qu&rsquo;il faut (en proportion, nombre, et qualit&eacute;) au march&eacute; du travail. Du coup, certaines fili&egrave;res glissent hors de leur vocation premi&egrave;re. Dans mon &eacute;cole d&rsquo;ing&eacute;nieurs, on ne forme pas d&rsquo;ing&eacute;nieur. On produit des fain&eacute;ants professionnels, quelques artistes, quelques pseudo-politologues/sociologues/trucologues, quelques &eacute;conomistes des transports, et une majorit&eacute; de managers. Les m&eacute;tiers changent, mais pas la r&eacute;alit&eacute; et le bon sens, un blanc-bec de 23 ans est incapable de g&eacute;rer correctement des ressources humaines, surtout s&rsquo;il est incomp&eacute;tent sur le coeur de m&eacute;tier qu&rsquo;il touche. Bref, &ccedil;a n&rsquo;est pas le sujet de ce billet.</p>


	<p><h2>Pourquoi tant de haine ?</h2></p>

	<p>J&rsquo;en viens &agrave; ce pour quoi je voulais &eacute;crire ce billet. J&rsquo;ai eu beau chercher un bon moment (de l&rsquo;ordre de 3h bout &agrave; bout), j&rsquo;ai &eacute;t&eacute; incapable de trouver la moindre trace d&rsquo;une telle d&eacute;claration. Et pourtant, Google et Exalead <sup><a href="#ref2">[2]</a></sup> sont mes meilleurs amis ;-)</p>


	<p>Il y a bien un <a href="http://media.education.gouv.fr/file/63/8/3638.pdf">rapport de l&rsquo;Education Nationale</a> sur le d&eacute;clin des sections litt&eacute;raires au lyc&eacute;e. Un autre, dont j&rsquo;ai perdu la trace au fil des mes navigations, mentionnait des possibilit&eacute;s de r&eacute;duction du budget des universit&eacute;s, propos&eacute;es par N. Sarkozy alors Ministre des Finances, en 2004. Ca n&rsquo;a servi qu&rsquo;&agrave; exposer le gouvernement Raffarin 2, mais pas de trace concr&egrave;te de changements ensuite.</p>


	<p>La <a href="http://www.u-m-p.org/site/index.php/ump/s_informer/discours/convention_de_l_ump_sur_l_education_mercredi_22_fevrier_2006__2">convention de l&rsquo;UMP sur l&rsquo;&eacute;ducation</a> (discours de N. Sarkozy du 22/02/06) ne fait pas mention de cela non plus. Il mentionne en revanche un d&eacute;cloisonnement de certaines fili&egrave;res et une suppression des &ldquo;fili&egrave;res professionnelles sans d&eacute;bouch&eacute;s&rdquo; (sic) : certains <span class="caps">CAP</span>/BEP/Bac Pro, donc. Dans cette lign&eacute;e, les sections <a href="http://www.u-m-p.org/propositions/index.php?cat=Education">Education</a> et <a href="http://www.u-m-p.org/propositions/index.php?cat=Enseignement%20sup%C3%A9rieur">Enseignement Sup&eacute;rieur</a> du site consacr&eacute; au programme du candidat <span class="caps">UMP</span> ne fournissent pas vraiment plus d&rsquo;&eacute;l&eacute;ments sur les budgets sp&eacute;cifiques des fili&egrave;res de fac. Une r&eacute;flexion sur l&rsquo;Enseignement Sup&eacute;rieur laisse pr&eacute;sager un syst&egrave;me de quotas suivant les fili&egrave;res :</p>


	<p><em>&ldquo;Notre pays a besoin de conduire plus de jeunes vers les &eacute;tudes sup&eacute;rieures, mais des &eacute;tudes dans lesquelles ils ont une chance de r&eacute;ussir et qui conduisent &agrave; l&rsquo;emploi. Chaque bachelier aura une place &agrave; l&rsquo;universit&eacute;, mais le nombre d&rsquo;&eacute;tudiants dans les diff&eacute;rentes fili&egrave;res d&eacute;pendra des r&eacute;alit&eacute;s du march&eacute; du travail.&rdquo;</em></p>


	<p>Il n&rsquo;est pas question de r&eacute;duction des subventions, mais de rationaliser les effectifs des facs. Dans quelle mesure ? Tout cela reste tr&egrave;s flou. C&rsquo;est ce qui se fait cela dit dans certaines &eacute;coles d&rsquo;ing&eacute;nieurs, o&ugrave; le concours peut aller jusqu&rsquo;&agrave; fermer certaines ann&eacute;es si le march&eacute; est satur&eacute;. Cette phrase ne me convainc qu&rsquo;&agrave; moiti&eacute; de toute fa&ccedil;on, puisque d&rsquo;autres propositions visent &agrave; rendre les facs r&eacute;ellement autonomes. Si l&rsquo;on suit ces deux id&eacute;es, ces derni&egrave;res auraient donc des comptes &agrave; rendre sur les choix qu&rsquo;elles font en mati&egrave;re d&rsquo;effectifs selon les fili&egrave;res. Je trouve &ccedil;a tout ce qu&rsquo;il y a de plus normal dans le principe, tout organisme d&rsquo;Etat doit faire la preuve de la bonne utilisation qu&rsquo;il fait de l&rsquo;argent public : c&rsquo;est un des 3 ou 4 principes essentiels r&eacute;gissant les missions de service public (et j&rsquo;ai l&rsquo;impression que l&rsquo;Europe accentue encore cette exigence (cf le Code des March&eacute;s Publics)). Mais rien qui touche &agrave; des baisses de subvention de certaines fili&egrave;res, encore une fois&hellip;</p>


	<p>En outre, le blog de Francois Fillon (conseiller de N. Sarkozy) <a href="http://www.blog-fillon.com/article-5664409-6.html">mentionne clairement</a> en mati&egrave;re d&rsquo;&eacute;ducation une revalorisation des moyens des &eacute;tablissements d&rsquo;enseignement secondaire + biblioth&egrave;ques afin de susciter de nouvelles vocations dans les mati&egrave;res litt&eacute;raires. Mais ce genre de tarte &agrave; la cr&egrave;me &eacute;lectorale n&rsquo;est pas propre &agrave; l&rsquo;UMP : <a href="http://cap2007oise.over-blog.com/article-6107996.html">selon un professeur d&rsquo;&eacute;conomie au <span class="caps">MIT</span></a>, les programmes PS comme <span class="caps">UMP</span> envisagent des revalorisations de budget des universit&eacute;s, qui deviendraient plus ind&eacute;pendantes et plus sp&eacute;cialis&eacute;es dans le cas de l&rsquo;UMP. Le PS se contente d&rsquo;employer une formule creuse &agrave; ce sujet.</p>


	<p><h2>So what ?</h2></p>

	<p>De deux choses l&rsquo;une..</p>


	<p>Ou bien cette information rel&egrave;ve de l&rsquo;intox totale. Comme le disait Desproges en son temps, il est de bon ton, voire n&eacute;cessaire chez les artistes d&rsquo;&ecirc;tre dans l&rsquo;opposition. Il en va de m&ecirc;me actuellement, dans les milieux djeunz, c&rsquo;est tr&egrave;s &agrave; la mode d&rsquo;&ecirc;tre anti-sarkozy. Que dire.. Youpi :)</p>


	<p>Ou bien cette information est vraie et v&eacute;rifiable. Auquel cas, cela me para&icirc;t bien plus grave, puisque je ne parviens pas &agrave; y acc&eacute;der. Soit c&rsquo;est une proposition mineure (de toute fa&ccedil;on il n&rsquo;y a pas la moiti&eacute; des propositions majeures qui seront mises en oeuvre), soit c&rsquo;est une d&eacute;cision majeure non relay&eacute;e par les media, et l&agrave;, on se pose(rait) un paquet de questions. D&rsquo;autant que &ccedil;a ne serait m&ecirc;me pas relay&eacute; par l&rsquo;UMP elle m&ecirc;me ? Hm ?</p>


	<p><h2>Une note positive ?</h2></p>

	<p>Le fonctionnement des universit&eacute;s se rapproche en fait beaucoup de celui des collectivit&eacute;s territoriales.<br />
D&rsquo;apr&egrave;s <a href="http://www.univ-lr.fr/formations/ecoledoctorale/Documents/CIES/Expose2004ParaireMoniteurs.pdf">ce document</a>, qui synth&eacute;tise le statut des &eacute;tablissements d&rsquo;enseignement sup&eacute;rieur, les universit&eacute;s disposent d&rsquo;une autonomie financi&egrave;re. Autonomie qui suppose un contr&ocirc;le a posteriori des d&eacute;cisions par ses m&eacute;c&egrave;nes, soit (ainsi certainement qu&rsquo;un contr&ocirc;le de l&eacute;galit&eacute; des d&eacute;cisions par une administration tierce, minist&egrave;re de l&rsquo;EN ou pr&eacute;fecture vraissemblablement).</p>


	<p>Anyway :<br />
<ul><li>L&rsquo;Etat n&rsquo;est pas seul m&eacute;c&egrave;ne des facs : la <span class="caps">DGF</span> est un outil bien commode pour &eacute;quilibrer des comptes et faire joli dans les bilans de CT et des organismes publics et ainsi reporter la dette publique au niveau central.</li><li>Le Pr&eacute;sident de la R&eacute;publique n&rsquo;a aucun pouvoir direct sur la r&eacute;partition de ces dotations (d&eacute;cid&eacute;es selon toute vraisemblance lors du vote du budget par le parlement) <br />
</li><li>L&rsquo;&eacute;chelon national ne d&eacute;cide <i>a priori</i> pas des r&eacute;partitions des budgets de fonctionnement entre fili&egrave;res en interne<br />
</li></ul></p>


<hr />


	<p><a>[1]</a> A ce propos, le principal adjoint de mon lyc&eacute;e en pr&eacute;pa nous a un jour sermonn&eacute; alors que nous refusions de nous plier aux 4 volont&eacute;s de notre professeur de fran&ccedil;ais. Notre attitude &eacute;tait inadmissible, nous qui co&ucirc;tions si cher au contribuable et qui avions tellement de chance. Je lui recommande la lecture d&rsquo;une <a href="http://perso.wanadoo.fr/jean-pierre.barani/figlight.pdf">lettre ouverte de Jean-Pierre <span class="caps">BARANI</span></a>, professeur de Maths en PC* au Lyc&eacute;e du Parc &agrave; Lyon, en r&eacute;ponse &agrave; un article du Monde sur l&rsquo;enfer des pr&eacute;pas, et qui tord le cou &agrave; certains lieux communs dans un style plut&ocirc;t &ldquo;relev&eacute;&rdquo; :-)</p>


	<p><a>[2]</a> <a href="http://www.exalead.fr/">Exalead.fr</a> est un moteur de recherche fran&ccedil;ais qui sort des labos de l&rsquo;Ecole des Mines.</p>
