---
title: "Envie de croisade"
---

<h1>Envie de croisade</h1><p>Et de croisi&egrave;re aussi, mais ce sera pour plus tard, elle &agrave; qu&rsquo;&agrave; revenir.</p>


	<p>Je suis en train de regarder un reportage hallucinant<sup><a href="#fn1">1</a></sup> sur <span class="caps">LCP</span>/PS : <a href="http://www.allocine.fr/film/fichefilm_gen_cfilm=109748.html">Tabac, la conspiration</a>.</p>


On tient plusieurs scoops, tenez-vous bien, que je vous livre ici dans le d&eacute;sordre :
	<ul>
	<li>les manufacturiers du tabac ont de bons services marketting,</li>
		<li>le tabac est extr&ecirc;mement meurtrier,</li>
		<li>les manufacturiers veulent se faire du pognon,</li>
		<li>ils font des recherches qui n&rsquo;aboutissent &agrave; rien puisque r&eacute;duire les dangers li&eacute;s au tabagisme r&eacute;duirait l&rsquo;accoutumance et donc leurs profits,</li>
		<li>etc etc.</li>
	</ul>


	<p>Je ne supporte pas, je hais, je d&eacute;teste toute cette <strong>victimisation</strong> rampante. Il y a des victimes de l&rsquo;amiante (une mati&egrave;re fantastique d&rsquo;ailleurs, dommage), il y a des victimes de la dioxyne, il y a eu des victimes du tabac, par le pass&eacute;. Plus maintenant. Mais ce qui m&rsquo;ennuie, c&rsquo;est que tout cela participe d&rsquo;un mouvement bien plus large de d&eacute;responsabilisation et d&rsquo;endormissement des foules.</p>


	<p><em>Tu bouffes trop ?</em> C&rsquo;est pas ta faute, c&rsquo;est la pub ! On va te coller un peu de <a href="http://www.mangerbouger.fr/">manger-bouger</a> par-ci par-l&agrave; et &ccedil;a ira mieux, rendors-toi.</p>


	<p><em>Tu fumes trop ?</em> C&rsquo;est pas ta faute, t&rsquo;inqui&egrave;te ! C&rsquo;est les salopards des industries du tabac, toi t&rsquo;as pas fait expr&egrave;s de fumer pendant 30 ans, mon pauvre&hellip; On va les attaquer.</p>


	<p><em>T&rsquo;es enceinte et tu bois ?</em> Mais non, t&rsquo;es pas conne, c&rsquo;est les vilains producteurs de vin qui auraient d&ucirc; te parler d&rsquo;alcoolisation foetale. T&rsquo;inqui&egrave;te on va mettre des taxes et des &eacute;tiquettes.</p>


	<p><em>Tu comprends pas trois mots d&rsquo;anglais ?</em> Pas de souci, on va obliger toutes les marques &agrave; traduire toutes leurs accroches, m&ecirc;me si la traduction n&rsquo;a aucun rapport, on s&rsquo;en fout.</p>


	<p>Nous vivons (au moins moi) dans une soci&eacute;t&eacute; d&rsquo;enculeurs de mouches, o&ugrave; chacun se d&eacute;douane de ses responsabilit&eacute;s, o&ugrave; on &eacute;vite le moindre effort au l&eacute;gume qu&rsquo;on voudrait que tu sois. Attention, je ne dis pas qu&rsquo;il est facile d&rsquo;arr&ecirc;ter de fumer, que personne ne tombe dedans dans une mauvaise p&eacute;riode de sa vie et m&eacute;rite de s&rsquo;en sortir. J&rsquo;ai des exemples parmi mes gens (comme dirait Pierre) de personnes qui se battent d&eacute;j&agrave; pile en ce moment pour s&rsquo;arr&ecirc;ter, je les admire et les soutiens.</p>


	<p>J&rsquo;aimerais juste qu&rsquo;on se r&eacute;veille de l&rsquo;absurid&eacute; dans laquelle on s&rsquo;enfonce joyeusement : bien s&ucirc;r que les media sont pour quelque chose dans notre fa&ccedil;on de consommer, de vivre ! Bien s&ucirc;r qu&rsquo;ils ont une influence ! Mais leur laisser le premier r&ocirc;le revient &agrave; abandonner l&rsquo;id&eacute;e qu&rsquo;on est ma&icirc;tre de ce qu&rsquo;on fait, et &ccedil;a &ccedil;a me d&eacute;range. Choisis la pillule bleue, Neo.. On endort les foules, on les encourage &agrave; vivre bien tranquilles dans l&rsquo;id&eacute;e qu&rsquo;elles n&rsquo;ont aucune responsabilit&eacute;. Joli <strong>triomphe de la m&eacute;diocrit&eacute;</strong>.</p>


	<p>Enfin&hellip; en France, heureusement, on &eacute;chappe &agrave; certaines de ces absurdit&eacute;s. Aux <span class="caps">USA</span>, par exemple, tu tues quelques personnes avec un fusil mitrailleur, tu peux toujours te retourner contre ton armurier. Et puis en France, heureusement, on peut zapper, et heureusement, il y a Robocop sur la chaine d&rsquo;&agrave; c&ocirc;t&eacute;. Enjoy :-)</p>


	<p>&nbsp;</p>


	<p><sup>1</sup> Seul truc un peu int&eacute;ressant : les industries du tabac qui participent &agrave; des pubs anti-tabac en direction des jeunes, dont la teneur &eacute;tait environ &ldquo;Ne fais pas &ccedil;a c&rsquo;est un truc r&eacute;serv&eacute; aux adultes.&rdquo;. Ahah. Comment mieux encourager des jeunes &agrave; fumer. Les experts qui ont pond&ucirc; &ccedil;a c&ocirc;t&eacute; sant&eacute; publique devraient avoir honte.</p>
