---
title: "Chaise musicale à 500"
---

<h1>Chaise musicale à 500</h1><p>Depuis 8 ans le service militaire n&rsquo;est plus obligatoire, et les effectifs r&eacute;tr&eacute;cissent logiquement pour s&rsquo;adapter au monde moderne, et notamment au faible risque de guerre frontale sur le territoire fran&ccedil;ais. Le gouvernement ferme donc des casernes de l&rsquo;arm&eacute;e qui n&rsquo;ont plus d&rsquo;utilit&eacute;, ce n&rsquo;est pas un secret.</p>
<p>R&eacute;sultat, des &eacute;lus locaux braillent parce qu&rsquo;ils vont perdre de la population, que leur &eacute;conomie va &ecirc;tre chamboul&eacute;e. J&rsquo;imagine bien que perdre 500 foyers en rase campagne &ccedil;a fait mal. Admettons. La d&eacute;magogie, l&rsquo;&eacute;lectoralisme et le copinage &eacute;tant ce qu&rsquo;ils sont, le gouvernement s&rsquo;empresse de promettre qu&rsquo;il va re-peupler les territoires ainsi abandonn&eacute;s en d&eacute;localisant divers services de l&rsquo;administration.</p>
<p>Et pouf, la nouvelle tombe ce matin : depuis 2 ans un grand chantier &eacute;tait en cours pour d&eacute;m&eacute;nager mon service d&rsquo;ici 2012 dans un grand pole scientifique et technique, il a d&eacute;sormais du plomb dans l&rsquo;aile. Le service d&eacute;m&eacute;nagera plut&ocirc;t <em>ailleurs</em>, pour remplacer une caserne d&eacute;sert&eacute;e. Par exemple &agrave; Caen, passe encore. Ou &agrave; <a href="http://fr.wikipedia.org/wiki/Sourdun">Sourdun</a>, 1232 habitants, le trou-du-cul du monde, sans m&eacute;chancet&eacute; aucune. Peut-&ecirc;tre &ldquo;pire&rdquo;. Quand ? Oh, sans doute 2009 ou 2010.</p>
<p>Quelles r&eacute;actions ?</p>
<ul>
	<li><strong>&eacute;tonn&eacute;</strong> : c&rsquo;est vraiment bizarre qu&rsquo;on ne bouge pas les services qui sont encore en plein centre de Paris, tous les services qui entourent les directions centrales, etc&hellip;</li>
	<li><strong>angoiss&eacute;</strong> : pas pour moi, pour les autres. Ceux qui sont l&agrave; depuis des ann&eacute;es, qui ont achet&eacute; leur maison, qui ne pourront pas quitter le service et devront suivre pour des raisons statutaires (le jeu des mutations ne profite pas vraiment aux contractuels..), qui ont s&ucirc;rement des enfants, au moins un conjoint qui va devoir suivre le mouvement (ou pas). Bon courage quoi, des &ldquo;bouts de viande&rdquo; comme disait l&rsquo;autre.</li>
	<li><strong>blas&eacute;</strong> : comme me disaient certains coll&egrave;gues, &ccedil;a fait 40 ans que le service se trouve au m&ecirc;me endroit, et c&rsquo;est la m&ecirc;me musique tout le temps. Un abruti-visionnaire d&eacute;cide qu&rsquo;il est strat&eacute;gique de d&eacute;m&eacute;nager &agrave; P&eacute;taouchnok, et c&rsquo;est parti. &ldquo;Virtuellement, on a beaucoup voyag&eacute; tu sais ! Orange, Sophia Antipolis, Caen, Recey-sur-Ourse&rdquo;. Nos politiques sont d&eacute;cid&eacute;ment infoutus de voir plus loin que le bout de leur mandat. Des visionnaires je vous dis.</li>
	<li><strong>amus&eacute;</strong> : non seulement ce genre de politique n&rsquo;a &agrave; mon avis aucune efficacit&eacute; r&eacute;elle, mais en plus le service d&eacute;plac&eacute; (le mien) est une vraie branche morte sur le point de casser. Les pauvres &eacute;lus qui vont se r&eacute;cup&eacute;rer &ccedil;a sur les bras auront un service de l&rsquo;Etat &agrave; l&rsquo;agonie qui reposera le m&ecirc;me probl&egrave;me en s&rsquo;&eacute;croulant sur lui-m&ecirc;me dans 5 ou 6 ans.</li>
	<li><strong>scandalis&eacute;</strong> : par tout le fric que &ccedil;a va co&ucirc;ter au contribuable, directement ou indirectement, et le temps que &ccedil;a va me co&ucirc;ter d&rsquo;ici max 3-4 mois de commencer &agrave; proposer des plans de d&eacute;m&eacute;nagement.</li>
	<li><strong>pragmatique</strong> : &ccedil;a a encore le temps de changer, il y a un remaniement minist&eacute;riel pr&eacute;vu en janvier :-)</li>
	<li><strong>content</strong> : je suis d&eacute;sormais certain de vouloir me barrer &agrave; court terme. Peut-&ecirc;tre m&ecirc;me que si tout &ccedil;a se met en place en 2009 j&rsquo;aurai plus de facilit&eacute; administrativement &agrave; obtenir une disponibilit&eacute; (i.e. un d&eacute;part de l&rsquo;administration avec ma place gard&eacute;e au chaud pour 3 ans renouvelables)</li>
</ul>
<p>Enfin quand m&ecirc;me, &ccedil;a donne pas envie de bosser ces conneries.<br />
Hop, une <span class="caps">RTT</span> demain. Niark :D</p>