---
title: "Pow pow pow"
---

<h1>Pow pow pow</h1><ul>
	<li>Julie Gianni d&eacute;barque sous vos applaudissements (ou pas)</li>
		<li>mes mails vers les autres continents passent desfois-oui-desfois-non (<em>bon je suis quand m&ecirc;me pas le premier newb venu, soit l&rsquo;antispam de yahoo d&eacute;conne &agrave; plein tube, soit une raclure de pelle &agrave; crottes a le mot de passe du compte, y&rsquo;a pas 36 solutions<sup><a href="#fn1">1</a></sup></em>). Enfin, en gros, je sais pas qui lit et/ou efface les mails que j&rsquo;envoie tant que j&rsquo;ai pas de r&eacute;ponse, youpi ;-)</li>
		<li>mes appels non plus passent pas &agrave; l&rsquo;international tiens</li>
		<li>j&rsquo;ai dormi 2h30 cette nuit &agrave; cause d&rsquo;un caf&eacute; &agrave; 1h du mat&rsquo; et d&rsquo;un chat d&eacute;bile qui attaque tout ce qui bouge (dont moi)</li>
		<li>je deviens sensible aux chevaux de bataille de ma soeur : <a href="http://www.lemonde.fr/societe/article/2008/07/08/les-femmes-hesitent-de-moins-en-moins-a-denoncer-les-violences-conjugales_1067472_3224.html?xtor=RSS-3208">Les femmes h&eacute;sitent de moins en moins &agrave; d&eacute;noncer les violences conjugales</a>. Ca me d&eacute;passe que tout le monde se bouffe le nez pour la nomination du pr&eacute;sident de France T&eacute;l&eacute;visions alors que ce genre de trucs se passe encore pr&egrave;s de chez nous sans qu&rsquo;on leur coupe la main, les parties, ou la t&ecirc;te. Mais que fait la police ?</li>
		<li>ma boss essaie d&rsquo;entr&eacute;e de jeu de me faire avaler qu&rsquo;un <span class="caps">BIOS</span> c&rsquo;est du hardware. Ouais, et les pilotes c&rsquo;est du hardware. Et Windows aussi. Connasse va.</li>
		<li><acronym title="11h05">MAJ</acronym> : je viens encore de d&eacute;couvrir d&rsquo;un coup <del>3</del>, 4 trucs que mon service fait n&rsquo;importe comment, en marge de toute la politique informatique d&eacute;finie au niveau national</li>
		<li><acronym title="11h07">MAJ</acronym> : encore un coll&egrave;gue qui vient de sortir de mon bureau apr&egrave;s que je l&rsquo;aie bord&eacute;. Il faut leur tenir la main pour tout, c&rsquo;est &eacute;puisant.</li>
	</ul>


	<p>Y&rsquo;a des matins comme &ccedil;a, on ferait mieux de rester au lit&hellip;</p>


	<p><sup>1</sup> Soit c&rsquo;est la baie <span class="caps">SAN</span>, bien s&ucirc;r. Private joke que personne ne comprendra, je retourne dormir, &ccedil;a fait passer le temps plus vite comme dit Boubou :-(</p>