---
title: "Lieux communs"
---

<h1>Lieux communs</h1><p>Je suis <a href="http://fr.wikipedia.org/wiki/Rhume">en train de mourir</a>, et la derni&egrave;re &eacute;mission TV que j&rsquo;aurai regard&eacute; est &ldquo;Le Bac a 200 ans&rdquo; sur <a href="http://www.publicsenat.fr/">Public S&eacute;nat</a>.</p>


Quelques r&eacute;flexions int&eacute;ressantes :
	<ul>
	<li>sur l&rsquo;essence des pr&eacute;pas : c&rsquo;est moins une comp&eacute;tition entre &eacute;l&egrave;ves qu&rsquo;une comp&eacute;tition de l&rsquo;&eacute;l&egrave;ve avec lui-m&ecirc;me, sa propre capacit&eacute; &agrave; s&rsquo;int&eacute;resser aux mati&egrave;res, &agrave; mener des raisonnements pluridisciplinaires, etc. Agreed&hellip;</li>
		<li>sur l&rsquo;admission en pr&eacute;pa : il y a en terminale ceux qui veulent avoir le bac, et ceux qui se construisent un dossier pour rentrer en pr&eacute;pa ou dans une &eacute;cole quelconque. Et apr&egrave;s ? La s&eacute;lection d&rsquo;un dossier parmi 50 dans les grands lyc&eacute;es parisiens, selon l&rsquo;&eacute;tablissement d&rsquo;origine, les notes, ... Qu&rsquo;est-ce que &ccedil;a parait al&eacute;atoire !</li>
		<li>sur l&rsquo;absurdit&eacute; du fonctionnement de la s&eacute;lection en fac : la Sorbonne, 72% d&rsquo;&eacute;chec en premi&egrave;re ann&eacute;e. Mauvaise pr&eacute;paration en lyc&eacute;e ou mauvaise orientation, les arguments penchent plut&ocirc;t vers la seconde option vu le taux d&rsquo;abandon et d&rsquo;absence aux partiels. Une id&eacute;e pour faire &eacute;voluer tout &ccedil;a ? Oulah non.</li>
		<li>le taux de r&eacute;ussite absurde &agrave; l&rsquo;examen : il faut que tout le monde ou presque ait le bac. Fusent les <em>&ldquo;youpi&rdquo;</em>, les <em>&ldquo;j&rsquo;ai rien foutu mais je l&rsquo;ai&rdquo;</em>, hourra.</li>
	</ul>


Des r&eacute;flexions hors &eacute;mission aussi :
	<ul>
	<li>comment, bordel, &eacute;valuer les profs ? Dans mon lyc&eacute;e-lyc&eacute;e, une moiti&eacute; de mes profs &eacute;tait compl&egrave;tement incapable, n&eacute;vros&eacute;e, mais ils arrivaient &agrave; pr&eacute;senter bien devant l&rsquo;inspecteur une fois tous les 3 ans, alors hourra, ils continuaient &agrave; massacrer des &eacute;l&egrave;ves et &agrave; co&ucirc;ter un fric fou &agrave; l&rsquo;EN.</li>
		<li><a href="http://fr.wikipedia.org/wiki/Budget_de_l%27%C3%89tat_fran%C3%A7ais">59,3 milliards d&rsquo;euros</a> pour l&rsquo;EN en 2008. Pour quel r&eacute;sultat ? Vive le g&acirc;chis.</li>
		<li>le syst&egrave;me des moyennes est-il vraiment le bon ? Pourquoi ne pas exiger 10 ou 11 de moyenne, mais en plus un minimum dans chaque mati&egrave;re ? Si le niveau du bac sert de garantie &agrave; un niveau minimal pour la poursuite d&rsquo;&eacute;tudes sup&eacute;rieures, on ne devrait pas l&rsquo;avoir si l&rsquo;on a 3 ou 4 dans certaines mati&egrave;res&hellip;</li>
		<li>les programmes sont-ils adapt&eacute;s ? Comme disait un lyc&eacute;en, le programme d&rsquo;histoire en terminale, par exemple, est extr&ecirc;mement touffu, et quel int&eacute;r&ecirc;t ? Comment mettre une mati&egrave;re comme &ccedil;a au niveau du langage, de l&rsquo;expression orale, de la facult&eacute; &agrave; bosser sur un th&egrave;me pluridisciplinaire ? A la limite, provoc&rsquo; inside, comment peut-on exiger d&rsquo;un lyc&eacute;en moyen qu&rsquo;il sache r&eacute;soudre des &eacute;quations diff&eacute;rentielles d&rsquo;ordre 2 alors que &ccedil;a ne sert absolument &agrave; rien dans la vie ? Pourquoi le bac S est encore la fili&egrave;re la plus suivie, alors que la fili&egrave;re la plus adapt&eacute;e &agrave; ceux qui arr&ecirc;teront les sciences et techniques plus tard est certainement la fili&egrave;re ES ?</li>
	</ul>


	<p>J&rsquo;dois avoir de la fi&egrave;vre. Je vais aller mourir tranquillement, d&eacute;brouillez-vous avec ces probl&egrave;mes :-)</p>
