---
title: "Overkill"
---

<h1>Overkill</h1><p>Vous pouvez lire cet article en &eacute;coutant la chanson de Colin Hay <a href="http://www.youtube.com/watch?v=YjETcbEDmoQ">Overkill</a>, bande son d&rsquo;un des &eacute;pisodes de Scrubs. <em>Mais t&rsquo;es pas oblig&eacute;.</em></p>


Une fois n&rsquo;est pas coutume, quelques liens :
	<ul>
	<li>la justice n&rsquo;est <a href="http://penseespolitiques.over-blog.com/article-25122354.html">pas assez r&eacute;pressive</a>, ou elle l&rsquo;est <a href="http://www.maitre-eolas.fr/2008/11/27/1223-odile">peut-&ecirc;tre trop</a>. La seule certitude est qu&rsquo;on est totalement &agrave; c&ocirc;t&eacute; de la plaque.</li>
		<li>l&rsquo;ampleur du piratage de medias en France analys&eacute;e&hellip; <a href="http://www.optimum-blog.net/post/2008/11/28/Rigueur-methodologique">&agrave; la loupe</a> par les majors</li>
		<li>une <a href="http://www.authueil.org/?2008/11/28/1111-quel-financement-du-service-public">r&eacute;flexion d&rsquo;Authueil</a> sur cette taxe absurde qu&rsquo;est la redevance tv</li>
		<li>une <a href="http://case.oncle-tom.net/2008/11/25/developpement-efficace-frameworks-css/">intro &agrave; BlueprintCSS</a>, un framework <span class="caps">CSS</span> bien sympa</li>
	</ul>


	<p>Mais non, nononon, je ne me contente pas de &ccedil;a. J&rsquo;avais d&eacute;j&agrave; diffus&eacute; ici des <a href="http://pada.chanmasters.com/2008/8/22/conseils-de-carri-re">conseils de carri&egrave;re</a>, mais l&agrave; j&rsquo;ai pris grand plaisir &agrave; lire <a href="http://www.biologeek.com/conferences,life-hacks,traduction/37signals-ce-quils-ont-appris/">cet article de chez Biologeek</a>. C&rsquo;est une traduction d&rsquo;un retour d&rsquo;exp&eacute;rience de l&rsquo;&eacute;quipe de 37signals, une <span class="caps">SSII</span> qui est notamment &agrave; l&rsquo;origine de <a href="http://www.rubyonrails.org/">Ruby on Rails</a> (rien que &ccedil;a). J&rsquo;aime vraiment lire des gens passionn&eacute;s, qui d&eacute;molissent un peu le diktat de la fausse qualit&eacute;, du contractuel, de la paperasse, pour se recentrer un peu sur ce qui importe : faire son boulot avec passion, efficacement, dans la joie et la bonne humeur. Je songe s&eacute;rieusement &agrave; diffuser &ccedil;a &agrave; mon &eacute;quipe, encore qu&rsquo;ils me prennent d&eacute;j&agrave; assez pour un tar&eacute; don-quichottesque :-) En particulier je l&rsquo;enverrais bien &agrave; ma chef, et puis, tant qu&rsquo;on y est, je vais lui envoyer la photo d&rsquo;une lame <span class="caps">IBM HS21</span> vue de l&rsquo;int&eacute;rieur, mattez-&ccedil;a :</p>


	<p><img src="/files/02122008092_little.jpg" alt="" /></p>


A part &ccedil;a, c&rsquo;est la <strong>crise</strong>. J&rsquo;ai pass&eacute; un tr&egrave;s bon week-end, mais dans moins d&rsquo;une heure nous serons en d&eacute;cembre, ce qui veut dire que No&euml;l approche &agrave; grand pas, des pas canadiens, des pas lyonnais, et il va falloir organiser &ccedil;a. Ca se fera chez moi cette ann&eacute;e, donc il va falloir :
	<ul>
	<li>penser &agrave; faire la vaisselle</li>
		<li>faire la vaisselle</li>
		<li>ranger (ou pas)</li>
		<li>faire de la place (c&rsquo;est pas que c&rsquo;est des &eacute;l&eacute;phants mais bon)</li>
		<li>trouver o&ugrave; les gens vont dormir</li>
		<li>pr&eacute;voir du foie gras <del>de canard</del> de chat</li>
		<li>acheter des rideaux (de toute fa&ccedil;on c&rsquo;est une demande r&eacute;currente)</li>
		<li>acheter une nappe, un sapin, des guirlandes, tout &ccedil;a</li>
		<li>trouver des cadeaux</li>
		<li>trouver des cadeaux non-publicitaires</li>
		<li>trouver des cadeaux non-publicitaires ET qui plaisent aux gens</li>
	</ul>


	<p>Heureusement, notre d&eacute;magouvernement ne veut pas me mon&eacute;tiser mes <span class="caps">RTT</span> de cette ann&eacute;e, donc il me reste 7j de cong&eacute;s &agrave; prendre d&rsquo;ici la fin du mois. Plus 10 jours que je comptais reporter, mais que je peux prendre si vraiment on me tape trop sur le syst&egrave;me.</p>


	<p>Bref, quand je pense &agrave; ceux qui doivent apprendre le dico en ce moment-m&ecirc;me, je me dis que c&rsquo;est bon d&rsquo;&ecirc;tre un adulte, parce que mon boulot est passionnant, que je choisis mes vacances et ce que je fais, parce que le reste du temps Elle me fait vivre un r&ecirc;ve &eacute;veill&eacute;, et que mes chats maigrissent (scoop !). Vivement que la famille soit un peu r&eacute;unie pour No&euml;l, et apr&egrave;s, c&rsquo;est reparti pour un an.</p>