---
title: "Beth"
---

<h1>Beth</h1><p><em>Josiah &ldquo;Jed&rdquo; Bartlet said :</em></p>


	<blockquote>
		<p>Et puis un soir il est arriv&eacute;, il a pos&eacute; sa valise, et il a dit : <em>&ldquo;<strong>Beth, crois-tu vraiment qu&rsquo;il n&rsquo;y a que les salopards qui savent coller un timbre ?</strong>&ldquo;</em><br /> Le probl&egrave;me est l&agrave; mes amis ! Vous devez &eacute;crire une lettre, vous devez envoyer un fax, prendre votre t&eacute;l&eacute;phone et appeler la Western Union ! Vous devez contacter votre repr&eacute;sentant du Congr&egrave;s et lui dire : <em>&ldquo;<strong>Monsieur, j&rsquo;ai un ami, dont l&rsquo;ami est mort ! Madame, j&rsquo;ai une voisine, dont l&rsquo;ami est mort, dont le mari est mort, dont la m&egrave;re est morte, dont les enfants sont morts !!</strong> Ses enfants sont morts et je veux savoir monsieur, je veux savoir madame, comment vous allez voter mercredi, comme &ccedil;a je saurai comment je vais voter en novembre !&rdquo;</em> Posez-leur la question.. Posez-leur la question !<br /><br />Voyez vous, j&rsquo;avais un professeur de droit civil qui disait&hellip; qui disait : <br /><em>&ldquo;Si la loi est avec toi, sers-toi de la loi. Et quand les faits sont avec toi, sers-toi des faits. Si tu n&rsquo;as pas la loi avec toi, et si tu n&rsquo;as pas les faits avec toi, frappe du poing sur la table de la d&eacute;fense aussi fort que tu peux.&rdquo;</em><br /><strong>Et bien nous avons la loi de notre c&ocirc;t&eacute; aujourd&rsquo;hui ! Et nous avons les faits de notre c&ocirc;t&eacute; aujourd&rsquo;hui ! Le lobby des vendeurs d&rsquo;armes tape du poing sur la table !</strong> Mais nous ne l&rsquo;&eacute;coutons plus, nous ne voulons plus de lui, nous allons gagner mercredi, nous allons gagner mercredi !<br /><br />Merci &agrave; tous, que Dieu vous b&eacute;nisse, que Dieu b&eacute;nisse l&rsquo;Am&eacute;rique !</p>
	</blockquote>


	<p>Parce que je pense juste que &ccedil;a m&eacute;rite d&rsquo;&ecirc;tre r&eacute;f&eacute;renc&eacute; dans Google. Il faut aider Google. Et le mono-maniaque en moi se fout de votre avis. Enfin, le jour o&ugrave; un politique fran&ccedil;ais fera un discours de cette trempe n&rsquo;est pas arriv&eacute;, donc autant se foutre la t&ecirc;te <del>dans le sable</del> devant des <span class="caps">DVD</span>.</p>


Sinon je regarde vaguement la t&eacute;l&eacute; ces temps-ci, et je vis l&rsquo;actu de mon service. Merci donc :
	<ul>
	<li>&agrave; la gauche d&rsquo;arr&ecirc;ter de casser les couilles &agrave; tout le monde avec le &ldquo;paquet fiscal&rdquo; dont tout le monde se fout, surtout en faisant preuve d&rsquo;une malhonn&ecirc;tet&eacute; intellectuelle &agrave; toute &eacute;preuve</li>
		<li>&agrave; la droite d&rsquo;arr&ecirc;ter les mesurettes symboliques &agrave; la Justice, lisez Maitre Eolas pour &ccedil;a, les peines planchers, ahahah</li>
		<li>aux &eacute;cono-arrivistes si bien sap&eacute;s soient-ils de manquer de respect aux hauts fonctionnaires de la R&eacute;publique : on ne dit pas &ldquo;Sarko&rdquo; sur un plateau t&eacute;l&eacute; quand on est invit&eacute; en tant qu&rsquo;expert bordel, &ccedil;a c&rsquo;est pour le <span class="caps">PMU</span> et la r&eacute;union syndicale du coin (coucou mes syndiqueux). On dit &ldquo;le pr&eacute;sident&rdquo;, &ldquo;Nicolas Sarkozy&rdquo;, &eacute;ventuellement &ldquo;le pr&eacute;sident Sarkozy&rdquo;, bien que ce soit un peu pompeux. Ca marche aussi pour les hommes d&rsquo;Etat de gauche notez. Si <em>The West Wing</em> m&rsquo;a enfonc&eacute; un truc bien dans la t&ecirc;te, ce sera &ccedil;a, d&eacute;finitivement.</li>
		<li>un jeu de chaises musicales naus&eacute;abond, sans envergure, sans vision strat&eacute;gique se joue en ce moment m&ecirc;me dans nos belles campagnes. Ou comment l&rsquo;Etat broie des vies pour faire plaisir aux copains. Je vomis, je reviens.</li>
		<li>53000&euro;. C&rsquo;est votre dernier prix ? Oui, c&rsquo;est mon dernier prix. Bon bah on va &eacute;conomiser.</li>
	</ul>