---
title: "Hangover"
---

<h1>Hangover</h1><p><em>Merci aux gels douche Axe qui me permettent jour apr&egrave;s jour d&rsquo;&eacute;toffer mon vocabulaire anglais.</em></p>


	<p>Ca ne vous aura pas &eacute;chapp&eacute;, ce matin ou cette semaine, le monde &agrave; la <strong>gueule de bois<sup><a href="#fn1">1</a></sup></strong>.</p>


	<p>Je n&rsquo;&eacute;chappe pas &agrave; cette r&egrave;gle : <strong>r&eacute;veil difficile</strong> ce matin, malade, peu dormi, la t&ecirc;te dans un &eacute;tau. Un go&ucirc;t d&rsquo;incompr&eacute;hension et d&rsquo;inachev&eacute; me cisaille la gorge, en plus des microbes, et autant dire que je m&rsquo;en passerais bien. J&rsquo;ai pourtant pass&eacute; une <strong>excellente soir&eacute;e hier</strong>, dont j&rsquo;essayerai de retenir une le&ccedil;on pour l&rsquo;avenir : les grandes discussions enflamm&eacute;es m&eacute;ritent bien mieux qu&rsquo;un bout d&rsquo;escalier dans le m&eacute;tro, un trottoir sous la pluie ou une banquette de bar bruyant. Elles n&eacute;cessitent certainement un <strong>bon diner</strong>, plus de <strong>calme</strong>, d&rsquo;intimit&eacute;, de l&eacute;g&egrave;ret&eacute;. A suivre, rapidement j&rsquo;esp&egrave;re.</p>


	<p>Ce qui pr&eacute;occupe le <strong>reste du monde</strong> (<em>cette bande d&rsquo;&eacute;go&iuml;stes qui ne pensent m&ecirc;me pas &agrave; moi</em>) c&rsquo;est la terrible <strong>crise financi&egrave;re</strong> qui commence &agrave; frapper le capitalisme, l&rsquo;occident, l&rsquo;&eacute;conomie mondiale telle qu&rsquo;on la connait aujourd&rsquo;hui. L&rsquo;<strong>&eacute;conomie r&eacute;elle</strong> se pr&eacute;pare des <strong>ann&eacute;es difficiles</strong> en occident, et accessoirement les <strong>extr&ecirc;mistes</strong> de tout poil risquent de profiter de cet affaiblissement. Allez voir <a href="http://blogs.rtl.fr/aphatie/index.php/post/2008/09/30/Laffaiblissement-de-lOccident-30/09">un article de JM Apathie sur ce sujet</a>, c&rsquo;est loin d&rsquo;&ecirc;tre inint&eacute;ressant et personne ne semble s&rsquo;en soucier dans les autres feeds de presse que je lis.</p>


	<p>Mais ce qui me pr&eacute;occupe depuis 10 minutes, ce n&rsquo;est pas vraiment que les <strong>boulversements</strong> &agrave; l&rsquo;oeuvre dans le monde actuel et l&rsquo;<strong>effondrement imminent</strong> de l&rsquo;occident et les futures <strong>guerres civiles</strong>, nononon. Ce qui me pr&eacute;occupe c&rsquo;est qu&rsquo;en cette p&eacute;riode trouble <a href="http://www.assemblee-nationale.fr/13/tribun/fiches_cir/07805.asp">certains</a> en profitent pour faire sombrer la d&eacute;mocratie dans des <strong>abysses de populisme et d&rsquo;intol&eacute;rance</strong> que je croyais r&eacute;volus : merci d&rsquo;aller lire prestement <a href="http://www.authueil.org/?2008/10/01/1028-le-voile-de-myard">cet article d&rsquo;Authueil</a>. Pour la faire courte, comme les meilleures blagues<sup><a href="#fn2">2</a></sup>, un <strong>d&eacute;put&eacute; de la R&eacute;publique Fran&ccedil;aise</strong>, terre d&rsquo;accueil, de fraternit&eacute;, et de bienveillance altruiste, propose rien de moins que de <strong>punir le port du voile sur la voie publique par 2 mois de prison et 15000&euro; d&rsquo;amende</strong>. J&rsquo;en suis sci&eacute;.</p>


<div>
Edit(5 mins plus tard) : les commentaires de l&rsquo;article sont int&eacute;ressants et temp&egrave;rent ma premi&egrave;re r&eacute;action, mais tout de m&ecirc;me, j&rsquo;ai parmi mes gens des personnes qui portent le voile volontairement, de quel droit l&rsquo;Etat s&rsquo;autoriserait &agrave; les traquer et les punir, qui plus est si lourdement ! De la fa&ccedil;on dont c&rsquo;est formul&eacute;, et c&rsquo;est mal formul&eacute;, c&rsquo;est contre-productif, &ccedil;a limite les droits des gens, c&rsquo;est mal tourn&eacute;, &ccedil;a entrave la libert&eacute; de culte, &ccedil;a entrave ma libert&eacute; &agrave; me v&ecirc;tir comme je le souhaite. En plus c&rsquo;est hypocrite, on vise les populations musulmanes sans les citer. Pour finir, &ccedil;a continue de me faire vomir de sacrifier des individus qui n&rsquo;ont rien demand&eacute; sur la place publique pour soit-disant en sauver d&rsquo;autres, ou faire triompher des principes sup&eacute;rieurs li&eacute;s &agrave; des d&eacute;lires philosophiques ou des symboles abscons. J&rsquo;esp&egrave;re des politiques plus nuanc&eacute;s, plus pragmatiques, moins d&eacute;mago. Le jour o&ugrave; une loi comme &ccedil;a est adopt&eacute;e, je sors la cagoule juste pour rire !
</div>

<div>
Edit(15 mins plus tard) : hey, je pense aussi &agrave; un exemple pratique, &agrave; lire au second degr&eacute; s&rsquo;il vous plait. <strong>Charles-Henri</strong> habite &agrave; <strong>Neuilly</strong>. Il s&rsquo;habille chez <strong>Prada</strong>, il conduit une <strong>Smart</strong>. Il est <strong>musulman, mais du genre tr&egrave;s con et int&eacute;griste</strong>. <em>Il y a 99% de musulmans cool et sympas, seulement il y en a aussi des cons et int&eacute;gristes, et ils se cachent peut-&ecirc;tre &agrave; Neuilly, et c&rsquo;est moi qui d&eacute;cide de comment je fais l&rsquo;histoire, alors vos gueules.</em> Il oblige <strong>Marie-Annick</strong>, son &eacute;pouse, sa chose, &agrave; porter le voile (un <strong>carr&eacute; Herm&egrave;s</strong> ou &eacute;quivalent), parce que Marie-Annick est une <strong>saloperie de femme inf&eacute;rieure</strong> et une <strong>tentation pour tous les hommes</strong> qui regardent ses cheveux verdoyants dans la rue (les hommes me d&eacute;goutent, de vrais pervers). CH n&rsquo;avait pas le choix, il a d&ucirc; se r&eacute;soudre &agrave; punir ses <strong>derni&egrave;re provocations</strong> (un sourire au boulanger) en la for&ccedil;ant &agrave; porter le voile, m&ecirc;me si elle n&rsquo;&eacute;tait pas d&rsquo;accord au d&eacute;but. Mais c&rsquo;est une femme, et chez <strong>les gros cons</strong> (<strong>musulmans ou non</strong>), personne n&rsquo;a le droit de ne pas &ecirc;tre d&rsquo;accord avec le plus fort. 

	<p>Alors voil&agrave;, en admettant que le d&eacute;put&eacute; M. fasse passer sa loi, MA (qui m&eacute;lange alcool, Tanxen et Vallium en attendant que CH soit un peu moins con) va se faire coffrer et partir dans une prison tout confort je ne sais o&ugrave;. Ca soul&egrave;ve tout un tas de questions passionnantes auxquelles personne ne voudra r&eacute;pondre : comment Marie-Annick va-t-elle se procurer ses doses de m&eacute;docs en prison ? Comment Herm&egrave;s va se relever d&rsquo;une telle baisse de chiffre d&rsquo;affaire ? Comment le flic et le juge pourraient se regarder dans une glace apr&egrave;s &ccedil;a ? Comment CH va-t-il g&eacute;rer tout cela dans sa t&ecirc;te de con ? Et puis d&rsquo;abord, c&rsquo;est quoi le nom de famille de MA, on pourrait ptet s&rsquo;arranger monsieur l&rsquo;juge ? <strong>Hihihihi.</strong><br />
</div></p>


<div>
Edit(30mins plus tard) : et bordel, pourquoi on ne s&rsquo;attaque jamais aux probl&egrave;mes en frontal dans ce pays en mousse ? Ce texte pourrait se justifier par la d&eacute;magogie visant quelques connards pour endormir leurs pulsions racistes, ce que je me refuse &agrave; croire, mais aussi par l&rsquo;int&eacute;r&ecirc;t sup&eacute;rieur des femmes qu&rsquo;on pourrait <em>sauver</em> (&agrave; d&eacute;finir le jour o&ugrave; on aura le temps) de l&rsquo;oppression masculine et de la chaleur estivale insupportable sous une burqua (vous essayerez, c&rsquo;est le TP du jour pour l&rsquo;&eacute;t&eacute; prochain). Et dans cette deuxi&egrave;me hypoth&egrave;se, on punirait la femme ? Comme si (dans le cas d&rsquo;une oppression effective) elle &eacute;tait d&eacute;j&agrave; pas assez au fond du gouffre ? Ay&eacute;, je suis de nouveau &eacute;nerv&eacute;.
</div>

	<p>&mdash;</p>


	<p><sup>1</sup> <em>Hangover</em> pour nos amis qui bouffent du poulet &agrave; la menthe ou des quadruples burger sauce grasse.</p>


	<p><sup>2</sup> Inutile de pr&eacute;ciser qu&rsquo;une telle connerie ne sera jamais vot&eacute;e par aucune des deux assembl&eacute;es, fort heureusement.</p>