---
title: "Like a virgin, touched for the very first time"
---

<h1>Like a virgin, touched for the very first time</h1><p>L&rsquo;imb&eacute;cilit&eacute; qui transpire des commentaires de certains atteint en ce moment des sommets qui me paraissent proprement intol&eacute;rables. Le <span class="caps">TGI</span> de Lille a statu&eacute; le 1er avril 2008 sur l&rsquo;annulation d&rsquo;un mariage de l&rsquo;&eacute;t&eacute; 2006 pour, histoire de simplifier, mensonge de la jeune &eacute;pouse sur la puret&eacute; de sa fleur.</p>


	<p>Je vous recommande la lecture des articles suivants :<br />
- <a href="http://maitre-eolas.fr/2008/05/30/969-n-y-a-t-il-que-les-vierges-qui-puissent-se-marier">Maitre Eolas : N&rsquo;y a-t-il que les vierges qui puissent se marier ?</a><br />
- <a href="http://www.authueil.org/?2008/05/30/864-de-la-consommation-de-mariage">Authueil : De la consommation du mariage</a><br />
- <a href="http://www.koztoujours.fr/?p=731">Koz : La virginit&eacute; leur fait perdre la t&ecirc;te</a><br />
- <a href="http://maitre-eolas.fr/2008/06/02/974-affaire-du-mariage-annule-la-chancellerie-demande-au-parquet-general-de-faire-appel">Maitre Eolas : Affaire du mariage annul&eacute; : la chancellerie demande au parquet g&eacute;n&eacute;ral de faire appel</a><br />
- <a href="http://maitre-eolas.fr/2008/06/03/975-eolas-sur-france-info">Maitre Eolas : Eolas sur France Info</a><br />
- <a href="http://www.koztoujours.fr/?p=734">Koz : O&ugrave; je reparle de la fleur de Mme H. &eacute;pouse C.</a></p>


	<p>Et je me permets d&rsquo;ajouter ma couche &agrave; l&rsquo;analyse, relativement sommaire, mais il est inutile de r&eacute;p&eacute;ter ce qui est dit ci-dessus.</p>
<p>Au passage, les liens ci-dessus r&eacute;v&egrave;lent des opinions diff&eacute;rentes, je ne suis pas cat&eacute;gorique sur cette affaire et je ne cherche pas &agrave; enfoncer le plus profond possible les gens qui pensent diff&eacute;remment, ce n&rsquo;est pas vraiment le genre de la maison. Ce n&rsquo;est pas non plus le genre de la maison de <a href="http://aureliefilippetti.free.fr/index.php?post/2008/05/29/L-horreur">crier au scandale &agrave; chaud les yeux inject&eacute;s de sang</a>, de <a href="http://www.niputesnisoumises.com/actualite.php?numactu=187">prendre des raccourcis intellectuels douteux pour se faire de la pub</a> (amis du respect des standards num&eacute;riques, bonsoir ! Comment peut-on diffuser ce genre de daube&hellip;), ou de caricaturer les faits au point de ne plus les reconna&icirc;tre pour vendre du papier /mettre ici n&rsquo;importe quel article de militant politique trop s&ucirc;r de ces convictions/. C&rsquo;est pourquoi je ne mets pas ces liens en valeur ci-dessus, le lecteur est libre d&rsquo;aller se polluer le cerveau avec ces torchons num&eacute;riques :-)</p>


	<h3>La malhonn&ecirc;tet&eacute; intellectuelle</h3>


	<p>G&eacute;rard, si tu voyais &ccedil;a. Autour de cette affaire, les uns et les autres :</p>


	<ul>
	<li>tordent la r&eacute;alit&eacute; des faits dans le sens qui les arrange (inutile de donner des exemples) ;</li>
		<li>oublient des d&eacute;tails insignifiants : au d&eacute;but de la pol&eacute;mique, tout le monde a oubli&eacute; de dire que la d&eacute;fenderesse avait (certainement par comodit&eacute; technique, admettons) plaid&eacute; pour une annulation du mariage, oups ;</li>
		<li>d&eacute;bordent du sujet : et que je te parle de la virginit&eacute; comme qualit&eacute; essentielle-et-intrins&egrave;que-des-femmes-ou-pas, et de l&rsquo;islam qui-prone-les-pires-atrocit&eacute;s-alors-que-les-autres-religions-pas-du-tout, et du droit des femmes bafou&eacute;-revenu-3000-ans-en-arri&egrave;re, et bla et bla et bla ; </li>
		<li>prennent des raccourcis intellectuels douteux et passent parfois &agrave; 2 doigts du <a href="http://fr.wikipedia.org/wiki/Loi_de_Godwin">Point Godwin</a>. Citons <a href="http://www.assemblee-nationale.fr/13/tribun/fiches_id/333611.asp">Aur&eacute;lie Filippetti</a>, d&eacute;put&eacute; PS de la Moselle de son &eacute;tat, qui fait une entr&eacute;e fracassante dans le club peu select des irresponsables politiques qui compensent leur faible QI par le verbe. Cette dame, donc, hier sur France Info (audio <a href="http://maitre-eolas.fr/2008/06/03/975-eolas-sur-france-info">ici</a>) compare le diktat religieux sur la virginit&eacute; des jeunes filles avec l&rsquo;excision comme support d&rsquo;un mensonge pouvant mener &agrave; une annulation du mariage. C&rsquo;est vrai, c&rsquo;est presque pareil ces deux sujets. Se faire exciser, y&rsquo;a pas de quoi en faire un plat, fais pas ta mijor&eacute;e. De toute fa&ccedil;on tu perdras ta virginit&eacute; un jour, alors, foutue pour foutue !</li>
	</ul>


	<p>Que c&rsquo;est fatiguant tous ces cons&hellip; Mais continuons.</p>


	<h3>L&rsquo;effet de loupe</h3>


	<p>Cette affaire a subi un effet de loupe ahurissant. Un fait divers aboutit &agrave; une simple d&eacute;cision de justice entre deux particuliers, et depuis deux semaines, tout le monde ne parle que de &ccedil;a. Il n&rsquo;y a pas un probl&egrave;me ? Bon, il y a bien s&ucirc;r imm&eacute;diatement une annonce. Les politiques ne sont &eacute;videmment que de stupides roseaux qui plient au moindre coup de vent, qui peut venir de l&rsquo;actu, d&rsquo;une demi journ&eacute;e de gr&egrave;ve de 12 ballauds, . Droite, gauche, pas d&rsquo;inqui&egrave;tude, il y aura toujours du changement, des grandes id&eacute;es, des annonces &agrave; foison, et rien de structurel, surtout pas une once de courage, rien, rien, rien&hellip; C&rsquo;est d&eacute;solant. Mais continuons.</p>


	<h3>Les politiques et les libert&eacute;s individuelles</h3>


	<p>Toujours Aur&eacute;lie, wonderwoman locale des libert&eacute;s individuelles.</p>


	<blockquote>
		<p>Maitre Eolas&mdash;Le mariage est une affaire profond&eacute;ment priv&eacute;e, et la soci&eacute;t&eacute; n&rsquo;a pas &agrave; s&rsquo;int&eacute;resser &agrave; ces causes-l&agrave; [NDLA: la virginit&eacute; de la future &eacute;pouse] d&egrave;s lors que l&rsquo;&eacute;poux avait clairement exprim&eacute; que c&rsquo;&eacute;tait une condition pour lui. On peut le d&eacute;sapprouver, on peut le critiquer, tout &agrave; fait, &ccedil;a c&rsquo;est une libert&eacute; d&rsquo;opinion, mais juridiquement, il avait dit qu&rsquo;il n&rsquo;&eacute;pouserait son &eacute;pouse que si elle &eacute;tait vierge&hellip;<br />
Aur&eacute;lie Filippetti (lui coupant la parole)&mdash;D&eacute;sol&eacute;, &ccedil;a, ce genre d&rsquo;argument on n&rsquo;a pas &agrave; entendre &ccedil;a en France ! Je suis d&eacute;sol&eacute;e, on est dans une r&eacute;publique, qui a un certain nombre de principes, de la&iuml;cit&eacute;, on n&rsquo;a pas &agrave; entendre ce genre d&rsquo;arguments en France [...]&rdquo;</p>
	</blockquote>


	<p>Cela se passe de commentaire. On n&rsquo;aurait plus le droit, en France, avec un F majuscule grand comme &ccedil;a, d&rsquo;arguer de choix relevant de la religion, de la spiritualit&eacute;, pour justifier des d&eacute;cisions dans la sph&egrave;re priv&eacute;e. A moins que ce soit r&eacute;serv&eacute; &agrave; l&rsquo;Islam ? Hum, j&rsquo;ai peur de ne pas bien avoir compris&hellip;</p>


	<p>A droite ? Pas mieux, la garde des sceaux <a href="http://maitre-eolas.fr/2008/06/03/977-dati-en-shorter">est &agrave; la limite du p&eacute;tage de plombs &agrave; l&rsquo;Assembl&eacute;e Nationale</a>. Entre le shorter et le deuxi&egrave;me commentaire on a presque tout dit (hormis que les vilains de gauche sont responsables de tous les maux de la politique sociale fran&ccedil;aise aux yeux des gentils de droite). Mon shorter &agrave; moi ? Hum&hellip; &ldquo;Les jeunes filles sont libres gr&acirc;ce &agrave; la Grande Justice Fran&ccedil;aise. R&eacute;jouissons-nous, car elles sont aussi libres de subir une proc&eacute;dure d&rsquo;appel sur un jugement qui leur convient ainsi qu&rsquo;au plaignant. En effet, la Pl&egrave;be le r&eacute;clame, et comme on dit, une de sacrifi&eacute;e&hellip;&rdquo;</p>


	<p>Avec des politiques de ce niveau, sans aucune retenue, aucun recul, aucune mesure, qui font &agrave; peine la diff&eacute;rence entre leur histoire personnelle et l&rsquo;int&eacute;r&ecirc;t de la nation, on n&rsquo;est pas arriv&eacute;s&hellip;</p>


	<h3>Un brin de logique</h3>


	<p>&ldquo;Oui mais moi, je suis d&rsquo;accord avec ce jugement, le probl&egrave;me, c&rsquo;est la <b>jurisprudence</b>.&rdquo;</p>


	<p>Oui mais Maurice, les juges ne sont pas des abrutis qui partent d&rsquo;un exemple pour en faire une g&eacute;n&eacute;ralit&eacute;. La jurisprudence n&rsquo;est pas une sorte de maladie qui s&rsquo;&eacute;tend si l&rsquo;on n&rsquo;y prend pas garde. Ce n&rsquo;est pas &ccedil;a, la jurisprudence. La jurisprudence, c&rsquo;est une solution donn&eacute;e &agrave; une situation donn&eacute;e (<a href="http://fr.wikipedia.org/wiki/Jurisprudence">click here</a>). De deux choses l&rsquo;une : soit ce jugement est bon et dans des circonstances tr&egrave;s similaires, le jugement rendu pourra s&rsquo;appuyer sur cette premi&egrave;re d&eacute;cision, tout en &eacute;tant adapt&eacute;e au cas futur (suivez un peu). Soit ce jugement est mauvais, et le vrai probl&egrave;me, ce n&rsquo;est pas la jurisprudence, c&rsquo;est que tu n&rsquo;es pas d&rsquo;accord avec ce premier jugement.</p>


	<p>Pfiou.<br />
Bon, cette fois on arr&ecirc;te, je mettrai &agrave; jour un de ces soirs. Ou pas.</p>