---
title: "Blah"
---

<h1>Blah</h1><blockquote>
<p>Hello Japan, I&rsquo;m JP ! And I&rsquo;m here to talk you about my brand new movie !</p>
</blockquote>
<p>Ou pas. Mais je sens que ce billet va &ecirc;tre truff&eacute; de citations et des commentaires ou r&eacute;ponses qui vont avec. Let&rsquo;s go !</p>
<blockquote>
<p>Je vis un r&ecirc;ve, ma poule, je vis un r&ecirc;ve !</p>
</blockquote>
<p>Wow. Comment je peux faire la diff&eacute;rence entre r&ecirc;ve et r&eacute;alit&eacute; moi ?</p>
<blockquote>
<p>M&ecirc;me dans mes r&ecirc;ves je ne suis qu&rsquo;un idiot qui sait qu&rsquo;il va se r&eacute;veiller&hellip;</p>
</blockquote>
<p>Ou pas, esp&eacute;rons. Pour un cauchemar, c&rsquo;est facile. Bien que je me sois r&eacute;veill&eacute; hier matin &agrave; me dire que je devais absolument annuler mon abandon de la pr&eacute;pa, que tu &eacute;tais dans cette classe, que tu allais me manquer &agrave; en exploser mes poumons.. Anyway. G&eacute;rard et Bacchus-est-un-con ont &eacute;t&eacute; compr&eacute;hensifs, c&rsquo;est d&eacute;j&agrave; &ccedil;a. Par contre pourquoi le proviseur s&rsquo;appelait Foucault (mon actuel N+5 si l&rsquo;on peut dire) et pas Hiver comme tout le monde ? Moi-m&ecirc;me je n&rsquo;y comprends plus rien, la suite&hellip;</p>
<p><img src="/assets/2008/8/21/eye.png" alt="" /></p>
<p>Pour un r&ecirc;ve, c&rsquo;est une autre paire de manches&hellip; J&rsquo;ai r&ecirc;v&eacute; hier toute l&rsquo;apr&egrave;s-midi, une <del>petite</del> grande <em>bouff&eacute;e d&rsquo;oxyg&egrave;ne</em> &copy;, j&rsquo;ai r&ecirc;v&eacute; quand j&rsquo;essayais de prendre la douche la plus rapide du monde, 10 minutes de double tornade. J&rsquo;ai surtout r&ecirc;v&eacute; au cin&eacute;ma : je ne sais pas si ce regard &eacute;tait bienveillant, inquiet, interrogateur, mais il m&rsquo;a arrach&eacute; &agrave; mon si&egrave;ge et je me suis mis &agrave; tomber, je n&rsquo;ai p&ucirc; me raccrocher &agrave; rien&hellip; Je sentais une main qui me serrait mais c&rsquo;&eacute;tait irr&eacute;el, je tombais, le ventre vid&eacute;, j&rsquo;ai cru voir passer des heures avant de m&rsquo;&eacute;craser dans mon fauteuil rouge moelleux et de pouvoir de nouveau bouger, me lib&eacute;rer, chuchotter une b&ecirc;tise et me concentrer sur une autre histoire d&rsquo;amour. Pour plagier <a href="http://en.wikipedia.org/wiki/Leo_McGarry">Leo McGarry<sup class="footnote"><a href="#fn1">1</a></sup></a> : <em>comment peut-on se passer d&rsquo;une telle sensation, ne pas vouloir la ressentir encore et encore ! [&hellip;] Vous croyez vraiment que &ccedil;a a quelque chose &agrave; voir avec la raison, l&rsquo;intelligence ou la volont&eacute; ?</em></p>
<p>So what ? Je suis un junkie. Et merde.</p>
<blockquote>
<p>Arr&ecirc;te de dire des trucs comme &ccedil;a, je vais y croire apr&egrave;s.</p>
</blockquote>
<p>Tu peux, je n&rsquo;ai jamais &eacute;t&eacute; aussi s&eacute;rieux. Je parlais de blindage, carapace, barri&egrave;re r&eacute;cemment. Ce mot est revenu hier dans une conversation, et je continue &agrave; le rejeter en bloc. Et pourtant je me mets moi-m&ecirc;me des barri&egrave;res, parce que j&rsquo;ai menti dans l&rsquo;article pr&eacute;c&eacute;dent : c&rsquo;est joli de faire semblant de n&rsquo;avoir peur de rien (hors angoisses instantann&eacute;es), mais parfois j&rsquo;ai des millions de choses &agrave; dire, ou juste une seule, et rien ne sort parce que j&rsquo;ai trop peur de la r&eacute;action d&rsquo;en face. Let&rsquo;s make a deal : pas de barri&egrave;re stupide, allons-y au feeling, would you ?</p>
<blockquote>
<p>Sans vinaigre, le miel n&rsquo;est pas vraiment le miel&hellip;</p>
</blockquote>
<p>Le refrain du vinaigre et du miel&hellip; Et si on les mixait, un jour du miel avec un soup&ccedil;on de vinaigre, un jour du miel avec quelques instants mielleux ? Et pourquoi pas les m&eacute;langer vraiment ? M&ecirc;ler un peu de ce miel &agrave; chaque moment de ma vie. Ce miel qui colle, dense, qui s&rsquo;insinue lentement mais s&ucirc;rement, qui va obstruer mes art&egrave;res, qui envahit mes articulations jusqu&rsquo;&agrave; la paralysie, qui veut conqu&eacute;rir mon cerveau en sucrant chaque pens&eacute;e comme je sucre mon caf&eacute;<sup class="footnote"><a href="#fn2">2</a></sup>. Le vinaigre pourra toujours tenter ce qu&rsquo;il veut, tant que le miel est l&agrave;, il glissera sur ma peau, il laissera son go&ucirc;t amer et son odeur d&eacute;sagr&eacute;able mais ce sera tout.</p>
<p>Je d&eacute;teste mes r&eacute;actions aujourd&rsquo;hui, je culpabilise de ressentir ce que je ressens, d&rsquo;avoir &eacute;t&eacute; aggac&eacute; toute &agrave; l&rsquo;heure. Si on peut r&eacute;sumer ce qui s&rsquo;est dit plus haut, je suis un junkie &eacute;go&iuml;ste et r&ecirc;veur, je me trouve des circonstances att&eacute;nuantes, je t&rsquo;en trouve &agrave; toi, je pense un peu &agrave; toi (pas la m&ecirc;me), je tourne en rond avec toi (encore une autre), et je m&rsquo;inqui&egrave;te beaucoup pour vous (une autre encore et la premi&egrave;re). J&rsquo;adore ma vie. Conclusion &agrave; la con, mais vraiment, sinc&egrave;rement, j&rsquo;adore ma vie.</p>
<p>&mdash;</p>
<p class="footnote"><sup>1</sup> De fa&ccedil;on compl&egrave;tement libre, je n&rsquo;ai pas le passage sous la main.</p>
<p class="footnote"><sup>2</sup> C&rsquo;est &agrave; dire avec 17 sucres par tasse, comme Odile Deray.</p>
<p>Cr&eacute;dit photo : <a href="http://underaglassbell.deviantart.com/">click</a></p>