---
title: "Le gouvernement veut un filtrage de masse des réseaux"
---

<h1>Le gouvernement veut un filtrage de masse des réseaux</h1><p>Un <a href="http://www.pcinpact.com/actu/news/44018-filtrage-internet-neutralite-FAI-operateurs.htm">article de PCInpact</a> trace les grandes lignes d&rsquo;une r&eacute;forme inqui&eacute;tante qui mettent les <span class="caps">FAI</span> au coeur d&rsquo;un syst&egrave;me de filtrage des r&eacute;seaux.</p>


	<p>En juin 2006 d&eacute;j&agrave;, la <a href="http://fr.wikipedia.org/wiki/Droit_d%27auteur_et_droits_voisins_dans_la_soci%C3%A9t%C3%A9_de_l%27information"><span class="caps">DADVSI</span></a> flinguait officiellement votre droit &agrave; la copie priv&eacute;e et favorisait l&rsquo;utilisation de mesures de protection comme les <span class="caps">DRM</span>. Pour m&eacute;moire, les <span class="caps">DRM</span> ce sont ces petits verrous qui vous permettent de lire votre tout nouveau CD sur votre chaine hifi mais pas sur votre PC, qui font que vous &ecirc;tes oblig&eacute;s d&rsquo;utiliser Windows pour lire certains CD ou <span class="caps">DVD</span>, etc. En bref, ces verrous favorisent les logiciels propri&eacute;taires et les ventes li&eacute;es, en vous traitant au passage comme un criminel lorsque vous avez achet&eacute; le produit. Le petit d&eacute;linquant num&eacute;rique du coin, qui lui aura t&eacute;l&eacute;charg&eacute; ill&eacute;galement l&rsquo;oeuvre en question, n&rsquo;aura &eacute;videmment pas ces probl&egrave;mes. Derri&egrave;re cette loi, il y a des probl&egrave;mes de gros sous : la <span class="caps">SACEM</span> et le <span class="caps">SNEP</span> en particulier, qui essayent de sauver ce qui reste d&rsquo;un mod&egrave;le d&eacute;pass&eacute; de gestion des droits d&rsquo;auteurs. Il faut quand m&ecirc;me avoir l&rsquo;honn&ecirc;tet&eacute; de signaler que ce ne sont pas les auteurs qui s&rsquo;en mettent plein les poches au final, bien entendu.</p>


	<p>Une nouvelle fois le l&eacute;gislateur se pr&eacute;pare &agrave; frapper. Mais c&rsquo;est pour votre bien :-)</p>
<p><del>Je me contente de reprendre les titres des points &eacute;nonc&eacute;s dans l&rsquo;article de PCInpact pour la suite.</del> Finalement je pr&eacute;f&egrave;re trier les infos moi-m&ecirc;me vus <a href="http://www.pcinpact.com/Affichage-plein-ecran-44045-58248.htm">les</a> <a href="http://www.pcinpact.com/Affichage-plein-ecran-44045-58249.htm">scans</a> <a href="http://www.pcinpact.com/Affichage-plein-ecran-44045-58250.htm">du</a> <a href="http://www.pcinpact.com/Affichage-plein-ecran-44045-58251.htm">projet</a>.</p>


	<p>Tout d&rsquo;abord, les futurs signataires de ce texte seraient les fournisseurs d&rsquo;acc&egrave;s &agrave; internet (FAI), les op&eacute;rateurs mobiles, les fournisseurs de services en ligne et &eacute;diteur. Autant dire qu&rsquo;on ratisse assez large. Certainement trop d&rsquo;ailleurs, cela semble inclure les h&eacute;bergeurs qui comme les <span class="caps">FAI</span> devraient avoir un certain devoir de neutralit&eacute; : ce n&rsquo;est pas parce qu&rsquo;un p&eacute;dophile s&eacute;vit dans un appartement dont vous &ecirc;tes le propri&eacute;taire (ou sur une commune dont vous &ecirc;tes le maire) que vous devez forc&eacute;ment le surveiller et encourir les m&ecirc;mes peines que lui, ce serait absurde si vous n&rsquo;&ecirc;tes pas au courant&hellip; Et personne ne songe &agrave; demander au maire/propri&eacute;taire de surveiller ses administr&eacute;s/locataires, ce serait &eacute;galement absurde.</p>


	<h3>1. Am&eacute;liorer la s&eacute;curit&eacute; de l&rsquo;utilisateur</h3>


	<p><span class="mybox good">great !</span> Le texte pr&eacute;voit de forcer les signataires &agrave; informer au maximum les utilisateurs sur les risques existants, les moyens techniques &agrave; leur disposition pour s&rsquo;en pr&eacute;munir, de mettre en valeur des conseils, bonnes pratiques, et des infos sur le spam, le phishing, etc. C&rsquo;est plut&ocirc;t une bonne chose : j&rsquo;aurais tendance naturellement &agrave; laisser les ignorants dans l&rsquo;ignorance et prier pour qu&rsquo;ils fassent exploser leur PC, mais les r&eacute;percussions sur l&rsquo;ensemble du syst&egrave;me deviennent vite importantes quand des newbies arrivent &agrave; avoir des botnets de plusieurs centaines de milliers de machines.</p>


	<p><span class="mybox bof">bof&hellip;</span> Le texte pr&eacute;voit la s&eacute;curisation de l&rsquo;&eacute;quipement utilisateur : cela parait &ecirc;tre une bonne id&eacute;e dans l&rsquo;absolu, mais il est question d&rsquo;<em>une d&eacute;marche proactive de s&eacute;curisation des &eacute;quipements par des mesures adapt&eacute;es</em>, dont, c&rsquo;est donn&eacute; en exemple entre parenth&egrave;ses, <em>information, suspension, r&eacute;siliation, blocage de certains ports</em>. Mouais. C&rsquo;est vrai que les box livr&eacute;es par les <span class="caps">FAI</span> sont des passoires, mais pour le coup du filtrage de certains ports, efficacit&eacute; 0 &agrave; mon humble avis.</p>


	<p><span class="mybox bof">bof&hellip;</span> La lutte contre le spam : <em>Lutter contre le spam &agrave; traver une politique adapt&eacute;e [...], en cr&eacute;ant une adresse de type &ldquo;abuse@&rdquo; et en participant activement au programme SignalSpam</em>. Mais c&rsquo;est super &ccedil;a dis-moi Lionel ! Non, la lutte contre le spam ne sera jamais efficace de cette mani&egrave;re. Les protocoles mail sont naturellement des passoires, c&rsquo;est fait expr&egrave;s, et ce pan d&rsquo;internet a besoin d&rsquo;une r&eacute;volution technique, pas de pansements de ce genre.</p>


	<p><span class="mybox bad">argl !</span> D&rsquo;ailleurs, dans les pansements, je viens de voir <em>quotas d&rsquo;envoi</em>, et l&agrave;, je tombe de ma chaise. Tu envoies 20 mails par jour maxi, apr&egrave;s panpanculcul&hellip; Super, on sent que les mecs se sont pench&eacute;s dessus des mois.</p>


	<h3>2. Apporter une information g&eacute;n&eacute;rale</h3>


	<p><span class="mybox good">bien&hellip;</span> C&rsquo;&eacute;tait d&eacute;j&agrave; bien au dessus, c&rsquo;est un copier-coller rat&eacute; mais c&rsquo;est aussi bien de le dire deux fois.</p>


	<h3>3. Encadrer l&rsquo;usage des services &agrave; travers une charte de l&rsquo;utilisateur</h3>


	<p><span class="mybox bof">bof&hellip;</span> Une charte de l&rsquo;utilisateur. Ce qui est pr&eacute;vu, c&rsquo;est la m&ecirc;me chose que les <span class="caps">CGU</span> ou <span class="caps">CGV</span> habituelles que vous validez sans les lire. C&rsquo;est s&ucirc;r, on encourage, on sensibilise, on encadre. Enfin, on fait semblant, puisque personne ne lira cette charte. Efficacit&eacute; 0.</p>


	<p><span class="mybox bad">argl !</span> <em>La possibilit&eacute; de pr&eacute;voir contractuellement une modalit&eacute; de suspension de la possibilit&eacute; de publier, par des personnes autres que le cr&eacute;ateur de l&rsquo;espace, en l&rsquo;absence de toute mise &agrave; jour, modification, intervention ou mod&eacute;ration d&rsquo;un contenu depuis trois mois ; ainsi que l&rsquo;existence de mesures de suspension ou de suppression de l&rsquo;espace</em>. Il me semble que 3 mois apr&egrave;s la publication d&rsquo;un contenu on ne peut plus (ou moins?) attaquer son auteur en diffamation. Qu&rsquo;&agrave; cela ne tienne, le contenu pourra &ecirc;tre supprim&eacute; par un tiers :-) Finalement, je vais peut-&ecirc;tre les lire, les <span class="caps">CGU</span>, quand j&rsquo;acc&eacute;derai &agrave; une nouvelle plateforme.</p>


	<p><span class="mybox bad">bad !</span> La mod&eacute;ration a priori de tout espace interactif destin&eacute; aux mineurs. Au revoir Skyblog :-)</p>


	<p><span class="mybox good">ok</span> <em>Les services et contenus destin&eacute;s aux mineurs ne contiennent pas de publicit&eacute;s faisant la promotion de biens ou services inappropri&eacute;s</em> comme les rencontres adultes, tabac, alcool. Plut&ocirc;t bien. Les recadrages suivant sur les publicit&eacute;s contextuelles vont plut&ocirc;t dans le bon sens &eacute;galement, m&ecirc;me si j&rsquo;ignore les probl&egrave;mes techniques sous-jacents.</p>


	<h3>4. Permettre un meilleur signalement de la part des internautes</h3>


	<p><span class="mybox bof">bof&hellip;</span> On ne sait pas bien si c&rsquo;est d&rsquo;information ou de flicage qu&rsquo;il s&rsquo;agit. Les op&eacute;rateurs sont encourag&eacute;s &agrave; &ecirc;tre coop&eacute;ratifs, mouais&hellip;</p>


	<h3>5. Participer &agrave; la politique de signalement</h3>


	<p><span class="mybox bad">bad !</span> Le texte pr&eacute;voit une obligation des signataires de coop&eacute;rer activement pour d&eacute;noncer les utilisateurs qui commettraient des infractions aux autorit&eacute;s, sans passer par la case Justice. On est &agrave; mon avis sur une pente tr&egrave;s dangereuse ici&hellip;</p>


	<h3>6. Am&eacute;liorer les d&eacute;lais de r&eacute;ponse dans le cadre des r&eacute;quisitions judiciaires</h3>


	<p><span class="mybox bof">bof&hellip;</span> En cas de demande du juge, le signataire est invit&eacute; &agrave; coop&eacute;rer activement. Pas de quoi en faire un plat, je me demande bien ce que &ccedil;a va am&eacute;liorer, sachant que les <span class="caps">FAI</span> sont d&eacute;j&agrave; en th&eacute;orie oblig&eacute;s de conserver un an les traces de toutes les correspondances IP&lt;-&gt;Utilisateur et pratiquent d&eacute;j&agrave; ce type de coop&eacute;ration (&agrave;mha).</p>


	<h3>7. Mieux participer au travail des autorit&eacute;s publiques en conservant et en transmettant certaines donn&eacute;es</h3>


	<p><span class="mybox bof">bof&hellip;</span> Conservation et transmission des donn&eacute;es de connexion un an. Mais.. ce n&rsquo;est pas d&eacute;j&agrave; le cas ?</p>


	<h3>8. Mettre en place une d&eacute;marche efficiente de retrait et de suspension ou de blocage de certains contenus</h3>


	<p><span class="mybox good">Good..</span> C&rsquo;est l&agrave; qu&rsquo;on touche &agrave; ce qui a fait du bruit, le retrait et le suivi des contenus p&eacute;dopornographiques notamment.</p>


	<h3>Que penser de ce texte ?</h3>


	<p>Vous pouvez d&eacute;j&agrave; lire <a href="http://www.pcinpact.com/actu/news/44046-ministere-charte-confiance-ligne-FAI.htm">un article plus r&eacute;cent de PCInpact</a>. Pour moi, les critiques sont concentr&eacute;es dans ce paragraphe :</p>


	<blockquote>
		<p><em>&laquo; Il n&rsquo;y a aucune tentative de contourner le r&ocirc;le du juge. On n&rsquo;a rien inscrit de plus qui n&rsquo;&eacute;tait pas inscrit dans la loi, sauf le contr&ocirc;le des sites p&eacute;dopornographiques &raquo;</em> temp&egrave;re-t-on. Des passages relatifs aux quotas, au filtrage des ports, au contr&ocirc;le a priori &agrave; l&rsquo;entr&eacute;e des espaces pour mineurs (qui ne concernerait finalement que les solutions de contr&ocirc;le parental), la suppression des contenus passifs au bout de 3 mois, etc. ne sont pourtant pas de base l&eacute;gale imp&eacute;rative. Autre probl&egrave;me, le texte en question ignore superbement le statut particulier des h&eacute;bergeurs, qui est pourtant encadr&eacute; par la loi sur la confiance dans l&rsquo;&eacute;conomie num&eacute;rique. Dans ce grand bouillon d&rsquo;engagements, on a surtout l&rsquo;impression que le parapluie de la <span class="caps">LCEN</span> reste aux vestiaires.</p>
	</blockquote>


	<p>En outre, je pense que deux aspects posent probl&egrave;me, comme <a href="http://standblog.org/blog/post/2008/06/06/Le-gouvernement-voudrait-un-filtrage-massif-des-reseaux#c6479">je l&rsquo;exprimais</a> sur <a href="http://standblog.org/blog/">le blog de Tristant Nitot</a> (pdg de Mozilla Europe) :</p>


	<blockquote>
		<p>    Beaucoup de ces mesures sont inapplicables techniquement par les <span class="caps">FAI</span> en plus d&rsquo;&ecirc;tre les germes d&rsquo;un projet de prison num&eacute;rique.<br /><br />
   Je n&rsquo;arrive toujours pas &agrave; comprendre d&rsquo;autre part comment une l&eacute;gislation franco-fran&ccedil;aise peut fonctionner sur ce genre de sujets. Les probl&egrave;mes sont trait&eacute;s d&rsquo;un mauvais point de vue, par des gens qui ne comprennent pas les tenants et aboutissants de ces probl&egrave;mes, et qui vont juste accro&icirc;tre la tension juridique sans r&eacute;el effet.<br /><br />
   Au final, je pense qu&rsquo;ils vont seulement inciter les gens &agrave; se faire h&eacute;berger ailleurs, &agrave; utiliser des modes de connexion s&eacute;curis&eacute;s, &agrave; contourner les filtres de leur <span class="caps">FAI</span>, &agrave; utiliser des proxies publics, etc. Et les gens qui seront p&eacute;nalis&eacute;s par ce genre de mesure seront les petits noobs inoffensifs, quand internet aurait besoin d&rsquo;une politique/l&eacute;gislation internationale et de mesures plus structurelles et efficaces.<br /><br />
    On n&rsquo;est pas arriv&eacute;s&hellip;</p>
	</blockquote>


	<p>Et c&rsquo;est vrai qu&rsquo;on n&rsquo;est pas arriv&eacute;s&hellip;</p>