---
title: "Introduction aux expressions régulières"
---

<h1>Introduction aux expressions régulières</h1><p>Les expressions r&eacute;guli&egrave;res (ou regex) permettent de v&eacute;rifier qu&rsquo;une chaine est conforme &agrave; un masque (ou pattern).<br />
Cet outil permet des reconnaissances ou substitutions complexes. Les regex sont impl&eacute;ment&eacute;es dans la plupart des langages de programmation : sachant cela, lorsque vous apprendrez un nouveau langage, vous n&rsquo;aurez pas &agrave; r&eacute;-apprendre compl&egrave;tement vos notions sur les expressions r&eacute;guli&egrave;res, m&ecirc;me si quelques l&eacute;g&egrave;res diff&eacute;rences peuvent survenir.</p>
<p>Les expressions r&eacute;guli&egrave;res (ou regex) permettent de v&eacute;rifier qu&rsquo;une chaine est conforme &agrave; un masque (ou pattern).</p>


	<p>Cet outil permet des reconnaissances ou substitutions complexes.<br />
Les regex sont impl&eacute;ment&eacute;es dans la plupart des langages de programmation :<br />
sachant cela, lorsque vous apprendrez un nouveau langage, vous n&rsquo;aurez pas &agrave; r&eacute;-apprendre<br />
compl&egrave;tement vos notions sur les expressions r&eacute;guli&egrave;res, m&ecirc;me si quelques l&eacute;g&egrave;res diff&eacute;rences peuvent survenir.</p>


	<p>Les patterns sont constitu&eacute;s de caract&egrave;res &ldquo;normaux&rdquo; et de m&eacute;tacaract&egrave;res.</p>


	<p>Un m&eacute;tacaract&egrave;re est un caract&egrave;re ayant une signification particuli&egrave;re (des signes de ponctuation en g&eacute;n&eacute;ral).</p>


	<p>Il n&rsquo;est pas mis dans le masque &ldquo;pour lui m&ecirc;me&rdquo;.</p>


	<p>Les lettres et chiffres ne sont pas des m&eacute;tacaract&egrave;res : ils sont mis pour eux m&ecirc;mes : lorsqu&rsquo;un masque contient &ldquo;A&rdquo;, le moteur de regex cherchera bien un A majuscule dans la chaine test&eacute;e.</p>


	<p><code>{n,}</code> : &ldquo;n fois ou plus&rdquo; </p>

	<p>ex : <code>/AB{3,}C/</code> reconnait A suivi de 3 B ou plus, puis un C.</p>


	<p><code>{n,m}</code> : &ldquo;entre n et m fois&rdquo; </p>

	<p>ex : <code>/AB{3,5}C/</code> reconnait A suivi de 3 &agrave; 5 B puis C.</p>


	<p>Remarque : <code>?,*,+</code> peuvent &ecirc;tre exprim&eacute;s par un &eacute;quivalent entre accollades.</p>


	<p><h3><span class="caps">METACARACTERES DE POSITION</span></h3></p>

	<p><code>^</code> : &ldquo;D&eacute;but de chaine&rdquo; (si positionn&eacute; en d&eacute;but de masque)</p>

	<p>Comme vous l&rsquo;aurez remarqu&eacute;, par d&eacute;faut une recherche de regex regarde si la chaine test&eacute;e <span class="caps">CONTIENT</span> une sous chaine v&eacute;rifiant le masque.</p>


	<p>^ permet de changer ca : <code>/^ABC/</code> reconnaitra une chaine qui <span class="caps">COMMENCE</span> par <span class="caps">ABC</span> : &ldquo;ABCDE&rdquo; est reconnu, pas &ldquo;AZABCDE&rdquo;</p>


	<p><code>$</code> : &ldquo;Fin de chaine&rdquo; (si positionn&eacute; en fin de chaine)</p>

	<p><code>/^ABC$/</code> permet donc de reconnaitre une chaine qui est <span class="caps">EXACTEMENT</span> &ldquo;ABC&rdquo; ;-)</p>

	<p><h3><span class="caps">METACARACTERES DE GROUPEMENT</span></h3></p>

	<p>Les parenth&egrave;ses servent &agrave; regrouper plusieurs &ldquo;briques&rdquo; de regex.</p>


	<p>Ex : on souhaite reconnaitre &ldquo;ab&rdquo; un nombre ind&eacute;fini de fois, suivi d&rsquo;un &ldquo;c&rdquo;.</p>


	<p>On utilisera le masque : <code>/(ab)*c/</code></p>


	<p>Les parenth&egrave;ses servent &eacute;galement pour l&rsquo;alternative : le &rdquo;|&rdquo; signifie &ldquo;OU&rdquo;.<br />
ex : on veut reconnaitre : &ldquo;ab&rdquo; ou &ldquo;bc&rdquo; suivi d&rsquo;un &ldquo;d&rdquo; <br />
Le pattern sera : <code>/(ab|bc)d/</code></p>


	<p>Les parenth&egrave;ses ont une troisi&egrave;me fonction, la capture, que je ne d&eacute;velopperai pas ici : grosso modo, tout ce qui est entre des parenth&egrave;ses peut &ecirc;tre r&eacute;utilis&eacute; plus loin dans la regex (backref), ou dans un remplacement, ou simplement retrouv&eacute; apr&egrave;s un &ldquo;if&rdquo; par exemple.</p>


	<p><h3><span class="caps">METACARACTERES DE CLASSE</span></h3><br />
Une classe est un ensemble de caract&egrave;res, elle est d&eacute;finie entre crochets.<br />
ex : un ensemble contentant a,b,e,g, et z : <code>[abegz]</code></p>

	<p>A la diff&eacute;rence des parenth&egrave;ses, une classe ne reconnaitra qu&rsquo;un seul caract&egrave;re au maximum.<br />
Seconde diff&eacute;rence, une classe peut &ecirc;tre &ldquo;compl&eacute;ment&eacute;e&rdquo;, en la commencant par un ^ :<br />
ex : reconnaitre &ldquo;tout caract&egrave;re diff&eacute;rent d&rsquo;un z&rdquo; : <code>[^z]</code></p>


	<p>Utile dans les classes, la r&eacute;union : le tiret &rdquo;-&rdquo; permet de raccourcir des classes qu&rsquo;on utilise fr&eacute;quemment.<br />
Pour reconnaitre une lettre minuscule, on utiliserait a priori :<br />
<code>[abcdefghijklmnopqrstuvwxyz]</code><br />
C&rsquo;est lourd, on pr&eacute;f&egrave;rera la notation : <code>[a-z]</code><br />
Marchent &eacute;galement : <code>[A-Z], [0-9], [a-zA-Z]</code> (contient toutes les lettres), <code>[a-ft-z]</code>, etc..</p>


	<p>Le tiret est donc un m&eacute;tacaract&egrave;re lorsqu&rsquo;il est utilis&eacute; dans une classe. _ Pour mettre un tiret dans une classe, on le mettra simplement sur le bord : <code>[a-z-]</code> contient les lettres de a &agrave; z ainsi qu&rsquo;un tiret.</p>


	<p>/ !\ M&eacute;ditez ceci :<br />
<code>if (preg_match("/[^a-z]/",$string)) ... </code><br />
Cette condition v&eacute;rifie que $string contient un caract&egrave;re qui n&rsquo;est pas une lettre minuscule.<br />
Cette condition <strong><span class="caps">NE DIT PAS</span></strong> : v&eacute;rifie que $string ne contient pas de lettre minuscule.</p>


	<p><h3><span class="caps">METACARACTERE</span> \</h3><br />
Il a 3 fonctions :</p>

	<p>1- &eacute;chappement<br />
Un <code>+</code> signifie &ldquo;1 fois ou plus&rdquo;, d&rsquo;accord, mais comment reconnaitre un plus &ldquo;<code>+</code>&rdquo; ? Il suffit de mettre <code>\+</code> (de la m&ecirc;me facon qu&rsquo;on &eacute;chappe les guillemets dans des chaines php ou perl)<br />
Le backslash est donc lui m&ecirc;me un m&eacute;tacaract&egrave;re.<br />
Voici une liste des m&eacute;tacaract&egrave;res qu&rsquo;on peut ainsi &eacute;chapper : <code>^ $ * + ? . | ( ) [ ] \</code><br />
Il permet aussi d&rsquo;&eacute;chapper le caract&egrave;re utilis&eacute; comme d&eacute;limiteur histoire d&rsquo;&eacute;viter les confusions : j&rsquo;ai utilis&eacute; des slashes, on peut utiliser d&rsquo;autres chars : voici les courants : ==<img src="masque" alt="" />, #masque#, /masque/.</p>


	<p>2- devant des lettres, pour une signification particuli&egrave;re<br />
<code>&lt;strong&gt;\s&lt;/strong&gt;</code> : un espace blanc, \t, \r, \n, \f<br />
<code>&lt;strong&gt;\S&lt;/strong&gt;</code> : pas un espace<br />
<code>&lt;strong&gt;\d&lt;/strong&gt;</code> : un chiffre (&eacute;quivalent &agrave; [0-9])<br />
<code>&lt;strong&gt;\D&lt;/strong&gt;</code> : pas un chiffre<br />
<code>&lt;strong&gt;\w&lt;/strong&gt;</code> : un mot (&eacute;quivalent &agrave; [a-zA-Z_])<br />
<code>&lt;strong&gt;\W&lt;/strong&gt;</code> : pas un mot<br />
Moultes autres selon les langages, ceux ci sont les plus utilis&eacute;s.</p>


	<p>3- r&eacute;f&eacute;rences arri&egrave;re<br />
Point tr&egrave;s int&eacute;ressant, non trait&eacute; ici car trop compliqu&eacute; pour une premi&egrave;re approche.</p>


	<p><h3><span class="caps">LIENS UTILES</span></h3><br />
perldoc.perl.org/perlre.html : la doc de r&eacute;f&eacute;rence des regex en Perl (qui impl&eacute;mente les regex au coeur du langage)<br />
www.pcre.org : le site officiel de la lib pcre (qui &eacute;quipe pas mal de langages)<br />
www.expreg.com : site francais tr&egrave;s bien fait sur les regexp<br />
www.scriptsdb.org/tutar.php ?id=1 : tuto sur les regex en mIRC (celui par lequel j&rsquo;ai commenc&eacute;)</p>

	<p><h3><span class="caps">SUJETS LAISSES A UNE PROPA ULTERIEURE</span></h3><br />
op&eacute;rateurs non gourmands<br />
- utilisation des backref et des captures<br />
- assertions positives et n&eacute;gatives<br />
- optimisations de regex, conditions<br />
- support unicode (valide en php ? php 5.1 ?)<br />
- m&eacute;tacaract&egrave;res non cit&eacute;s<br />
- interpolations de variables, &eacute;chappements<br />
- classes <span class="caps">POSIX</span><br />
- vue des modificateurs et modes de reconnaissance<br />
- &eacute;quivalence de fonctions php ou Perl standard (voir http://www.expreg.com/equivalence.php)<br />
- UrlRewriting<br />
- ...<br />
<h3><span class="caps">CONCLUSION</span></h3><br />
Attention cependant : le travers naturel quand on commence &agrave; bien maitriser cet outil, c&rsquo;est de faire pas mal de choses avec qu&rsquo;on aurait fait sans sinon.<br />
Ce qui peut devenir ennuyeux pour des probl&egrave;mes d&rsquo;optimisation ;-)<br />
Durant votre progession, l&rsquo;important est de faire des tests, d&rsquo;apprendre par la pratique et l&rsquo;observation : les moteurs de regex ont un fonctionnement complexe : au del&agrave; d&rsquo;un certain niveau, on peut trouver des &ldquo;bugs&rdquo; donc testez vos masques !</p>