---
title: "Hey !"
---

<h1>Hey !</h1><p>Je pars un week-end, 2 jours, 48h, et plein de trucs s&rsquo;accumulent ici sans que je puisse les travailler. Alors allons-y !</p>


	<ul>
	<li>Je pense &agrave; abandonner <a href="http://mephistoblog.com/">Mephisto</a> pour <a href="http://www.dotclear.net/">Dotclear</a> : j&rsquo;avais essay&eacute; Dotclear en v1, pas convaincu, moche, mais en v2 la partie admin est &eacute;-pou-stou-fflante&hellip; En plus on peut g&eacute;rer plusieurs blogs. Bon c&rsquo;est en <span class="caps">PHP</span>, &ccedil;a garantit quelques boutons, mais bon. Les filles, des int&eacute;ress&eacute;es ?</li>
		<li>Bourdais s&rsquo;est <a href="http://www.lequipe.fr/Formule1/breves2008/20080928_175220_bourdais-a-souffert_Dev.html">un peu rat&eacute;</a> &agrave; Singapour. Dommage, il a un potentiel &eacute;norme, mais je doute qu&rsquo;il retrouve un volant la saison prochaine, m&ecirc;me si Toro-Rosso va avoir du mal &agrave; changer deux pilotes d&rsquo;un coup.</li>
		<li>Pas de vainqueur dans le d&eacute;bat Obama-McCain. J&rsquo;en reste &agrave; penser que <em>c&rsquo;est ceux qui en parlent le moins qui en mangent le plus</em>. Parle John, parle :-)</li>
		<li>Ohohoh ! C&rsquo;est maintenant <a href="http://www.sexactu.com/2008/09/26/pourquoi-lamour-rend-aveugle/">scien-ti-fique</a> : <strong><em>&ldquo;Des chercheurs ont montr&eacute; que l&rsquo;amour rend insensible &agrave; la beaut&eacute; des autres femmes.&rdquo;</em></strong> J&rsquo;adh&egrave;re, j&rsquo;en connais un qui n&rsquo;en voit plus qu&rsquo;une.</li>
		<li>S&eacute;go a chang&eacute; de coupe, elle s&rsquo;est enfonc&eacute;e dans la superficialit&eacute; et l&rsquo;&eacute;loquence creuse. Donc, <a href="http://www.koztoujours.fr/?p=1473">plussoyons fort</a> !</li>
		<li>Je trouve S&eacute;go stupide. Martine <a href="http://penseespolitiques.over-blog.com/article-23193732.html">semble stupide</a> aussi, en plus du boulet des 35 heures qu&rsquo;elle traine chez tous les gens qui ont plus de 90 de QI et qui s&rsquo;int&eacute;ressent &agrave; la comp&eacute;titivit&eacute; de la France dans le monde. Il semble que Bertrand ne soit pas bien plus qu&rsquo;un gentil gouverneur local non plus. Mais bordel, tuez-les tous, ressucitez Miterrand, faites quelque chose !</li>
		<li><a href="http://blog.gonzaguedambricourt.com/2008/09/28/alors-en-fait-jvoudrais/">+1</a>, les fondus d&rsquo;&eacute;cran je m&rsquo;en batte, surtout quand &ccedil;a ralentit tout, mais des vrais minuscules fonctionnalit&eacute;s simples &agrave; impl&eacute;menter ce serait pas de trop.</li>
		<li>De nouveaux boxer, une nouvelle chemise qui d&eacute;chire, plein de souvenirs et de photos, bref, la banane :-)</li>
	</ul>
