---
title: "Fast mais pas Furious"
---

<h1>Fast mais pas Furious</h1><p>Aujourd&rsquo;hui est &agrave; marquer d&rsquo;une pierre blanche, je suis &eacute;puis&eacute; tellement j&rsquo;ai fait des choses utiles :</p>
<ul>
	<li>arr&ecirc;ter de respirer pendant 2h ce matin tant un des intervenants puait : <em>Prenez un chewing gum Emile&hellip; Et prenez donc un peu d&rsquo;Air Wick aussi</em></li>
	<li>perdre patience devant les gens qui ont mis 6 mois &agrave; choisir une soluce technique, et qui changent encore alors que tout est command&eacute; et sur le point d&rsquo;arriver : <em>Des frites avec ton Coca ? &rsquo;bruti&hellip;</em></li>
	<li>aller me faire rembarrer &agrave; McDo pour la 4e fois : <em>&agrave; la 5 on saute ?</em></li>
	<li>modifier l&rsquo;en-t&ecirc;te de mon blog ci-dessus : <em>Ahahahahahahahahah</em></li>
	<li>me la jouer  <a href="http://www.joelamouk.com/LES-VIDEOS/ta-gueule/ta-gueule.html">Joe La Mouk</a> avec quelqu&rsquo;un qui croit que je suis son pote d&rsquo;aventure : <em>Tu sais, Gilles, cui qui fait tout l&rsquo;temps du foot&hellip; Alors et la moutarde au chocolat c&rsquo;est encore pire&hellip; <span class="caps">MAIS</span> TA <span class="caps">GUEULE</span> !!!!</em></li>
	<li>regarder mon interface de gestion des temps pour me rendre compte qu&rsquo;en un week-end je suis pass&eacute; de &ldquo;-1h40&rdquo; &agrave; &ldquo;-10h03&rdquo; : <em>super, j&rsquo;aimais d&eacute;j&agrave; me faire endormir mes heures sup&rsquo;, maintenant ils se d&eacute;brouillent m&ecirc;me pour que je sois &agrave; d&eacute;couvert d&rsquo;heures de boulot&hellip;</em></li>
	<li>regarder l&rsquo;&eacute;tat de mes comptes sur Internet : <em>ah mince le virement de 1000 euros est pas encore arriv&eacute;. Je clique sur [D&eacute;tails]. Ah si. Oh merde.</em></li>
	<li>envoyer un petit mail &agrave; une inconnue pour lui demander comment m&rsquo;&eacute;vader de mon boulot d&rsquo;ici environ 1 an : <em>Salut Germaine, je veux un avion avec le plein d&rsquo;essence, des faux papiers, et une perruque, et plus vite que &ccedil;a !!</em></li>
	<li>perdre la foi devant la montagne de trucs &agrave; faire : <em>&hellip;</em></li>
</ul>
<p>Heureusement j&rsquo;ai eu une petite heure ensoleill&eacute;e dans la journ&eacute;e, je crois que je vais essayer de surtout retenir &ccedil;a :-)</p>
