---
title: "Y'a des jours..."
---

<h1>Y'a des jours...</h1><p>... qui fatiguent comme une semaine.</p>


	<p><strong>7H</strong> : Tu te l&egrave;ves. Enfin non, ton torticolis te r&eacute;veille. Parce que t&rsquo;as mis 1h &agrave; t&rsquo;endormir la veille et que t&rsquo;as m&ecirc;me pas utilis&eacute; cette heure pour foutre un oreiller sous ton cou.</p>


	<p><strong>8H20</strong> : Tu arrives au boulot. L&agrave; tu popes tes mails, normal. Et chlang, tu consultes une boite laiss&eacute;e de c&ocirc;t&eacute; depuis 15 jours, et tu te souviens avoir install&eacute; LogWatch sur ton serveur d&eacute;di&eacute;. <em>Pour les non comprenants, LogWatch est un utilitaire sous Linux qui fait des topos quotidiens de ce qui se passe sur un serveur, en gros. Et il peut envoyer ses r&eacute;sultats par mail..</em> Bref, tu d&eacute;couvres que ton serveur d&eacute;di&eacute; est une putin de passoire. Ca attendra.</p>


	<p><strong>10H</strong> : Tu d&eacute;couvres que ta base Oracle Express marchera pas en 64 bits sans bidouille. Qu&rsquo;&agrave; cela ne tienne, demandons au <span class="caps">DBA</span> du coin de monter une vraie base sur un vrai serveur.</p>


	<p><strong>14H</strong> : Apr&egrave;s un petit caf&eacute;, tu passes 2h avec le <span class="caps">DBA</span> en question &agrave; installer un client Oracle, mais ces escrocs ont des <span class="caps">RPM</span> si bien foutus que rien ne fonctionne. L&rsquo;alternative &eacute;tant d&rsquo;installer un client non packag&eacute; et de bidouiller &agrave; peu pr&egrave;s 12 conf en m&ecirc;me temps en esp&eacute;rant tomber sur ce qu&rsquo;il faut. Derri&egrave;re ton &eacute;paule une semi-DBA piaille que c&rsquo;est super normal d&rsquo;installer les 3/4 du serveur c&ocirc;t&eacute; client pour que &ccedil;a marche. Youpi.</p>


	<p><strong>16H</strong> : Un imb&eacute;cile vient te voir et te fout la pression pour que t&rsquo;installes sa daube sur un de tes serveurs. J&rsquo;insiste, un de <strong>tes</strong> serveurs. Les bugs remont&eacute;s quelques mois plus t&ocirc;t ont d&ucirc; se corriger par magie, il te le garantit, puisque sans modification de config ni nouvelle installation <em>&ccedil;a ne se reproduira plus, nononon, croix de bois, croix de fer !</em></p>


	<p><strong>16H10</strong> : Enerv&eacute; mais s&ucirc;r de tes bases, tu te dis que c&rsquo;est pas parce que c&rsquo;est un gros con incomp&eacute;tent que tu dois &ecirc;tre pareil. Tu d&eacute;cides donc d&rsquo;installer son appli, mais comme t&rsquo;es &eacute;nerv&eacute;, tu t&rsquo;y reprends &agrave; 3 fois et tu mets 2h &agrave; te rendre compte que t&rsquo;&eacute;tais m&ecirc;me pas sur la bonne version de Tomcat. Tu &eacute;vacues de toutes tes forces l&rsquo;id&eacute;e selon laquelle c&rsquo;est toi le gros con, puisque de toute fa&ccedil;on, t&rsquo;as pas la doc d&rsquo;install, alors autant pas la ramener, ce serait pour ta pomme.</p>


	<p><strong>16H30</strong> : Au passage, un coup de reload sur un reverse proxy te fait tomber toute les applis pendant 10 minutes sans pr&eacute;venir. Tu te dis que Nagios devrait te t&eacute;l&eacute;phoner direct dans ce genre de cas. Mais tu te rappelles que Nagios n&rsquo;est jamais qu&rsquo;un soft d&eacute;bile &eacute;crit en C++ et en Perl, donc il risque pas d&rsquo;&ecirc;tre user-friendly &agrave; ce point. Et que tu serais bien incapable de le modifier pour faire &ccedil;a. Et t&rsquo;as pas les serveurs qu&rsquo;il faut. Et t&rsquo;as pas le temps de toute fa&ccedil;on. Bref, <em>mets-toi une tarte direct quoi&copy;</em>.</p>


	<p><strong>17H</strong> : Un grand brun sort du bureau de ta chef, et l&agrave;, tu sais qu&rsquo;elle va plier : le bipro quadcore avec 33Go de <span class="caps">RAM</span> qu&rsquo;on a achet&eacute; sur la fin de l&rsquo;ann&eacute;e finira en Windows Server. A ce niveau de g&acirc;chis, autant le p&eacute;ter toi m&ecirc;me &agrave; mains nues et t&rsquo;immoler par le feu ensuite.</p>


	<p><strong>20H</strong> : Tu d&eacute;cides que t&rsquo;es pas assez pay&eacute; pour rester seul dans l&rsquo;immeuble &agrave; des heures pareilles, &agrave; essayer de faire marcher des merdes en <span class="caps">J2EE</span>/Java alors que le gars sus-cit&eacute; s&rsquo;est s&ucirc;rement barr&eacute; depuis 16h. A cette occasion tu te rappelles qu&rsquo;en parlant de paye, la tienne n&rsquo;a m&ecirc;me pas suivi l&rsquo;inflation cette ann&eacute;e.</p>


	<p><strong>20H30</strong> : Apr&egrave;s avoir attendu un bus qui ne d&eacute;cidera de passer que 30s apr&egrave;s que t&rsquo;aies quitt&eacute; l&rsquo;arr&ecirc;t en d&eacute;sespoir de cause, tu arrives &agrave; <del><span class="caps">ATAC</span></del> Simply Market. Tu t&rsquo;ach&egrave;tes deux trois trucs, de quoi te remonter le moral (des schokobons par exemple), et t&rsquo;arrives &agrave; la caisse, y&rsquo;a qu&rsquo;un pauvre type avec un sandwich devant toi, nickel. Mais le sort a d&eacute;cid&eacute; de s&rsquo;acharner sur ta mouille, et la connasse qui &eacute;tait en train de payer va mettre 10 minutes &agrave; avoir toutes les infos qu&rsquo;elle veut sur sa carte de fid&eacute;lit&eacute;. Apr&egrave;s quoi la caissi&egrave;re lui dira <em>Madame, vous avez 4&euro;35 sur votre cagnotte, je fais quoi ?</em>. Ce &agrave; quoi elle mettra une bonne minute &agrave; d&eacute;cider qu&rsquo;elle dilapide le magot sur ce caddie l&agrave;. Certains feraient vraiment mieux de mourir.</p>


	<p><strong>21H</strong> : Rentr&eacute; chez toi, t&rsquo;allumes <span class="caps">LCP</span>, une chaine s&eacute;rieuse, une chaine publique comme on n&rsquo;en fait que dans ton beau pays, tout &ccedil;a pour voir un d&eacute;put&eacute; communiste alterner les <em>On vous avait pr&eacute;venus</em> et les inepties factuelles pour compenser son incomp&eacute;tence et la fragilit&eacute; de son argumentaire. Autant dire que t&rsquo;&eacute;teins vite la TV, merci le service public sans pub.</p>


	<p><strong>22H20</strong>[new] : Ta copine t&rsquo;appelle, un goa&rsquo;uld est en train de lui pousser dans le cou.</p>


	<p>&mdash;</p>


	<p><em>Et curieusement, c&rsquo;&eacute;tait m&ecirc;me pas une journ&eacute;e de merde. Il faisait bon en allant au boulot. J&rsquo;ai command&eacute; plein de cadeaux au P&egrave;re No&euml;l ce matin. J&rsquo;ai discut&eacute; Rails avec un coll&egrave;gue (pour pas dire un gourou), et j&rsquo;ai appris 50 trucs en dix minutes. Et j&rsquo;ai eu une jeune fille charmante dans mes pens&eacute;es toute la journ&eacute;e.</em></p>
