---
title: "Post hoc, ergo propter hoc"
---

<h1>Post hoc, ergo propter hoc</h1><p>Suite &agrave; des rencontres r&eacute;centes (bien camoufl&eacute; JP, nickel), et non obligatoirement &agrave; cause d&rsquo;elles, ne nous &eacute;garons pas, <em>cf</em> le titre de cet article, mon esprit a emprunt&eacute; des chemins tortueux. Mes tracasseries quotidiennes bassement utilitaires ou professionnelles sont pass&eacute;es au second plan, joyeusement &eacute;clips&eacute;es par de vrais probl&egrave;mes, existenciels, impossibles &agrave; trancher de mani&egrave;re &eacute;vidente, du genre : <em>quelle chemise vais-je donc bien pouvoir porter ce soir afin d&rsquo;&ecirc;tre la plus belle pour aller danser ?</em> ou <em>Comment donner un double sens &agrave; mon texto tout en &eacute;tant dr&ocirc;le sans &ecirc;tre lourd, spirituel mais pas chiant, craquant mais pas flamby ?</em> Tout un programme. Et Dieu (ou Ra&euml;l on s&rsquo;en fout) sait que je pourrais rapidement partir dans des exc&egrave;s de verbe, expliquer pourquoi mes pieds n&rsquo;ont plus touch&eacute; le sol par moment, mais ce serait inconvenant dans une tribune libre mais s&eacute;rieuse telle que ce blog. Je n&rsquo;en &eacute;crirai donc rien, mais n&rsquo;en penserai pas moins.</p>


	<p>Bon un peu. Je suis profond&eacute;ment, visc&eacute;ralement heureux. Je m&rsquo;&eacute;tais enferm&eacute; dans une situation que je laissais lachement mourir, et tout d&rsquo;un coup je vis un remake du d&eacute;but de Vanilla Sky. Ni plus ni moins, tant que cette <del>salope</del> <del>connasse</del> fieff&eacute;e jalouse de Julie Gianni ne vient pas me d&eacute;figurer en m&rsquo;envoyant dans un mur, je touche du bois et j&rsquo;en profite(rai), au feeling, sans me prendre la t&ecirc;te. Et puis vive la Pattardise (d&eacute;finition plus bas).</p>


	<p>Bref, je m&rsquo;&eacute;loigne du sujet. Tout &ccedil;a pour dire qu&rsquo;au milieu de ces instants de bonheur b&eacute;at mais lucide, mon esprit s&rsquo;est lach&eacute; et je cherche depuis un moment ce que je touche d&eacute;licieusement du doigt par moment. Bien s&ucirc;r, ami lecteur, si ton faible QI t&rsquo;emp&ecirc;che de comprendre que je ne cherche pas dans ces lignes &agrave; faire l&rsquo;apologie des troubles psychiatriques, tu peux t&rsquo;arr&ecirc;ter l&agrave;. Mais j&rsquo;ai promis &agrave; Sabine Brigite Marie-Antoinette d&rsquo;arr&ecirc;ter de dire b&ecirc;tement que j&rsquo;&eacute;tais mono-maniaque et cyclotimique et de rechercher un peu ce qui se cache derri&egrave;re ces termes.</p>


	<p>Un <strong>schizophr&egrave;ne</strong> par exemple, souffre d&rsquo;<em>alt&eacute;rations de la perception de la r&eacute;alit&eacute; (d&eacute;lire), des troubles cognitifs, et des dysfonctionnements sociaux et comportementaux plus ou moins importants</em> (<a href="http://fr.wikipedia.org/wiki/Schizophr%C3%A9nie">wikipedia</a>). Pas mal Joe, peut mieux faire.</p>


	<p>Une personne <strong>cyclothymique</strong> (ce qui prouve d&eacute;j&agrave; que je suis mauvais en orthographe), est parfois d&rsquo;une humeur <em>chaude et mobile</em>, mais <em>passe facilement de la tristesse &agrave; la gaiet&eacute;, de la joie &agrave; la douleur</em> (<a href="http://fr.wikipedia.org/wiki/Cyclothymie">wikipedia</a>). Ce serait un tout ptit peu exag&eacute;r&eacute; Joe, je suis rarement triste par les temps qui courent, et si je devais l&rsquo;&ecirc;tre, j&rsquo;ai de quoi me soigner rapidement. La suite.</p>


	<p>La <strong>monomanie</strong> me plait nettement plus, mais &ccedil;a tient certainement &agrave; la tournure imag&eacute;e de la d&eacute;finition : <em>Sorte de trouble mental dans lequel une seule id&eacute;e semble absorber toutes les facult&eacute;s de l&rsquo;intelligence</em> (<a href="http://fr.wiktionary.org/wiki/monomanie">wiktionnary</a>). &ldquo;Absorber toutes les facult&eacute;s de l&rsquo;intelligence&rdquo; :-) Ca, on garde. Mon QI et/ou mon image de mec intelligent vont descendre en fl&egrave;che, esp&eacute;rons que j&rsquo;ai un peu de marge et que je ne m&rsquo;&eacute;crase pas en bas.</p>


	<p>L&rsquo;<strong>ac&eacute;die</strong> ne me <a href="http://fr.wikipedia.org/wiki/Ac%C3%A9die">correspond absolument pas</a>, mais vous pouvez aller voir, &ccedil;a r&eacute;sonne, h&eacute;las. Je pense un peu &agrave; toi tout de m&ecirc;me&hellip;</p>


	<p>La <strong>lubie</strong> <em>se manifeste par un enthousiasme exub&eacute;rant de courte dur&eacute;e pour quelque activit&eacute;, &ecirc;tre ou objet</em> (<a href="http://fr.wikipedia.org/wiki/Lubie">wikipedia</a>). &ldquo;De courte dur&eacute;e&rdquo;. Merde et re-merde, je n&rsquo;en sais rien dans l&rsquo;absolu, mais &ccedil;a ne s&rsquo;engage pas du tout comme &ccedil;a dans ma ptite t&ecirc;te.</p>


	<p>Les <strong>troubles bipolaires</strong> comportent en g&eacute;n&eacute;ral une phase maniaque et une phase d&eacute;pressive (<a href="http://fr.wikipedia.org/wiki/Trouble_bipolaire">wikipedia</a>). Ca donne pas envie, on oublie.</p>


	<p>Le reste est trop ax&eacute; sur le malheur, je me refuse &agrave; continuer mes investigations. Il resterait juste la <strong>pattardise</strong>, qui n&rsquo;est pas un trouble psychologique officiel, et c&rsquo;est bien dommage. Cela a donn&eacute; un verbe, <strong>pattardiser</strong>, tr&egrave;s peu usit&eacute; OK, 5-6 personnes &agrave; travers le monde. Pattardiser, c&rsquo;est quand tu es taupin et que tu dis droit dans les yeux &agrave; un prof surdiplom&eacute; devant toi qu&rsquo;il se trompe et que ta d&eacute;monstration est correcte. Autre exemple connu de pattardise connu chez les taupins lyonnais :</p>


	<blockquote>
		<p>Prof&mdash;Ce n&rsquo;est pas comme &ccedil;a que vous irez &agrave; l&rsquo;X !<br />
El&egrave;ve en cours de pattardise&mdash;Pas grave madame, c&rsquo;est tous des cons.<br />
Prof&mdash;Vous n&rsquo;&ecirc;tes pas sans savoir  que mes deux filles sont &agrave; l&rsquo;X&hellip;<br />
El&egrave;ve&mdash;Vous voyez.</p>
	</blockquote>


	<p>C&rsquo;est un exc&egrave;s de confiance en soi, mais vraiment vraiment excessif. J&rsquo;essaye moi-m&ecirc;me de pattardiser ces temps-ci, mais c&rsquo;est un effort &agrave; plein temps. Se r&eacute;p&eacute;ter <em>Apr&egrave;s moi l&rsquo;apocalypse</em> plusieurs fois par jour aide, mais c&rsquo;est une illusion, on ne devient pas un pattard si facilement.</p>


	<p>Si tu as l&rsquo;impression que ce billet c&rsquo;est de la merde, tant pis pour toi. Personne t&rsquo;oblige &agrave; lire (sauf si tu fais partie de ceux &agrave; qui je pense).<br />
Et si tu as l&rsquo;impression que c&rsquo;est dans ma t&ecirc;te qu&rsquo;a &eacute;t&eacute; tourn&eacute; <a href="http://www.imdb.com/title/tt0209958/">The Cell</a>, t&rsquo;as ptet pas tord. N&rsquo;aie pas peur, je suis un mec ordinaire (ou pas).</p>
