---
title: "Journalisme à la con (5)"
---

<h1>Journalisme à la con (5)</h1><p><a href="http://www.liberation.fr/interactif/chats_home/chats/schneidermann/339163.FR.php">Allez rire</a></p>


	<p>Le pire c&rsquo;est que tu temps d&rsquo;Arr&ecirc;t sur Images sur la 5, j&rsquo;estimais ce monsieur. Mais l&agrave;, je trouve cette interview affligeante sur les 2/3 de sa longueur. Merci soeurette de me l&rsquo;avoir montr&eacute;e, &ccedil;a r&eacute;veille de lire des raccourcis intellectuels de ce genre, &ccedil;a tire &agrave; la malhonn&ecirc;tet&eacute; intellectuelle ou &agrave; l&rsquo;incomp&eacute;tence. La France avance&hellip;</p>


	<p>Morceaux choisis.</p>
<blockquote>
		<p>Ce que nous avons r&eacute;v&eacute;l&eacute; sur le site d&rsquo;Arr&ecirc;t sur images, c&rsquo;est que cette information avait bien &eacute;t&eacute; donn&eacute;e au cours d&rsquo;un d&eacute;jeuner avec nos deux confr&egrave;res, par Claude Gu&eacute;ant, secr&eacute;taire g&eacute;n&eacute;ral de l&rsquo;Elys&eacute;e. La pr&eacute;cision, &agrave; mes yeux, est importante. Cela veut dire que c&rsquo;est l&rsquo;Elys&eacute;e qui communique directement sur cette enqu&ecirc;te polici&egrave;re. Si cette piste devait se d&eacute;gonfler, l&rsquo;Elys&eacute;e porterait donc la responsabilit&eacute; directe d&rsquo;avoir manipul&eacute; la presse.</p>
	</blockquote>


	<p>Merveilleux. Effa&ccedil;ons vite ces stupides diff&eacute;rences entre personne, fonction, et institution, elles nuisent &agrave; la compr&eacute;hension des <del>moutons</del> citoyens.</p>


	<blockquote>
		<p>Or, en lisant de pr&egrave;s la transcription des propos qui a &eacute;t&eacute; faite par Le Monde, on reconna&icirc;t facilement le style oral rel&acirc;ch&eacute; qui caract&eacute;rise Nicolas Sarkozy. Donc, c&rsquo;est bien Sarkozy lui-m&ecirc;me qui, selon ce que dit implicitement Le Monde, d&eacute;livre ces r&eacute;v&eacute;lations importantes.</p>
	</blockquote>


	<p>Ah &ccedil;a c&rsquo;est du journalisme, du grand, du beau, de la d&eacute;duction qui laisse sur le cul, du genre qu&rsquo;on met plusieurs ann&eacute;es d&rsquo;&eacute;tudes &agrave; sortir. L&rsquo;Elys&eacute;e dispose d&rsquo;un bon millier de fonctionnaires, mais non, on lit 3 bouts de phrase, on fait une analyse de style, et hop, c&rsquo;est peut-&ecirc;tre Sarko, son style, oui non&hellip; Un coup de ponctuation&hellip; Suspense&hellip; Ah bah oui, la phrase d&rsquo;apr&egrave;s, c&rsquo;est s&ucirc;r ! Le couperet est tomb&eacute;, c&rsquo;est <em>bien Sarkozy lui-m&ecirc;me</em>. Epatant. D&rsquo;une rigueur intellectuelle &agrave; vous couper le souffle.</p>


	<blockquote>
		<p>D&rsquo;une mani&egrave;re g&eacute;n&eacute;rale, il me semble que pendant toute cette ann&eacute;e le pouvoir est assez bien parvenu &agrave; essouffler les journalistes. Ils sont peut &ecirc;tre encore plus essouffl&eacute;s que d&rsquo;habitude.</p>
	</blockquote>


	<p>D&rsquo;une mani&egrave;re g&eacute;n&eacute;rale, il me semble que beaucoup de journalistes s&rsquo;essoufflent tous seuls &agrave; ne jamais mettre la moindre information en perspective, &agrave; trier b&ecirc;tement des communiqu&eacute;s de presse et les assembler comme un Lego, &agrave; manquer de culture dans le domaine qu&rsquo;ils investiguent, bref &agrave; jouir d&rsquo;une rente de situation plut&ocirc;t intol&eacute;rable. Ils mettent tout leur orgueil &agrave; remettre en question le pouvoir depuis des d&eacute;cennies, &ccedil;a leur donne de l&rsquo;importance, et bien je suis ravi  que par les temps qui courent ils soient eux aussi remis en question, sur la sellette, bien incapables d&rsquo;arguer d&rsquo;une quelconque atteinte &agrave; leur libert&eacute; d&rsquo;expression quand tout, d&eacute;sormais, m&ecirc;me le pire, est librement diffus&eacute;. Il y a d&rsquo;ailleurs l&agrave; une vraie question que je serais bien incapable de trancher : toute cette m&eacute;diatisation a-t-elle un quelconque int&eacute;r&ecirc;t ? Est-elle b&eacute;n&eacute;fique ? Comment le citoyen peut-il d&eacute;velopper sa r&eacute;flexion avec autant de bruit ambiant sur tout et n&rsquo;importe quoi ?</p>


	<p>Curieusement, certains blogs &agrave; but non lucratif apportent &eacute;norm&eacute;ment de mati&egrave;re, ils nous <a href="http://www.maitre-eolas.fr">apprennent le droit</a>, le fonctionnement de l&rsquo;<a href="http://www.authueil.org/">Assembl&eacute;e</a> et du <a href="http://journaldunassistant.typepad.fr/">S&eacute;nat</a>, nous &eacute;clairent sur les <a href="http://novovision.free.fr/">tracasseries et enjeux des media</a>, parlent de <a href="http://www.versac.net/">politique g&eacute;n&eacute;rale, de communication, des &eacute;lections am&eacute;ricaines</a>. De l&rsquo;autre c&ocirc;t&eacute;, la presse traditionnelle, souvent de qualit&eacute;, est en train de mourir &agrave; cause des nouvelles technologies. Et au milieu, les organes informatiques de ces m&ecirc;mes quotidiens nous abreuvent tous les jours de leur lot d&rsquo;information non v&eacute;rifi&eacute;e, approximative, partielle, bref, sans int&eacute;r&ecirc;t. On en finit par craindre que &ccedil;a d&eacute;teigne sur la presse papier agonisante&hellip;</p>


	<p>Certains parlent d&rsquo;une guerre entre les journalistes et les blogueurs, j&rsquo;avoue que je m&rsquo;en fous compl&egrave;tement. Ce dont je ne me fous pas, en revanche, c&rsquo;est que l&rsquo;on soit toujours dans le registre du sensationnel et que les sites d&rsquo;info ressemblent de plus en plus aux chaines de spam que me transmet parfois ma m&egrave;re. Le sensationnel, l&rsquo;esbrouffe avant tout. On r&eacute;pand des rumeurs, on force les traits, on joue sur les mots, on en galvaude le sens, on passe par dessus les principes, ou parfois, b&ecirc;tement, on se trompe tellement on veut vendre (confondre la ville et la province du Qu&eacute;bec, fallait le faire&hellip;). Dernier exemple en date c&ocirc;t&eacute; informatique (le seul terrain que je pr&eacute;tends maitriser un peu), ce <a href="http://www.lefigaro.fr/medias/2008/07/09/04002-20080709ARTFIG00329-une-grave-faille-de-securite-sur-internet-detectee-a-temps.php">ramassis de conneries</a>.</p>


	<blockquote>
		<p>Je parlais tout &agrave; l&rsquo;heure d&rsquo;essoufflement. Et il me semble que la pression que subissent les journalistes sous cette pr&eacute;sidence-l&agrave; est plut&ocirc;t de cet ordre-l&agrave;. Les pressions-menaces ont toujours exist&eacute;. Elles sont moins fr&eacute;quentes qu&rsquo;on ne l&rsquo;imagine. Les pressions-s&eacute;duction sont elles plus fr&eacute;quentes qu&rsquo;on ne l&rsquo;imagine, au contraire. Elles sont peut-&ecirc;tre plus fr&eacute;quentes sous cette pr&eacute;sidence que sous la pr&eacute;c&eacute;dente. Mais elles &eacute;taient tr&egrave;s vives sous la pr&eacute;sidence Mitterrand. Qu&rsquo;il s&rsquo;agisse de s&eacute;duction intellectuelle ou d&rsquo;osmose politique, Mitterrand tenait aussi beaucoup de journalistes politiques sous sa coupe.<br />Le ph&eacute;nom&egrave;ne nouveau avec Sarkozy, c&rsquo;est vraiment l&rsquo;essoufflement. Pour revenir aux deux affaires pr&eacute;c&eacute;dentes que nous avons abord&eacute;es au d&eacute;but de ce chat, il me semble qu&rsquo;elles marquent une &eacute;volution. Jusqu&rsquo;alors la communication sarkozyenne se faisait dans une transparence affect&eacute;e. Pour la premi&egrave;re fois, on voit Sarkozy, ou l&rsquo;un de ses collaborateurs, demander le off, c&rsquo;est-&agrave;-dire ne pas assumer de donner directement les informations qu&rsquo;il donne. Peut-&ecirc;tre sont-ils en train de revenir &agrave; une forme plus traditionnelle de la communication du pouvoir.</p>
	</blockquote>


	<p>L&agrave; pour le coup, c&rsquo;est mesur&eacute;, construit, on y croit volontiers et il y a une analyse derri&egrave;re, alors je ne vais pas &ecirc;tre de mauvaise foi, je vais lever mon carton &ldquo;10/10&rdquo; de l&rsquo;&eacute;cole des fans, sans toutefois pr&eacute;juger de la v&eacute;racit&eacute; des propos. Histoire de finir sur une note positive.</p>
