---
title: "USA 2008"
---

<h1>USA 2008</h1><p>Obama 1 &ndash; 0 McCain.</p>


	<p>Eh bien ce n&rsquo;est pas une raison pour tomber dans la d&eacute;bilit&eacute; profonde. Cet esp&egrave;ce de b&eacute;at abruti et malhonn&ecirc;te de <span class="caps">BHL</span> a fini hier de me gonfler. L&rsquo;homme a envie de vivre des &ldquo;moments historiques&rdquo;, d&rsquo;inaugurer des &ldquo;premi&egrave;re fois dans l&rsquo;histoire de l&rsquo;humanit&eacute; que&rdquo;, bla bla bla. Et il n&rsquo;est pas le seul. Alors qu&rsquo;on n&rsquo;a pas de recul, qu&rsquo;on ne s&rsquo;est pas document&eacute;, voil&agrave; qu&rsquo;on part s&rsquo;extasier sur les plateaux TV pour crier son amour &agrave; Obama. Non mais s&eacute;rieusement, halte au craquage !</p>


	<p>A aller voir, donc, si le sujet vous int&eacute;resse (le premier surtout, trouv&eacute; via le 2e) :<br />
- <a href="http://xerbias.free.fr/blog/index.php/2008/11/05/351-encore-un-president-americain-blanc">Encore un pr&eacute;sident am&eacute;ricain blanc, chez Xerbias</a> <strong>(must see !)</strong><br />
- <a href="http://penseespolitiques.over-blog.com/article-24437547.html">Vive les blogs sp&eacute;cialistes des Etats-Unis, chez le Chafouin</a><br />
- <a href="http://www.koztoujours.fr/?p=1932">Pourquoi Obama, chez Koz</a></p>


	<p>Les analogies avec l&rsquo;&eacute;lection fran&ccedil;aise sont .. int&eacute;ressantes :-) A l&rsquo;instar de cette cruchasse de S&eacute;go, Palin risque de continuer de dire des conneries un moment. Et <span class="caps">BHL</span> aussi, mais &ccedil;a, personne n&rsquo;y peut rien, les bobos l&rsquo;adorent.</p>


	<p>Bref, f&eacute;licitation Barack tout de m&ecirc;me, on se boit un verre un de ces 4 !</p>


	<p><acronym title="13h39">EDIT</acronym> : qu&rsquo;il soit bien clair tout de m&ecirc;me que je suis ravi qu&rsquo;un d&eacute;mocrate vienne r&eacute;parer les conneries de 8 ann&eacute;es de r&eacute;publicains. Enfin, de Bush. Parce que McCain n&rsquo;est pas un mauvais bougre et il &eacute;tait nettement plus mesur&eacute; et s&eacute;rieux que Georgie. Dans le d&eacute;sordre, l&rsquo;abolition du patriot act, le retour d&rsquo;Irak, l&rsquo;aide aux victimes des subprimes et des catastrophes naturelles, il va y en avoir du boulot. J&rsquo;aurais pr&eacute;f&eacute;r&eacute; Jed Bartlet au pouvoir, mais bon, on n&rsquo;a pas toujours ce qu&rsquo;on veut :-)</p>
