---
title: "Oh Michel si tu voyais ça..."
---

<h1>Oh Michel si tu voyais ça...</h1><p>Au d&eacute;but, l&rsquo;id&eacute;e &eacute;tait &agrave; peu pr&egrave;s la suivante :</p>


	<blockquote>
		<p>J&rsquo;aime tous les succ&egrave;s de Duke Ellington<br />
Tous les standards d&rsquo;Oscar Peterson<br />
De Lionel Hampton<br />
De Scott Hamilton<br />
De Duke Elllngton, d&rsquo;Mahalia Jackson<br />
<em>Michel Jonasz, La boite de Jazz</em></p>
	</blockquote>


	<p>Et puis en fait, &ccedil;a s&rsquo;est transform&eacute; en &ccedil;a :</p>


	<blockquote>
		<p><span class="caps">BARMAN</span> !<br />
2 demi, 1 ice-tea, 1 coca<br />
1 Margarita, 1 vodka-pomme, 1 demi, 1 ricard, 1 pina colada (?)<br />
1 Corona + 1 Shivas gla&ccedil;ons, 1 Tequila Sunrise, 1 Blue Lagoon, 2 sex on the beach<br />
2 demi p&ecirc;che, 1 monaco, 1 cosmo qui n&rsquo;en &eacute;tait pas un, 1 smirnoff qui ressemblait &agrave; de la limonade, <br />
2 monaco, 1 coupe de champagne</p>
	</blockquote>


Plus d&rsquo;alcool et moins de jazz, donc, mais au final j&rsquo;aurais appris plein de choses :
	<ul>
	<li>j&rsquo;ai fait des trucs avec une amie de ma soeur un jour dans le noir et je m&rsquo;en souviens pas (!!),</li>
		<li>l&rsquo;arabe litt&eacute;raire n&rsquo;a que trois temps et je les connais presque par coeur (<em>presque</em>),</li>
		<li>je ressemble &agrave; rien avec une pince &agrave; cheveux sur la t&ecirc;te &agrave; 2h du matin (<em>et ce n&rsquo;est pas moi qui le dis, mais est-ce bien s&eacute;rieux de s&rsquo;enfermer dans des toilettes &agrave; pareille heure avec une jeune fille &eacute;m&ecirc;ch&eacute;e&hellip;</em>),</li>
		<li>certaines seraient ravies que la moiti&eacute; des humains soient des hyppocampes (<em>une sombre histoire d&rsquo;&eacute;quit&eacute; ou de vengeance je sais pas</em>),</li>
		<li>&ldquo;aller sur Internet&rdquo; peut provoquer des crises de fou-rire, ou des <em>sous-rires</em>, d&rsquo;ailleurs,</li>
		<li>une tradition alg&eacute;rienne veut qu&rsquo;on donne un violent coup de t&ecirc;te &agrave; toute bouteille de Corona vide qui se pr&eacute;sente devant vous,</li>
		<li>&agrave; 3h du matin tu peux rentrer dans un bar, aller aux toilettes, ressortir, et personne ne t&rsquo;a vu entrer,</li>
		<li>&agrave; 3h du matin on te donne des roses gratos, apr&egrave;s tu peux les offrir (ou les revendre, au choix, &ccedil;a peut payer le taxi <em>ou pas</em>),</li>
		<li>&agrave; 3h du matin ou &agrave; toute heure, la <span class="caps">RATP</span> vous ment ! Les stations ferment bien la nuit du 21 juin. Grr.</li>
		<li>&agrave; 3h du matin il faut pas se ballader seule vers l&rsquo;hotel de ville les filles, les racailles &ccedil;a &eacute;corche les oreilles et &ccedil;a g&acirc;che quelques secondes la soir&eacute;e (<em>Tuez-les tous. Sauf les Sox. Etc.</em>),</li>
		<li>&agrave; 3h du matin les taxis te parlent de s&eacute;curit&eacute; routi&egrave;re et tu pries chaque minute pour qu&rsquo;un brusque freinage abr&egrave;ge tes souffrances en t&rsquo;encastrant la t&ecirc;te dans l&rsquo;appuie-t&ecirc;te avant</li>
	</ul>


	<p>Il y a vraiment des soir&eacute;es dont on aimerait qu&rsquo;elles durent beaucoup, beaucoup plus longtemps :-)</p>


	<p>Et il y a des mains qu&rsquo;on n&rsquo;a vraiment pas envie de lacher, sans savoir pourquoi. Et &ccedil;a, &ccedil;a va me faire r&eacute;fl&eacute;chir pour les 6 mois &agrave; venir tel que je me connais. <em>Ou pas</em>.</p>