---
title: "Blindage, Carapace, Barrière &amp; Boomerang"
---

<h1>Blindage, Carapace, Barrière &amp; Boomerang</h1><p>Non, ce ne sont pas que des sorts de <a href="http://www.ffworld.com/">Final Fantasy</a>.</p>


	<p class="purple">Je ne deviens pas &eacute;gocentrique j&rsquo;aime juste parler en ce moment. Et on m&rsquo;a encourag&eacute; &agrave; me r&eacute;pandre plut&ocirc;t que tout garder &agrave; l&rsquo;int&eacute;rieur, alors je m&rsquo;ex&eacute;cute, aller se plaindre &agrave; McDo si besoin.</p>


	<p>Je discutais avec ma soeur d&rsquo;un truc tr&egrave;s personnel que je vais un peu d&eacute;velopper ici, comme je l&rsquo;avais fait 21 rue Barrier il y a un petit moment :-) Comme elle le r&eacute;sume : <em>les coups de blinde-toi je trouve &ccedil;a stupidissime et l&acirc;che. Parce que de toute fa&ccedil;on, plus il y a de risques d&rsquo;en crever, de s&rsquo;y bruler les ailes et m&ecirc;me le coeur, plus &ccedil;a vaut la peine</em>. Oui, mais pas que.</p>
<p>Il y a bien s&ucirc;r le risque qui rend plus vivant, mais &ccedil;a, on s&rsquo;en serait dout&eacute; vu le r&eacute;sum&eacute;. Ca doit tenir de Jonathan et Jennifer Hart historiquement, quelqu&rsquo;un confirme ? Bref, &ccedil;a ne suffit pas, le risque &agrave; lui seul ne m&rsquo;int&eacute;resse pas plus que &ccedil;a : le risque induit la peur, la peur de perdre, de se rater, et &ccedil;a &ccedil;a tient juste en &eacute;veil, c&rsquo;est du survival mode, mais c&rsquo;est un peu masochiste, on s&rsquo;use plus vite, on se laisse moins aller, attention &agrave; ne pas s&rsquo;&eacute;touffer. Meilleure analogie, c&rsquo;est un peu comme du poker : il y a une grosse mise, donc plus d&rsquo;adr&eacute;naline, et plus &agrave; retirer de la relation. Ca c&rsquo;est de l&rsquo;analogie qui envoie du steak :-)</p>


	<p>Oui mais il y a autre chose, voyez-vous. Au poker, on mise gros ou pas, mais on ne mise pas en fermant les yeux. En voil&agrave; une deuxi&egrave;me analogie qu&rsquo;elle est bonne. Je n&rsquo;ai pas de carapace parce que je n&rsquo;en ai pas envie. Rajouter des bandages autour de son coeur c&rsquo;est comme si physiquement on rajoutait des bandages autour de sa t&ecirc;te : un jour on voit bien, 12 aux deux yeux, et puis on voit un peu flou, jusqu&rsquo;&agrave; ne voir que des silhouettes, puis &agrave; peine des ombres, puis plus rien du tout. Et autant je ne crois pas &ecirc;tre atteint du syndr&ocirc;me de Peter Pan, autant de la fa&ccedil;on dont certains &eacute;voluent en amour, j&rsquo;ai l&rsquo;impression que grandir c&rsquo;est mourir.</p>


	<p>Au sortir d&rsquo;une relation amoureuse, on essaie de faire le point, de prendre sur soi, de chercher ce qu&rsquo;on a mal fait, ce qu&rsquo;on a mal &eacute;valu&eacute;, ce qu&rsquo;on a mal compris, ce qu&rsquo;on a cherch&eacute; et qui n&rsquo;&eacute;tait pas chez l&rsquo;autre, ce dont on a essay&eacute; de se convaincre inutilement, bref ce qui doit changer. La fois d&rsquo;apr&egrave;s, il faut y aller naturellement mais pas retomber dans les m&ecirc;mes travers si possible. J&rsquo;ai tendance &agrave; &ecirc;tre excessif, &agrave; trop m&rsquo;inscrire dans la dur&eacute;e, &agrave; trop vouloir y croire, et je fais des super efforts pour aller contre cette tendance. J&rsquo;ai l&rsquo;impression de me conna&icirc;tre de mieux en mieux, m&ecirc;me si ce n&rsquo;est pas encore parfait. Et tout &ccedil;a marche plut&ocirc;t bien par les temps qui courent (comme le coup de t&ecirc;te dans le clavier pour ceux que j&rsquo;ai mail&eacute; r&eacute;cemment &agrave; ce sujet). Toujours pas de vrai sort de d&eacute;fense &agrave; l&rsquo;horizon, mais la prochaine fois que ma m&egrave;re me demandera <em>Comment va ton coeur ?</em>, je pourrai lui dire qu&rsquo;il est plus agile, plus conscient de ses d&eacute;fauts, qu&rsquo;il essaie de battre au meilleur rythme, mais qu&rsquo;il s&rsquo;en fout toujours de la perspective d&rsquo;&ecirc;tre &eacute;crabouill&eacute;.</p>


	<p>Petit &agrave; petit, on essaie aussi de changer le dosage entre volont&eacute; et coup de coeur. Trop compter sur la volont&eacute; fait aller &agrave; l&rsquo;encontre de son propre bien, et je pense m&rsquo;&ecirc;tre beaucoup fourvoy&eacute; sur ce terrain. Je commence &agrave; croire qu&rsquo;il y a un temps pour tout, et que mes discussions avec ma soeur sur le moiti&eacute;-sentiment-moiti&eacute;-volont&eacute; &eacute;taient compl&egrave;tement &agrave; c&ocirc;t&eacute; de la plaque, tout &ccedil;a c&rsquo;est dynamique, et on en fait vraiment ce qu&rsquo;on veut : au moins au d&eacute;but, au moins sur ce que je vis ces temps-ci, le 200% coup de coeur, au feeling, c&rsquo;est vraiment trop agr&eacute;able, &ccedil;a poutre, &ccedil;a roxe du jambon. M&ecirc;me si &ccedil;a va &eacute;galement dans le sens d&rsquo;une moindre protection de son petit coeur. Ca serait encore meilleur si j&rsquo;&eacute;vitais les bouff&eacute;es d&rsquo;angoisse inutiles vous me direz, mais je m&rsquo;am&eacute;liore sans cesse, et autant dire que &ccedil;a m&rsquo;emp&ecirc;che pas de respirer et de profiter du moment pr&eacute;sent sans trop r&eacute;fl&eacute;chir &agrave; la suite. Je pense que &ccedil;a ne serait pas moi non plus si je n&rsquo;avais pas parfois des petites crises comme ma soeurette, et &ccedil;a nous donne des sujets de conversation marrants. De toute fa&ccedil;on, me connaissant comme je me connais, ce n&rsquo;est pas la volont&eacute; qui manquera d&egrave;s qu&rsquo;il y en aura besoin :-)</p>


	<p>Pour finir, m&ecirc;me si &ccedil;a sort un peu du th&egrave;me de l&rsquo;article, j&rsquo;essaie de trouver quelqu&rsquo;un avec qui je serai bien. Ca commence &agrave; bien faire de sortir avec des filles qui ne sont pas du tout faites pour moi hein. Mais &ccedil;a, &ccedil;a se contr&ocirc;le pas forc&eacute;ment, c&rsquo;est proportionnel &agrave; la dose de coup de coeur, et inversement proportionnel &agrave; la volont&eacute; qu&rsquo;on met d&egrave;s le d&eacute;but. C&rsquo;est s&ucirc;rement le point o&ugrave; il faut essayer de se forger une carapace pour le coup, ou plut&ocirc;t un Ruban pour les afficionados de Final Fantasy (Ruban immunise contre toutes les alt&eacute;rations d&rsquo;Etat), mais autant se laisser aller &agrave; l&rsquo;instinct, on verra bien o&ugrave; &ccedil;a ira. J&rsquo;vous tiens au courant ^^</p>


	<p>Bon, sur ce, &agrave; la Dyns, des trucs qui ont rien &agrave; voir :</p>


	<p>PS: Je n&rsquo;arrive toujours pas &agrave; comprendre l&rsquo;Ile de la Tentation : j&rsquo;y mets le maximum, tout, rationnellement, les pousse &agrave; craquer, et en m&ecirc;me temps mon c&ocirc;t&eacute; Romeo+Juliette me pousse &agrave; rejeter tout &ccedil;a en bloc. Il n&rsquo;y a pas d&rsquo;amour dans ces couples, s&rsquo;il y en avait ils ne craqueraient pas, merde. <span class="caps">MERDE</span>. OK ?!?</p>


	<p><span class="caps">PPS</span>: J&rsquo;ai le dos compl&egrave;tement en vrac, je suis tout coinc&eacute;, et comme j&rsquo;ai aucun pote kin&eacute; dans la r&eacute;gion je crois que je vais soigner le mal par le mal en allant faire du v&eacute;lo ce soir. Etonnant non ?</p>