---
title: "Mesquineries"
---

<h1>Mesquineries</h1><p>Vendredi, je me suis fait racketter par l&rsquo;Etat. L&rsquo;honn&ecirc;tet&eacute; intellectuelle la plus &eacute;l&eacute;mentaire me pousse &agrave; signaler que tout cet argent a &eacute;t&eacute; en partie revers&eacute; par anticipation &agrave; deux personnes nettement moins friqu&eacute;es que moi, et que le reste sert aussi &agrave; me payer pour un moment encore. Je ne sais pas si un pied-de-nez via le timbre d&rsquo;une enveloppe suffira &agrave; les attendrir pour qu&rsquo;ils me remboursent, mais c&rsquo;est toujours &ccedil;a de gagn&eacute; sur ma propre culpabilit&eacute; d&rsquo;&ecirc;tre finalement incapable de g&eacute;rer mon fric&hellip;</p>
<p><img src="/assets/2008/9/14/impots.png" alt="" /></p>
<hr />
<p>Aujourd&rsquo;hui dimanche, finies les mesquineries de vendredi et de la veille. Une envie d&rsquo;&eacute;crire n&rsquo;importe quoi, de coder n&rsquo;importe quoi aussi. J&rsquo;ai commenc&eacute; un syst&egrave;me de blogging en Rails comme pr&eacute;vu ce matin, mais en fait j&rsquo;ai fait &ccedil;a pour rien, je n&rsquo;en r&eacute;cup&egrave;rerai que le design, ce serait trop lourd de refaire un truc aussi complet que Mephisto. M&ecirc;me le design n&rsquo;est pas encore tr&egrave;s propre en fait. Anyway. J&rsquo;ai aussi commenc&eacute; trois fois &agrave; &eacute;crire des choses, mais c&rsquo;&eacute;tait insipide, trop ressass&eacute;, j&rsquo;ai tout effac&eacute;. Je me suis pris pour Alexandre Jardin h&eacute;h&eacute;&hellip; Je recommencerai cet exercice un autre jour, parce que le rapport aux mots me manque, mais l&rsquo;inspiration et les nouvelles id&eacute;es aussi.</p>
<hr />
<p>Je vais profiter de cette soir&eacute;e d&rsquo;ataraxie<sup class="footnote"><a href="#fn1">1</a></sup> dans un bon bain avec un bon bouquin. Pourquoi pas s&rsquo;essayer &agrave; <a href="http://www.amazon.fr/LAlchimiste-Paulo-Coelho/dp/2253150908">un peu d&rsquo;Alchimie</a> ?</p>
<hr />
<p>Je songe tout de m&ecirc;me s&eacute;rieusement &agrave; <del>int&eacute;grer</del> fonder les <em>Mesquins du Monde</em><sup class="footnote"><a href="#fn2">2</a></sup>.</p>
<hr />
<p class="footnote"><sup>1</sup> La kikoololeuse du fond, tu arr&ecirc;tes tout de suite de penser &agrave; l&rsquo;IRC&hellip;</p>
<p class="footnote"><sup>2</sup> &copy; Fatcobra</p>
