---
title: "UMP 2.0 (beta)"
---

<h1>UMP 2.0 (beta)</h1><p>Depuis quelques jours, les annonces fusent de toute part ; &ccedil;a passe certainement inaper&ccedil;u pour le citoyen lambda, mais l&#8217;UMP a d&eacute;cid&eacute; de s&eacute;vir, en amplifiant le mouvement amorc&eacute; il y a quelques ann&eacute;es avec la <span class="caps">DADVSI</span> et la <span class="caps">LCEN</span>.</p>
<p><a href="http://maitre-eolas.fr/2009/02/16/1318-quelques-lecons-de-droit-et-meme-un-peu-d-economie-a-l-attention-de-luc-besson">Luc Besson part en croisade</a> contre le visionnage de films sur Internet (sauf s&#8217;il s&#8217;en met plein les poches bien s&ucirc;r). Fr&eacute;d&eacute;ric Lef&ecirc;vre, jamais &agrave; cours de conneries, encha&icirc;ne en l&#8217;appuyant. Voir <a href="http://maitre-eolas.fr/2009/02/18/1319-tout-le-monde-n-a-pas-le-talent-de-luc-besson">le d&eacute;montage en r&egrave;gle chez Maitre Eolas</a>, c&#8217;est bien marrant. Extrait :</p>
<blockquote>Je vous la refais en abr&eacute;g&eacute;, en shorter comme on dit sur le Net sans foi ni loi :<br />
<br />
&mdash;Que voulez-vous ?<br />
&mdash; Une commission d&#8217;enqu&ecirc;te.<br />
&mdash; Mais il y a d&eacute;j&agrave; une loi.<br />
&mdash; Alors je veux changer la loi.<br />
&mdash; Mais il y a une dimension internationale.<br />
&mdash; Alors je veux un G20 du Net.<br />
<br />
D&eacute;branchez-le, encore deux questions, et il demande l&#8217;usage de l&#8217;arme nucl&eacute;aire.</blockquote>
<p>Mieux, notre ministre des mus&eacute;es, Christine Albanel, a commenc&eacute; avec sa merveilleuse loi <span class="caps">HADOPI</span> (en gros, on te tape deux fois sur les doigts si tu t&eacute;l&eacute;charges ill&eacute;galement, ensuite on te coupe ton abo internet). Elle enchaine en voulant brider les spots wifi publics (comme ceux de McDo) en maintenant une &#8220;liste blanche&#8221; des sites <span class="caps">UMP</span>-autoris&eacute;s. Elle ne sait s&ucirc;rement pas qu&#8217;il existe des centaines de millions de sites qu&#8217;il faudrait qualifier, vive les futurs rat&eacute;s&#8230; Voir conditions g&eacute;n&eacute;rales <a href="http://www.pcinpact.com/actu/news/49187-hot-spots-wifi-hadopi-antipiratage.htm">ici</a>.</p>
<p><a href="http://www.authueil.org/?2009%2F02%2F18%2F1234-creation-a-propos-de-l-internet">Authueil propose une analyse ici</a>, qui a le m&eacute;rite de replacer au centre du d&eacute;bat ce qui importe : <del>les auteurs</del> le pognon.</p>
<p>Enfin, tout &ccedil;a nous pr&eacute;pare un joli Stalag 13 ; les plus faibles se feront pincer, les m&eacute;chants non, et au milieu, la foule, vous, moi, on aura plus qu&#8217;&agrave; s&#8217;enfuir en Chine pour trouver un Internet &agrave; peu pr&egrave;s potable et moins censur&eacute;. Dingue.</p>
<p>PS: en guise de PS optimiste, il faut r&eacute;aliser que tous ces gens ont beaucoup de pouvoir, beaucoup de moyens, mais ils n&#8217;y connaissent tellement rien qu&#8217;ils seraient capables de se rater. Hihihi :-)</p>
<p><span class="caps">EDIT</span>: voir <a href="http://standblog.org/blog/post/2009/02/18/Le-rod%C3%A9o-peplum-d-Hadopi" title="Mozilla Europe">la note de Tristan</a> sur tout &ccedil;a</p>