---
title: "Question de vocabulaire"
---

<h1>Question de vocabulaire</h1><p>Christine Albanel, ministre des mus&eacute;es, a r&eacute;ussi &agrave; montrer au monde l&#8217;&eacute;tendue de sa b&ecirc;tise et de son ignorance en arrivant &agrave; faire passer la loi Internet et Cr&eacute;ation sur un vote de 16 d&eacute;put&eacute;s qui se courraient apr&egrave;s dans l&#8217;h&eacute;micycle. &#8220;Internet et Cr&eacute;ation&#8221;, mon fessier oui. On instaure ni plus ni moins que BigBrother on Internet, sous le pr&eacute;texte falacieux de prot&eacute;ger les droits d&#8217;auteurs, en emp&ecirc;chant au passage les artistes souhaitant &ecirc;tre distribu&eacute;s librement de le faire. On inaugure aussi une police administrative du net, qui pourra vous couper votre acc&egrave;s Internet apr&egrave;s deux avertissements, mais, et c&#8217;est &ccedil;a le plus croustillant, supposera que vous &ecirc;tes coupables. En cas de contestation, vous devrez &ecirc;tre &eacute;quip&eacute; d&#8217;un logiciel propri&eacute;taire prouvant votre innocence ; selon toute vraissemblance, ce logiciel ne fonctionnera pas sous Mac ni sous Linux/Unix. Bullshit.</p>
<p>Les d&eacute;bats houleux ont bien montr&eacute; &agrave; quelle point cette loi n&#8217;&eacute;tait pas pr&eacute;par&eacute;e, et surtout &agrave; quel point ses d&eacute;fenseurs ne comprennent rien aux notions les plus basiques du monde informatique qu&#8217;ils pr&eacute;tendent r&eacute;guler. On retiendra en particulier les pare-feux d&#8217;OpenOffice au minist&egrave;re de la culture. Gourgandine va.</p>
<p>Enfin, l&#8217;action de notre gouvernement ch&eacute;ri va pousser au d&eacute;veloppement des techniques cryptographiques et c&#8217;est tant mieux. A ce point d&#8217;incomp&eacute;tence, il y a de quoi rougir de honte, se foutre des claques ou carr&eacute;ment se suicider direct. L&#8217;humanit&eacute; vous le rendra. Ou pas.</p>
<p>BON. Autre question de vocab, un peu plus joyeuse. On ne dit pas &#8220;oh quelle jolie mise en ab&icirc;me&#8221;, mais &#8220;oh le joli nouveau portable&#8221; :</p>
<p style="text-align:center;"><img src="http://blog.jbbarth.com/assets/0000/0033/nc10.jpg" alt="" /></p>
<p>J&#8217;ai craqu&eacute; le week-end dernier pour un Samsung NC10, 4 &agrave; 6h d&#8217;autonomie selon utilisation, que je me suis d&eacute;p&ecirc;ch&eacute; de passer en Ubuntu Jaunty, et j&#8217;en suis RA-VI :-)</p>
<p>Sur ce, t&eacute;l&eacute;chargez-bien.</p>
