---
title: "De la démago, des sciences, et des maths"
---

<h1>De la démago, des sciences, et des maths</h1><p>Cette semaine :</p>
<ul>
	<li>Claude All&egrave;gre traite Nicolas Hulot d&#8217;imb&eacute;cile : <a href="http://merome.net/blog/index.php?post/2009/09/28/%22Claude-All%C3%A8gre-est-un-imb%C3%A9cile%22">un article sympa &agrave; propos de &ccedil;a</a> ; rappelons tout de m&ecirc;me que Claude All&egrave;gre p&egrave;te les plombs r&eacute;guli&egrave;rement, et qu&#8217;on peut tout &agrave; fait &ecirc;tre un bilogiste tr&egrave;s dou&eacute; sur des sujets particuliers, et un parfait ignorant sur d&#8217;autres th&egrave;mes. Le discours qui range tous les scientifiques dans le m&ecirc;me panier me gonfle au plus au point, et Luc Ferry a perdu toute mon estime &agrave; ce sujet lors d&#8217;une &eacute;mission de <span class="caps">LCPAN</span>. Au passage, il ressort la super-comparaison d&#8217;All&egrave;gre entre m&eacute;t&eacute;orologie et climatologie, youpi. Comme quoi les imb&eacute;ciles sortent tous du bois en m&ecirc;me temps&#8230;</li>
	<li>les journalistes et les politiques se donnent le mot pour casser les couilles &agrave; tout le monde avec 24 abrutis qui se sont suicid&eacute;s chez France Telecom ; c&#8217;est dr&ocirc;le, &ccedil;a coincide curieusement avec le taux de suicide moyen en France vu le personnel de FT (voir par exemple <a href="http://aixtal.blogspot.com/2009/09/buzz-suicides-france-telecom.html#c3967255386573033316">ici</a>, le chiffre est sourc&eacute; et d&eacute;taill&eacute; sur Wikipedia). Certes c&#8217;est triste et le probl&egrave;me n&#8217;est pas que math&eacute;matique, encore qu&#8217;en &eacute;liminant les biais cit&eacute;s dans les commentaires de l&#8217;article on ne doit pas &ecirc;tre bien loin de la moyenne. Mais de l&agrave; &agrave; en faire LE probl&egrave;me du moment&#8230; Si c&#8217;est tellement l&#8217;enfer la positive generation, la porte est grande ouverte, isn&#8217;t it ?</li>
</ul>
