---
title: "Vroum"
---

<h1>Vroum</h1><p>Tristan Nitot a fait un billet qui m&#8217;a beaucoup int&eacute;ress&eacute; hier, <a href="http://standblog.org/blog/post/2009/12/21/Quelques-notes-sur-la-culture-et-Internet">Quelques notes sur la culture et Internet</a>.</p>
<p>D&eacute;j&agrave; &ccedil;a fait des pistes de r&eacute;flexion pour imaginer ce que sera la soci&eacute;t&eacute; de demain. On va nettement plus loin que les b&ecirc;tises du gouvernement actuel (Christine is watching you :-)). Notamment sur le paradoxe de la disparition de la raret&eacute; avec Internet : toute l&#8217;&eacute;contomie actuelle repose sur le fait que les produits sont &#8220;rares&#8221; : si je m&#8217;ach&egrave;te un CD, je paye toute une ribambelle de parasites (ce n&#8217;est pas p&eacute;joratif dans cette phrase) qui ont packag&eacute;, transport&eacute;, mis en rayon, etc. la musique que je veux &eacute;couter au final. C&#8217;est l&agrave; que l&#8217;informatique arrive : le transport, la duplication, voire la pub sont quasi gratuites. Comment b&acirc;tir une &eacute;conomie l&agrave;-dessus ? Et comment les non-parasites (les cr&eacute;ateurs pour la musique) peuvent vivre dans un tel mod&egrave;le ? Le sujet m&eacute;rite qu&#8217;on y r&eacute;fl&eacute;chisse en tout cas :)</p>
<p>Ensuite, &agrave; titre professionnel, je ne suis jamais aussi content que lorsque j&#8217;utilise de jolis outils libres, voire que je les adapte &agrave; mes besoins (<a href="http://www.redmine.org/">redmine</a> et <a href="http://www.nagios.org/">nagios</a> sont de parfaits exemples du genre d&#8217;errements que je peux avoir au boulot). A titre personnel, je d&eacute;veloppe un peu sur mon temps libre (voir <a href="http://github.com/jbbarth">mon espace sur Github</a>), je n&#8217;utilise que des PCs sous des syst&egrave;mes libres (ce n&#8217;est pas vrai pour mon t&eacute;l&eacute;phone j&#8217;admets) et j&#8217;&eacute;vang&eacute;lise &agrave; l&#8217;occasion autour de moi. Bref, je baigne dans cette communaut&eacute;.</p>
<p>L&#8217;article de Tristan met un peu en lumi&egrave;re le moteur qui m&#8217;agite lorsque je mets &agrave; disposition des sources de mes programmes sur Internet, sans toutefois &ecirc;tre complet. En dehors des aspects relationnels, communautaires, qui m&#8217;int&eacute;ressent, je dirais que j&#8217;ai 3 moteurs dans ce genre de d&eacute;marche. Dans le d&eacute;sordre :</p>
<ol>
	<li>la reconnaissance des pairs ou des gens qui utiliseront mon code</li>
	<li>la satisfaction de penser que des gens utiliseront mon code et en seront contents : c&#8217;est proche mais tout de m&ecirc;me diff&eacute;rent, je n&#8217;esp&egrave;re pas forc&eacute;ment une boite de chocolat, mais je suis content de penser que ce que j&#8217;ai fait sera utile &agrave; d&#8217;autres (je pense par exemple &agrave; Teamscript 4)</li>
	<li>l&#8217;am&eacute;lioration continue : mettre mon code &agrave; disposition sous une licence qui va bien, c&#8217;est laisser la porte ouverte &agrave; ce que d&#8217;autres gens (potentiellement bien plus comp&eacute;tents que moi) am&eacute;liorent ce que j&#8217;ai commenc&eacute; &agrave; faire ; c&#8217;est comme &ccedil;a que se construisent les meilleurs produits informatiques de nos jours (&agrave; commencer par les OS)</li>
</ol>
<p>Je trouve ces deux sujets vraiment passionnants. Dommage qu&#8217;on entende jamais ce genre de th&egrave;se &agrave; plus haut niveau, et qu&#8217;on s&#8217;arr&ecirc;te &agrave; la b&ecirc;te d&eacute;fense d&#8217;int&eacute;r&ecirc;ts priv&eacute;s. Je suis compl&egrave;tement d&eacute;pass&eacute; par la course folle aux profits qu&#8217;on peut soup&ccedil;onner chez de nombreux parasites des milieux culturels. La motivation devrait &ecirc;tre de faire partager ce qu&#8217;on aime, ce qui sort de notre t&ecirc;te ou de nous. La gloire &eacute;ternelle, l&#8217;exposition m&eacute;diatique, l&#8217;argent qui coule &agrave; flot&#8230; bof.</p>