---
title: "Très en vrac"
---

<h1>Très en vrac</h1><p>En super-vrac m&ecirc;me :</p>
<ul>
	<li>je me suis enfin sorti du Rhume A, la variante non-mortelle de la Grippe A</li>
	<li>en ce moment je deviens un gros adepte de <a href="http://www.korben.info/installer-chromium-sous-ubuntu.html">Chrome/Chromium</a> ; Chrome est le navigateur web made in Google. C&#8217;est <strong>tellement</strong> rapide que j&#8217;&eacute;tais presque sur le point de d&eacute;sinstaller Firefox de mon netbook. Vivement que <a href="http://www.korben.info/sortie-de-firefox-3-6-alpha.html">Firefox 3.6 sorte</a> (et surtout que les plugins soient mis &agrave; jour), ou que Chromium voit arriver tous mes plugins pr&eacute;f&eacute;r&eacute;s.</li>
	<li><span class="caps">UNIX</span> a <a href="http://www.framablog.org/index.php/post/2009/08/10/unix-40-ans">40 ans</a> cet &eacute;t&eacute; ! (<a href="http://www.gcu.info/2009/08/lunivers-a-40-ans/">via</a>)</li>
	<li>je vais bient&ocirc;t pouvoir comprendre mes chats gr&acirc;ce &agrave; <a href="http://www.korben.info/traducteur-de-waouf-wouf.html">ce merveilleux bijou technologique</a></li>
	<li>j&#8217;&eacute;tais un peu mort de rire en lisant cet article de Tristan Nitot : <a href="http://standblog.org/blog/post/2009/08/05/S-attaquer-aux-tabous-pour-devenir-&eacute;colo">S&#8217;attaquer aux tabous pour devenir &eacute;colo</a>. O&ugrave; l&#8217;on souligne en particulier qu&#8217;utiliser des ampoules basse conso, c&#8217;est bien moins efficace que limiter le nombre d&#8217;enfants (la croissance de la population mondiale &eacute;tant suicidaire &agrave; long terme)</li>
	<li>un <a href="http://www.korben.info/lexploit-du-jour.html">joli fake</a> qui donne envie de faire plouf (dans 2 jours !!)</li>
	<li>des <a href="http://www.korben.info/le-robot-tony-parker.html">robots qui jouent</a>, des <a href="http://www.korben.info/un-robot-presse.html">robots qui courent</a>, et encore des <a href="http://www.boston.com/bigpicture/2009/08/more_robots.html">jolis robots</a>. On est a un tournant, m&ecirc;me si c&#8217;est encore certainement tr&egrave;s compliqu&eacute; &agrave; produire et &agrave; rentabiliser, la robotique devient extr&ecirc;mement performante, <a href="http://fr.wikipedia.org/wiki/I,_Robot">Asimov</a> n&#8217;est pas loin !</li>
	<li>une <a href="http://www.think-underground.com/post/2009/07/26/osalt.com&nbsp;:-trouver-des-&eacute;quivalents-libres-&agrave;-des-logiciels-propri&eacute;taires">chouette initiative</a> pour trouver des &eacute;quivalents libres aux logiciels propri&eacute;taires ; mais le probl&egrave;me reste entier, il n&#8217;y a toujours pas (&agrave; mon sens) d&#8217;&eacute;quivalent s&eacute;rieux &agrave; .. Visio par exemple.</li>
	<li>ahah, merci la liste railsfrance, qui m&#8217;a fait d&eacute;couvrir <a href="http://lmgtfy.com/">ce site</a> &agrave; envoyer aux imb&eacute;ciles qui polluent les forums/groupes sans m&ecirc;me chercher eux-m&ecirc;mes auparavant</li>
	<li>Korben nous montre <a href="http://www.korben.info/skycar-la-premiere-voiture-volante-grand-public.html">la premi&egrave;re voiture volante grand public</a>, wOw !!</li>
	<li>ruby-istes, web developpers, allez voir <a href="http://ljouanneau.com/blog/post/2008/04/08/775-du-ruby-dans-vos-pages-web">&ccedil;a</a> :)))</li>
	<li>quelques liens, &agrave; froid, sur les d&eacute;boires du jeune rappeur &eacute;nerv&eacute; Orelsan : <a href="http://www.maitre-eolas.fr/post/2009/07/21/Quelques-mots-sur-l-affaire-Orelsan">poum</a>, <a href="http://david.monniaux.free.fr/dotclear/index.php/2009/07/22/504-orelsan-et-les-gens-influencables">poum</a>, et <a href="http://david.monniaux.free.fr/dotclear/index.php/2009/07/22/505-de-la-realite-et-de-la-fiction">poum</a>. Et un autre pour la route, <a href="http://david.monniaux.free.fr/dotclear/index.php/2009/07/24/508-de-la-censure">plouf</a> : j&#8217;ai envie de pleurer quand je vois ce qu&#8217;on fait de la libert&eacute; d&#8217;expression en France, j&#8217;&eacute;prouve une haine f&eacute;roce contre tous ces penseurs indulgents qui victimisent les gens et les dispensent de penser (&ccedil;a me rappelle mes cours de philo sur la religion&#8230;). On devrait &ecirc;tre libre de tout dire, punto.</li>
	<li>les <a href="http://www.sexactu.com/wp-content/uploads/2009/07/zZ5Jn.gif">choses &agrave; dire pendant l&#8217;amour</a> chez <a href="http://www.sexactu.com/">Ma&iuml;a</a>, ahahah</li>
	<li>toujours chez Ma&iuml;a, <a href="http://www.sexactu.com/2009/07/18/les-vieux-me-gonflent/">les vieux me gonflent</a> &lt; pareillement, quand on lit ce genre de stupidit&eacute; on esp&egrave;re que l&#8217;euthanasie se g&eacute;n&eacute;ralise rapidement :)</li>
	<li><span class="caps">CSS</span> <a href="http://ljouanneau.com/blog/post/2009/07/17/Transformations-2D-et-3D-en-CSS">progresse</a>, et <a href="http://www.canvasdemos.com/2009/07/23/dragon-heart/">html 5 aussi</a> ; vous ne profiterez de ce dernier lien qu&#8217;avec Firefox 3.5 minimum, &ccedil;a n&#8217;impressionnera que les d&eacute;veloppeurs web, mais wouhouh quand m&ecirc;m :)</li>
</ul>
<p>Bon, ay&eacute;, ma liste ReadItLater est enfin vide (tu parles Charles, j&#8217;ai pass&eacute; au moins 50 liens sur mon compte Delicious&#8230;), je peux partir en vacances ! Ahem.</p>