---
title: "Rien ne nous survivra"
---

<h1>Rien ne nous survivra</h1><p>Quand je vois les conneries que vient de sortir <a href="http://fr.wikipedia.org/wiki/Jacques_S&eacute;gu&eacute;la">Jacques S&eacute;gu&eacute;la</a> dans l&#8217;&eacute;mission de Ruquier, le roman de <a href="http://www.sexactu.com/">Ma&iuml;a Mazaurette</a> que je suis en train de lire, <a href="http://www.amazon.fr/Rien-nous-survivra-pire-avenir/dp/2354080514">Rien ne nous survivra &#8211; Le pire est avenir</a> est tout de suite plus clair : il y a des vieux qu&#8217;il vaudrait mieux tuer.</p>
<p>Ce monsieur vient d&#8217;expliquer que le Net est la pire saloperie que l&#8217;homme ait jamais invent&eacute;, parce qu&#8217;on pouvait descendre une r&eacute;putation en quelques minutes. Il parlait en l&#8217;occurrence pendant l&#8217;interview de Julien Dray, qui venait expliquer son livre, la cabale m&eacute;diatique contre lui, les informations non v&eacute;rifi&eacute;es, mais qui dit tout de m&ecirc;me autre chose du Net, heureusement. J&#8217;ai l&#8217;impression que ce raisonnement est en vogue chez tout un tas de vieux d&eacute;bris inadapt&eacute;s, dont pas mal de politicons effray&eacute;s par le monde qui les entoure.</p>
<p>J&#8217;aime Internet, j&#8217;aime vraiment Internet. J&#8217;aime qu&#8217;Internet soit neutre, et j&#8217;esp&egrave;re qu&#8217;il le restera malgr&eacute; la volont&eacute; de certains gouvernements dont le n&ocirc;tre. J&#8217;aime &eacute;chapper aux medias centralis&eacute;s, avoir acc&egrave;s &agrave; diff&eacute;rentes opinions sur les sujets qui m&#8217;int&eacute;ressent, et je me m&eacute;fie de tous ceux qui veulent en faire un <a href="http://www.fdn.fr/internet-libre-ou-minitel-2.html">minitel 2.0</a>.</p>
<p>Par les temps qui courrent, ce n&#8217;est pas la D&eacute;claration des Droits de l&#8217;Homme qui garantit les libert&eacute;s d&#8217;expression ou d&#8217;opinion. C&#8217;est par exemple Twitter qui permet d&#8217;informer sur les &eacute;lections en Iran, o&ugrave; les medias traditionnels se seraient faits tuer. Ce sont des blogueurs qui s&#8217;escriment &agrave; rendre moins lisse les informations des medias traditionnels et des agences de presse. C&#8217;est aussi les chaines que m&#8217;envoie ma m&egrave;re, qui sont tantot droles tantot s&eacute;rieuses, mais qui font r&eacute;fl&eacute;chir les gens. Cette diabolisation du Net n&#8217;a pas lieu d&#8217;&ecirc;tre. Les gens comme Jacques S&eacute;gu&eacute;la redoutent les informations non contr&ocirc;l&eacute;es, je veux leur dire qu&#8217;ils ont raison d&#8217;avoir peur.</p>
<p>Pour me remettre de bonne humeur, je finirai sur une phrase de Desproges au Tribunal des Flagrants D&eacute;lires :<br />
<strong><em>Jacques S&eacute;gu&eacute;la est-il un con ? De deux choses l&#8217;une : ou bien Jacques S&eacute;gu&eacute;la est un con, et &ccedil;a m&#8217;&eacute;tonnerait quand m&ecirc;me un peu ; ou bien Jacques S&eacute;gu&eacute;la n&#8217;est pas un con, et &ccedil;a m&#8217;&eacute;tonnerait quand m&ecirc;me beaucoup !</em></strong></p>