---
title: "ZzZzz. Ou pas."
---

<h1>ZzZzz. Ou pas.</h1><p>Impossible de dormir correctement cette nuit. Deuxi&egrave;me jour. Tu te tournes dans ton lit, tu <a href="http://xkcd.com/571/">comptes les moutons</a>, tu fais un calin au ragondin, l&#8217;ennui quoi.</p>
<p>Bon, le monde va mal :</p>
<ul>
	<li>le pape serait un ancien nazi, mais bon, on s&#8217;en fout un peu, <a href="http://www.authueil.org/?2009/05/12/1324-ca-devait-bien-arriver">ils l&#8217;&eacute;taient tous &agrave; cette p&eacute;riode</a>, c&#8217;&eacute;tait une mode, comme les tamagochis dans le d&eacute;but des 90&#8217;s</li>
	<li>la loi Hadopi est pass&eacute;e &agrave; l&#8217;Assembl&eacute;e. Elle passera au S&eacute;nat, vu que le PS s&#8217;abstient. Reste le conseil constitutionnel, mais soyons r&eacute;alistes, il y a peu de chances. Cela dit, avant que ce soit appliqu&eacute;&#8230; Bref, Albanel devrait <a href="http://www.vicnent.info/blog/index.php?2009/05/12/1230-reclusion-a-la-honte-perpetuelle">&ecirc;tre condamn&eacute;e &agrave; la R&eacute;clusion &agrave; la Honte Perp&eacute;tuelle</a> ; tant de mauvaise foi, de mensonges, d&#8217;incomp&eacute;tence, &ccedil;a ne devrait pas &ecirc;tre permis &agrave; un si haut niveau.</li>
	<li>que le site soit en effet pirat&eacute; ou non, &ccedil;a la fout mal : Rachida Dati, qui est quand m&ecirc;me ministre, insulte Elizabeth Guigou en direct sur le site internet du minist&egrave;re de la justice : <a href="http://www.presse.justice.gouv.fr/index.php?rubrique=11363&amp;article=17230">ahah</a> et <a href="http://www.presse.justice.gouv.fr/index.php?rubrique=11363&amp;article=17231">ahah</a>. Quand m&ecirc;me, fallait oser: <code>Compte tenu de l&rsquo;intelligence de Mme Guigou, celle-ci devrait d&eacute;roger au principe archa&iuml;que selon lequel tout pr&eacute;d&eacute;cesseur m&eacute;sestime ses successeurs.</code></li>
	<li>le monde entier est en crise ; il y a 50000 chomeurs de plus tous les mois en France ; et &ccedil;a fait <strong>deux mois</strong> qu&#8217;on nous casse les coui*lles avec Continental, soit &#8230; 1000 p&eacute;quins. Ok c&#8217;est super triste, mais c&#8217;est la vie les mecs, arr&ecirc;tez de nous les briser et on passe &agrave; autre chose l&agrave;. En plus on les pr&eacute;vient, et ils touchent des indemnit&eacute;s. Les 49000 autres ont pas cass&eacute; une sous-pr&eacute;fecture et mis le feu partout o&ugrave; ils pouvaient. M&ecirc;me combat pour Molex et autres hein.</li>
	<li>ah et puis la grippe du cochon. Parlons-en. Encore un truc qui fait trembler dans les chomi&egrave;res. Heureusement qu&#8217;on regarde &#8220;C dans l&#8217;air&#8221; pour se rendre compte que les sp&eacute;cialistes savent que c&#8217;est chaotique et restent sceptiques face &agrave; tout &ccedil;a.</li>
	<li><a href="http://www.lefigaro.fr/sport/2009/05/13/02001-20090513ARTFIG00019-ferrari-et-renault-menacent-de-quitter-la-f1-.php">Ferrari et Renault risquent de quitter la F1</a> ; wow &ccedil;a doit &ecirc;tre la crise ! Ah mais non, lisez bien : ils boudent parce qu&#8217;on veut limiter leur budget &agrave; 45 millions d&#8217;euros la saison prochaine, et comme actuellement ils d&eacute;pensent beaucoup plus, ils ont peur de ne pas avoir le temps de se retourner. Ahah.</li>
	<li>il est 7h et j&#8217;ai dormi 3h en tout. En pointill&eacute;s. Et merde ; hop, au boulot :-)</li>
</ul>
