---
title: "Diaspora & panurgisme"
---

<h1>Diaspora & panurgisme</h1><p><a href="http://joindiaspora.com/">Diaspora</a>.</p>
<p>C&#8217;est le truc qui m&#8217;aura &eacute;nerv&eacute; dans les news informatiques des 2 derni&egrave;res semaines. De nombreux signaux tendent &agrave; montrer que <a href="http://facebook.com/">Facebook</a> se soucie de moins en moins du respect des donn&eacute;es priv&eacute;es de ses utilisateurs. 60% des utilisateurs penseraient m&ecirc;me <a href="http://www.pcinpact.com/actu/news/57080-facebook-parametres-vie-privee-sondage.htm">&agrave; quitter Facebook</a>. Et voil&agrave; qu&#8217;on a droit &agrave; un festival d&#8217;articles sur 4 gus qui ont lev&eacute; 170k&euro; et des bananes pour monter une alternative libre &agrave; Facebook, Diaspora.</p>
<p>Libre ? Ah euh oui, enfin un jour quoi. D&eacute;j&agrave; quand il y aura quelque chose &agrave; montrer. Pour l&#8217;instant, il n&#8217;y a rien, il y a de la com&#8217; et c&#8217;est tout. Les formats d&#8217;&eacute;change ? Les technos qui seront employ&eacute;es/support&eacute;es ? On n&#8217;en sait rien. Il y a l&agrave; juste du buzz, juste des mecs qui ont lev&eacute; du fric sur rien. M&ecirc;me le grand Tristant Nitot se fait prendre <a href="http://standblog.org/blog/post/2010/05/12/apres-Facebook-Diaspora">&agrave; un enthousiasme un peu absurde</a>.</p>
<p>Seulement la messe semble dite, ce projet va dans le mur. Comme je n&#8217;ai pas eu le temps d&#8217;&eacute;crire cet article en temps et en heure, d&#8217;autre ont bien r&eacute;sum&eacute; la situation pour moi, et je ne peux qu&#8217;approuver :</p>
<ul>
	<li><a href="http://t37.net/7-raisons-pour-lesquelles-diaspora-le-facebook-ouvert-est-condamne-davance.html">7 raisons pour lesquelles Diaspora, l&#8217;alternative ouverte &agrave; Facebook est condamn&eacute;e d&#8217;avance</a> chez Fr&eacute;d&eacute;ric de Villamil, mister Typo</li>
	<li><a href="http://37signals.com/svn/posts/2330-diasporas-curse">Diaspora&#8217;s Curse</a> par Jason Fried de chez 37signals</li>
</ul>
<p>C&#8217;est lamentable qu&#8217;on fasse de la pub &agrave; quelque chose qui n&#8217;est <strong>rien</strong>, juste parce que le Times en a fait un article. Qui plus est quand on voit fleurir les alternatives tangibles, comme <a href="http://movim.eu">Movim</a>, avec du vrai code, des trucs qu&#8217;on peut essayer, tout &ccedil;a..</p>
<p>B&ecirc;&ecirc;&ecirc;&ecirc;h !</p>
